; ModuleID = 'async_executor.1331364fa120f92d-cgu.0'
source_filename = "async_executor.1331364fa120f92d-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::sys::thread_local::fast_local::lazy::Storage<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>" = type { %"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>>" }
%"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>>" = type { %"std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>" }
%"std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>" = type { i64, [4 x i64] }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%"concurrent_queue::bounded::Slot<async_task::runnable::Runnable>" = type { %"core::sync::atomic::AtomicUsize", ptr }
%"concurrent_queue::unbounded::Slot<async_task::runnable::Runnable>" = type { ptr, %"core::sync::atomic::AtomicUsize" }
%"slab::Entry<core::task::wake::Waker>" = type { ptr, [1 x i64] }
%"core::task::wake::Waker" = type { %"core::task::wake::RawWaker" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !29, identifier: "3b9dc1cd24e5f6261916f3a71a8e93ed")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::pal::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !19, templateParams: !162, identifier: "5cc60cf3bc5ca3351bc45c96fb2576d0")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64, flags: DIFlagProtected)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::pal::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !29, identifier: "93c379795faa0383c896fabe3f393c")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "pal", scope: !26)
!26 = !DINamespace(name: "sys", scope: !18)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !31, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !32, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "f6fab78402c7921c81b48f94ff59f12a")
!32 = !DINamespace(name: "result", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !31, file: !2, size: 64, align: 64, elements: !36, templateParams: !29, identifier: "f20382f78447208541d43a2eb7c7b177", discriminator: !160)
!36 = !{!37, !156}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !35, file: !2, baseType: !38, size: 64, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !39, templateParams: !41, identifier: "7fff08edb161cdb6f65adbe333abb587")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!41 = !{!42, !43}
!42 = !DITemplateTypeParameter(name: "T", type: !7)
!43 = !DITemplateTypeParameter(name: "E", type: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !29, identifier: "9481a9f9dd3a514fccbd1ee45fe835c0")
!45 = !DINamespace(name: "error", scope: !17)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !44, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !50, templateParams: !29, identifier: "d19e764dc7d400364cac938e600e6e8e")
!49 = !DINamespace(name: "repr_bitpacked", scope: !45)
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !48, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagPrivate)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !57, identifier: "219b4814660fc803ec7ad9770695a")
!53 = !DINamespace(name: "non_null", scope: !54)
!54 = !DINamespace(name: "ptr", scope: !33)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !{!42}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !48, file: !2, baseType: !59, align: 8, offset: 64, flags: DIFlagPrivate)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !61, identifier: "b3a9535088463228dd721e3df15a74b4")
!60 = !DINamespace(name: "marker", scope: !33)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "T", type: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !64, templateParams: !29, identifier: "2d842b368858db53e5e95cb68f18ba4d")
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 128, align: 64, elements: !66, templateParams: !29, identifier: "7b170337c204a193ef1904d1caedcc36", discriminator: !155)
!66 = !{!67, !133, !137, !151}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !65, file: !2, baseType: !68, size: 128, align: 64, extraData: i128 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !69, templateParams: !72, identifier: "ec7ef559ca1c1873dcb949d9353e83c4")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !71, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!71 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "C", type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !76, templateParams: !29, identifier: "4a83a1c02e32f7677e925d15cbf9f223")
!76 = !{!77, !122}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !75, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !45, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !80)
!79 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!81 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !75, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPrivate)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !124, templateParams: !29, identifier: "fc4c978384b58c14d0c3b28c9444e0a6")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !2, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !29, identifier: "af492d0fde630cae993a48fd15ada2c5")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !123, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 10, lowerBound: 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !65, file: !2, baseType: !134, size: 128, align: 64, extraData: i128 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !135, templateParams: !72, identifier: "c722108768e442de944796846599cf6a")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !78, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !65, file: !2, baseType: !138, size: 128, align: 64, extraData: i128 2)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !139, templateParams: !72, identifier: "a889002bec16644f89535583317530e7")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !143, templateParams: !29, identifier: "1cc23320a6f881d629e59649fa6dee8b")
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !142, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !142, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !147, templateParams: !29, identifier: "9277eecd40495f85161460476aacc992")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !2, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !65, file: !2, baseType: !152, size: 128, align: 64, extraData: i128 3)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !153, templateParams: !72, identifier: "6be90b54a330d2fbea2d9f76e0bfb292")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !152, file: !2, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !35, file: !2, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !158, templateParams: !41, identifier: "a184e6321da6a5ec587e5ea90c206f8c")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !31, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!161 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !22)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !167, vtableHolder: !9, templateParams: !29, identifier: "3ce104670d23cbc41299f657a9cf1bea")
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !166, file: !2, baseType: !6, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "<core::cell::BorrowMutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::cell::BorrowMutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !175, vtableHolder: !180, templateParams: !29, identifier: "66a15e4ba0a44a3456f09c555c1b8eef")
!175 = !{!176, !177, !178, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !174, file: !2, baseType: !6, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !174, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !174, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowMutError", scope: !181, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "8170d1cee2b16df69b0fe1e464b7845")
!181 = !DINamespace(name: "cell", scope: !33)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<slab::Slab<core::task::wake::Waker>>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<slab::Slab<core::task::wake::Waker>>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !185, vtableHolder: !190, templateParams: !29, identifier: "4961a4ab2cfbb45eed9a422bc514bc9f")
!185 = !{!186, !187, !188, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !184, file: !2, baseType: !6, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !184, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<slab::Slab<core::task::wake::Waker>>>", scope: !191, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !193, templateParams: !317, identifier: "ca895936a34ff4274a8d2d71c9dfef4e")
!191 = !DINamespace(name: "poison", scope: !192)
!192 = !DINamespace(name: "sync", scope: !18)
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !190, file: !2, baseType: !195, size: 128, align: 64, flags: DIFlagPrivate)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<slab::Slab<core::task::wake::Waker>>", scope: !196, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !197, templateParams: !310, identifier: "2e7cb01a7e9f59f5bb4de0f02368feb0")
!196 = !DINamespace(name: "mutex", scope: !192)
!197 = !{!198, !312}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !195, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagPrivate)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<slab::Slab<core::task::wake::Waker>>", baseType: !200, size: 64, align: 64, dwarfAddressSpace: 0)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<slab::Slab<core::task::wake::Waker>>", scope: !196, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !201, templateParams: !310, identifier: "ca7317f7a46a57927aadaf440459f4c")
!201 = !{!202, !220, !232}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !200, file: !2, baseType: !203, size: 32, align: 32, flags: DIFlagPrivate)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !204, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !207, templateParams: !29, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!204 = !DINamespace(name: "futex", scope: !205)
!205 = !DINamespace(name: "mutex", scope: !206)
!206 = !DINamespace(name: "sync", scope: !26)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !203, file: !2, baseType: !209, size: 32, align: 32, flags: DIFlagPrivate)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !210, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !212, templateParams: !29, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!210 = !DINamespace(name: "atomic", scope: !211)
!211 = !DINamespace(name: "sync", scope: !33)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !209, file: !2, baseType: !214, size: 32, align: 32, flags: DIFlagPrivate)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !181, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !215, templateParams: !218, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !214, file: !2, baseType: !217, size: 32, align: 32, flags: DIFlagPrivate)
!217 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!218 = !{!219}
!219 = !DITemplateTypeParameter(name: "T", type: !217)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !200, file: !2, baseType: !221, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !191, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !222, templateParams: !29, identifier: "f02169750979dbd37c1ab4c868f04f71")
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !221, file: !2, baseType: !224, size: 8, align: 8, flags: DIFlagPrivate)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !210, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !225, templateParams: !29, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !224, file: !2, baseType: !227, size: 8, align: 8, flags: DIFlagPrivate)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !181, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !228, templateParams: !230, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !227, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagPrivate)
!230 = !{!231}
!231 = !DITemplateTypeParameter(name: "T", type: !79)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !200, file: !2, baseType: !233, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<slab::Slab<core::task::wake::Waker>>", scope: !181, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !234, templateParams: !310, identifier: "44ae2d7e76a154828fb5258f5853ad5b")
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !233, file: !2, baseType: !236, size: 320, align: 64, flags: DIFlagPrivate)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slab<core::task::wake::Waker>", scope: !237, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !238, templateParams: !265, identifier: "dd6243eb0dbd057884bf543561160890")
!237 = !DINamespace(name: "slab", scope: null)
!238 = !{!239, !308, !309}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !236, file: !2, baseType: !240, size: 192, align: 64, flags: DIFlagPrivate)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<slab::Entry<core::task::wake::Waker>, alloc::alloc::Global>", scope: !241, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !243, templateParams: !305, identifier: "5ff7c5f8968a979d9928d927c65bd4d2")
!241 = !DINamespace(name: "vec", scope: !242)
!242 = !DINamespace(name: "alloc", scope: null)
!243 = !{!244, !307}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !240, file: !2, baseType: !245, size: 128, align: 64, flags: DIFlagPrivate)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<slab::Entry<core::task::wake::Waker>, alloc::alloc::Global>", scope: !246, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !247, templateParams: !305, identifier: "81104772b22649e228909000a8be1d5e")
!246 = !DINamespace(name: "raw_vec", scope: !242)
!247 = !{!248, !298, !302}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !245, file: !2, baseType: !249, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<slab::Entry<core::task::wake::Waker>>", scope: !250, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !251, templateParams: !294, identifier: "6a2bdcd084e27e137a7aa627850bb686")
!250 = !DINamespace(name: "unique", scope: !54)
!251 = !{!252, !296}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !249, file: !2, baseType: !253, size: 64, align: 64, flags: DIFlagPrivate)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<slab::Entry<core::task::wake::Waker>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !254, templateParams: !294, identifier: "b9cdc0a51c9917758e077c261b78be")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !253, file: !2, baseType: !256, size: 64, align: 64, flags: DIFlagPrivate)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const slab::Entry<core::task::wake::Waker>", baseType: !257, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<core::task::wake::Waker>", scope: !237, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !258, templateParams: !29, identifier: "798f8f1583586891fb4e2d23aa1d59bb")
!258 = !{!259}
!259 = !DICompositeType(tag: DW_TAG_variant_part, scope: !257, file: !2, size: 128, align: 64, elements: !260, templateParams: !29, identifier: "990509a0c9a4677544d1aca177546345", discriminator: !293)
!260 = !{!261, !289}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Vacant", scope: !259, file: !2, baseType: !262, size: 128, align: 64, extraData: i128 0)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vacant", scope: !257, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !263, templateParams: !265, identifier: "a3e147a7ba9ecb5b37d23552d735dc08")
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !262, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!265 = !{!266}
!266 = !DITemplateTypeParameter(name: "T", type: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !268, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !270, templateParams: !29, identifier: "ec03eb30528f12f1717f729e65eac0d1")
!268 = !DINamespace(name: "wake", scope: !269)
!269 = !DINamespace(name: "task", scope: !33)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !267, file: !2, baseType: !272, size: 128, align: 64, flags: DIFlagPrivate)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !268, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !273, templateParams: !29, identifier: "212c6d54ee18011b525ba8a27d92578c")
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !2, baseType: !6, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !272, file: !2, baseType: !276, size: 64, align: 64, flags: DIFlagPrivate)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !268, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !278, templateParams: !29, identifier: "f4abbf7758eb3384651691936bf57e5b")
!278 = !{!279, !283, !287, !288}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !277, file: !2, baseType: !280, size: 64, align: 64, flags: DIFlagPrivate)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !DISubroutineType(types: !282)
!282 = !{!272, !6}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !277, file: !2, baseType: !284, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !285, size: 64, align: 64, dwarfAddressSpace: 0)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !6}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !277, file: !2, baseType: !284, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !277, file: !2, baseType: !284, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "Occupied", scope: !259, file: !2, baseType: !290, size: 128, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "Occupied", scope: !257, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !291, templateParams: !265, identifier: "b18f36753ebe3f607e509911a26f0ab5")
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !290, file: !2, baseType: !267, size: 128, align: 64, flags: DIFlagPrivate)
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!294 = !{!295}
!295 = !DITemplateTypeParameter(name: "T", type: !257)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !249, file: !2, baseType: !297, align: 8, offset: 64, flags: DIFlagPrivate)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<slab::Entry<core::task::wake::Waker>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !294, identifier: "619f024d222ff5d041bbf606815a2307")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !245, file: !2, baseType: !299, size: 64, align: 64, flags: DIFlagPrivate)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !246, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !300, templateParams: !29, identifier: "62de598dd28eaf1c7c0f61ca013e23b")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !299, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !245, file: !2, baseType: !303, align: 8, offset: 128, flags: DIFlagPrivate)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !304, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "14de19725ec4b1fd38fae074afd4da08")
!304 = !DINamespace(name: "alloc", scope: !242)
!305 = !{!295, !306}
!306 = !DITemplateTypeParameter(name: "A", type: !303)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !240, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!310 = !{!311}
!311 = !DITemplateTypeParameter(name: "T", type: !236)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !195, file: !2, baseType: !313, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !191, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !314, templateParams: !29, identifier: "d9443e3e6bb8ddba7b9137625ad6dc21")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !313, file: !2, baseType: !316, size: 8, align: 8, flags: DIFlagPrivate)
!316 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!317 = !{!318}
!318 = !DITemplateTypeParameter(name: "T", type: !195)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<async_executor::Sleepers>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<async_executor::Sleepers>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !322, vtableHolder: !327, templateParams: !29, identifier: "5726d0dce12eb63acb7c5888854c59b")
!322 = !{!323, !324, !325, !326}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !321, file: !2, baseType: !6, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !321, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !321, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !321, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<async_executor::Sleepers>>", scope: !191, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !328, templateParams: !397, identifier: "ab8d5d3fe7deed7f12f9b224cbb48f9")
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !327, file: !2, baseType: !330, size: 128, align: 64, flags: DIFlagPrivate)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<async_executor::Sleepers>", scope: !196, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !331, templateParams: !394, identifier: "67570b5bd7d66cf49afe1ba0d938aec7")
!331 = !{!332, !396}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !330, file: !2, baseType: !333, size: 64, align: 64, flags: DIFlagPrivate)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<async_executor::Sleepers>", baseType: !334, size: 64, align: 64, dwarfAddressSpace: 0)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<async_executor::Sleepers>", scope: !196, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !335, templateParams: !394, identifier: "c4e0ab2cefa83cea21c09f53230c00b")
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !334, file: !2, baseType: !203, size: 32, align: 32, flags: DIFlagPrivate)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !334, file: !2, baseType: !221, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !2, baseType: !339, size: 448, align: 64, offset: 64, flags: DIFlagPrivate)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<async_executor::Sleepers>", scope: !181, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !340, templateParams: !394, identifier: "3bc50570a552fa2abc30d26291b50027")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !339, file: !2, baseType: !342, size: 448, align: 64, flags: DIFlagPrivate)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sleepers", scope: !343, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !344, templateParams: !29, identifier: "4f68b847a34be37ae6e7bdd484e8904")
!343 = !DINamespace(name: "async_executor", scope: null)
!344 = !{!345, !346, !372}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !342, file: !2, baseType: !9, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "wakers", scope: !342, file: !2, baseType: !347, size: 192, align: 64, flags: DIFlagPrivate)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(usize, core::task::wake::Waker), alloc::alloc::Global>", scope: !241, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !348, templateParams: !370, identifier: "973ebc474f5208551798e4a6e77068ed")
!348 = !{!349, !371}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !347, file: !2, baseType: !350, size: 128, align: 64, flags: DIFlagPrivate)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(usize, core::task::wake::Waker), alloc::alloc::Global>", scope: !246, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !351, templateParams: !370, identifier: "e400bdbce2a0591b7a50839858efa8cb")
!351 = !{!352, !368, !369}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !350, file: !2, baseType: !353, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<(usize, core::task::wake::Waker)>", scope: !250, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !354, templateParams: !364, identifier: "d4930253701ab0da1f4ffe6baafff6")
!354 = !{!355, !366}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !353, file: !2, baseType: !356, size: 64, align: 64, flags: DIFlagPrivate)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<(usize, core::task::wake::Waker)>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !357, templateParams: !364, identifier: "6d4b3ba2f32f0553a5e7ad5357fa33a6")
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !356, file: !2, baseType: !359, size: 64, align: 64, flags: DIFlagPrivate)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const (usize, core::task::wake::Waker)", baseType: !360, size: 64, align: 64, dwarfAddressSpace: 0)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::task::wake::Waker)", file: !2, size: 192, align: 64, elements: !361, templateParams: !29, identifier: "f3b6f3d8155e842f9da387ab5efd515c")
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !360, file: !2, baseType: !9, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !360, file: !2, baseType: !267, size: 128, align: 64, offset: 64)
!364 = !{!365}
!365 = !DITemplateTypeParameter(name: "T", type: !360)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !353, file: !2, baseType: !367, align: 8, offset: 64, flags: DIFlagPrivate)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(usize, core::task::wake::Waker)>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !364, identifier: "a8fa0133835d5b196c50b1ca469dd98b")
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !350, file: !2, baseType: !299, size: 64, align: 64, flags: DIFlagPrivate)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !350, file: !2, baseType: !303, align: 8, offset: 128, flags: DIFlagPrivate)
!370 = !{!365, !306}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !347, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "free_ids", scope: !342, file: !2, baseType: !373, size: 192, align: 64, offset: 192, flags: DIFlagPrivate)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<usize, alloc::alloc::Global>", scope: !241, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !374, templateParams: !392, identifier: "317e04c7b834522bae370411544ae355")
!374 = !{!375, !393}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !373, file: !2, baseType: !376, size: 128, align: 64, flags: DIFlagPrivate)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<usize, alloc::alloc::Global>", scope: !246, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !377, templateParams: !392, identifier: "d9862a9fcea4e0c69069a173ce5ed781")
!377 = !{!378, !390, !391}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !376, file: !2, baseType: !379, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<usize>", scope: !250, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !380, templateParams: !386, identifier: "8b6520bb83edd0fd9eba7ed215bba0c4")
!380 = !{!381, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !379, file: !2, baseType: !382, size: 64, align: 64, flags: DIFlagPrivate)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<usize>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !383, templateParams: !386, identifier: "57ff1b8e0db2cb5642d86b2cc068d713")
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !382, file: !2, baseType: !385, size: 64, align: 64, flags: DIFlagPrivate)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!386 = !{!387}
!387 = !DITemplateTypeParameter(name: "T", type: !9)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !379, file: !2, baseType: !389, align: 8, offset: 64, flags: DIFlagPrivate)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<usize>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !386, identifier: "2f87eb26399d59eac7439bd1a0a6d32")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !376, file: !2, baseType: !299, size: 64, align: 64, flags: DIFlagPrivate)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !376, file: !2, baseType: !303, align: 8, offset: 128, flags: DIFlagPrivate)
!392 = !{!387, !306}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !373, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!394 = !{!395}
!395 = !DITemplateTypeParameter(name: "T", type: !342)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !330, file: !2, baseType: !313, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!397 = !{!398}
!398 = !DITemplateTypeParameter(name: "T", type: !330)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::rwlock::RwLockWriteGuard<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::rwlock::RwLockWriteGuard<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !402, vtableHolder: !407, templateParams: !29, identifier: "376c1177b196a78fce86ec1bf768b965")
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !401, file: !2, baseType: !6, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !401, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !401, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::rwlock::RwLockWriteGuard<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>>", scope: !191, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !408, templateParams: !592, identifier: "243cf79202fce8bd78cfbef493c2da9")
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !407, file: !2, baseType: !410, size: 128, align: 64, flags: DIFlagPrivate)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLockWriteGuard<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>", scope: !411, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !412, templateParams: !589, identifier: "f552d57c322624d36b0b60a4812963f8")
!411 = !DINamespace(name: "rwlock", scope: !192)
!412 = !{!413, !591}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !410, file: !2, baseType: !414, size: 64, align: 64, flags: DIFlagPrivate)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::rwlock::RwLock<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>", baseType: !415, size: 64, align: 64, dwarfAddressSpace: 0)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>", scope: !411, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !416, templateParams: !589, identifier: "576ce44ed5e8c650dd0f4ab5dab9ea0d")
!416 = !{!417, !424, !425}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !415, file: !2, baseType: !418, size: 64, align: 32, flags: DIFlagPrivate)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "RwLock", scope: !419, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !421, templateParams: !29, identifier: "1934155dc4995f05e979c9c13bc7bf53")
!419 = !DINamespace(name: "futex", scope: !420)
!420 = !DINamespace(name: "rwlock", scope: !206)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !418, file: !2, baseType: !209, size: 32, align: 32, flags: DIFlagPrivate)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "writer_notify", scope: !418, file: !2, baseType: !209, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !415, file: !2, baseType: !221, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !2, baseType: !426, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>>", scope: !181, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !427, templateParams: !589, identifier: "5a35b7238d4566d267672ce343d06fae")
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !426, file: !2, baseType: !429, size: 192, align: 64, flags: DIFlagPrivate)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>", scope: !241, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !430, templateParams: !587, identifier: "5c6758748ea6fc8596971be7e6823fb")
!430 = !{!431, !588}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !429, file: !2, baseType: !432, size: 128, align: 64, flags: DIFlagPrivate)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>, alloc::alloc::Global>", scope: !246, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !433, templateParams: !587, identifier: "90163b8abdbb56ff9a8ce4c8120d6c63")
!433 = !{!434, !585, !586}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !432, file: !2, baseType: !435, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>>", scope: !250, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !436, templateParams: !581, identifier: "a5b4db599d555c444a4e268f35bd34c7")
!436 = !{!437, !583}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !435, file: !2, baseType: !438, size: 64, align: 64, flags: DIFlagPrivate)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !439, templateParams: !581, identifier: "77d36515eb3d80c6c19b30af1e2fb8a1")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !438, file: !2, baseType: !441, size: 64, align: 64, flags: DIFlagPrivate)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>", baseType: !442, size: 64, align: 64, dwarfAddressSpace: 0)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>", scope: !443, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !444, templateParams: !580, identifier: "92258e7dbdca77ec540423d5e1a312bf")
!443 = !DINamespace(name: "sync", scope: !242)
!444 = !{!445, !577, !579}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !442, file: !2, baseType: !446, size: 64, align: 64, flags: DIFlagPrivate)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !447, templateParams: !575, identifier: "bfe1930a1868305ce1b0ce61250b410b")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !446, file: !2, baseType: !449, size: 64, align: 64, flags: DIFlagPrivate)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>>", baseType: !450, size: 64, align: 64, dwarfAddressSpace: 0)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>>", scope: !443, file: !2, size: 5120, align: 1024, flags: DIFlagPrivate, elements: !451, templateParams: !573, identifier: "624fcfdc41f7e5e592119eb26ab833f0")
!451 = !{!452, !459, !460}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !450, file: !2, baseType: !453, size: 64, align: 64, flags: DIFlagPrivate)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !210, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !454, templateParams: !29, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !453, file: !2, baseType: !456, size: 64, align: 64, flags: DIFlagPrivate)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !181, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !457, templateParams: !386, identifier: "739795389d327d6873469e3d89b8c60e")
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !456, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !450, file: !2, baseType: !453, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !2, baseType: !461, size: 4096, align: 1024, offset: 1024, flags: DIFlagPrivate)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConcurrentQueue<async_task::runnable::Runnable<()>>", scope: !462, file: !2, size: 4096, align: 1024, flags: DIFlagPublic, elements: !463, templateParams: !500, identifier: "4b3b6d252dec678acbd901a0e4ff49dd")
!462 = !DINamespace(name: "concurrent_queue", scope: null)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !461, file: !2, baseType: !465, size: 4096, align: 1024, flags: DIFlagPrivate)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<async_task::runnable::Runnable<()>>", scope: !462, file: !2, size: 4096, align: 1024, flags: DIFlagPrivate, elements: !466, templateParams: !29, identifier: "6caa605ae5b8439837896d47e7f0845f")
!466 = !{!467}
!467 = !DICompositeType(tag: DW_TAG_variant_part, scope: !465, file: !2, size: 4096, align: 1024, elements: !468, templateParams: !29, identifier: "b7a6c340e4982d6db3617dd3a3f3f4eb", discriminator: !572)
!468 = !{!469, !504, !532}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Single", scope: !467, file: !2, baseType: !470, size: 4096, align: 1024, extraData: i128 0)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Single", scope: !465, file: !2, size: 4096, align: 1024, flags: DIFlagPrivate, elements: !471, templateParams: !500, identifier: "62c41516057e1c8ab307512c080ff5ec")
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !470, file: !2, baseType: !473, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Single<async_task::runnable::Runnable<()>>", scope: !474, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !475, templateParams: !500, identifier: "9e797601665f2312d891912b672b40e1")
!474 = !DINamespace(name: "single", scope: !462)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !473, file: !2, baseType: !453, size: 64, align: 64, flags: DIFlagPrivate)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !473, file: !2, baseType: !478, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::mem::maybe_uninit::MaybeUninit<async_task::runnable::Runnable<()>>>", scope: !181, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !479, templateParams: !502, identifier: "c9e1aced10c102ec7ac7db75ba80717b")
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !478, file: !2, baseType: !481, size: 64, align: 64, flags: DIFlagPrivate)
!481 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<async_task::runnable::Runnable<()>>", scope: !482, file: !2, size: 64, align: 64, elements: !484, templateParams: !500, identifier: "5b8546f40ca50116b3943b95c85eff01")
!482 = !DINamespace(name: "maybe_uninit", scope: !483)
!483 = !DINamespace(name: "mem", scope: !33)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !481, file: !2, baseType: !7, align: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !481, file: !2, baseType: !487, size: 64, align: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<async_task::runnable::Runnable<()>>", scope: !488, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !489, templateParams: !500, identifier: "e9fc25561c8278294a389901b20fa6cd")
!488 = !DINamespace(name: "manually_drop", scope: !483)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !487, file: !2, baseType: !491, size: 64, align: 64, flags: DIFlagPrivate)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Runnable<()>", scope: !492, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !494, templateParams: !498, identifier: "373ef637f7b5f1b828418b1e44bf5375")
!492 = !DINamespace(name: "runnable", scope: !493)
!493 = !DINamespace(name: "async_task", scope: null)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !491, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagProtected)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !491, file: !2, baseType: !497, align: 8, offset: 64, flags: DIFlagProtected)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<()>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !57, identifier: "c0ac5dd9794ce0c9804cd88f3d5e02b")
!498 = !{!499}
!499 = !DITemplateTypeParameter(name: "M", type: !7)
!500 = !{!501}
!501 = !DITemplateTypeParameter(name: "T", type: !491)
!502 = !{!503}
!503 = !DITemplateTypeParameter(name: "T", type: !481)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Bounded", scope: !467, file: !2, baseType: !505, size: 4096, align: 1024, extraData: i128 1)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounded", scope: !465, file: !2, size: 4096, align: 1024, flags: DIFlagPrivate, elements: !506, templateParams: !500, identifier: "2704894d9456a18996bbaa52120cc46c")
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !505, file: !2, baseType: !508, size: 3072, align: 1024, offset: 1024, flags: DIFlagPrivate)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bounded<async_task::runnable::Runnable<()>>", scope: !509, file: !2, size: 3072, align: 1024, flags: DIFlagPublic, elements: !510, templateParams: !500, identifier: "427b16a0ec5bfd8ef874cfe71b1d2f59")
!509 = !DINamespace(name: "bounded", scope: !462)
!510 = !{!511, !519, !520, !530, !531}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !508, file: !2, baseType: !512, size: 1024, align: 1024, flags: DIFlagPrivate)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "CachePadded<core::sync::atomic::AtomicUsize>", scope: !513, file: !2, size: 1024, align: 1024, flags: DIFlagPublic, elements: !515, templateParams: !517, identifier: "e115865a5677904394d215970d3687")
!513 = !DINamespace(name: "cache_padded", scope: !514)
!514 = !DINamespace(name: "crossbeam_utils", scope: null)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !512, file: !2, baseType: !453, size: 64, align: 64, flags: DIFlagPrivate)
!517 = !{!518}
!518 = !DITemplateTypeParameter(name: "T", type: !453)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !508, file: !2, baseType: !512, size: 1024, align: 1024, offset: 1024, flags: DIFlagPrivate)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !508, file: !2, baseType: !521, size: 128, align: 64, offset: 2176, flags: DIFlagPrivate)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[concurrent_queue::bounded::Slot<async_task::runnable::Runnable<()>>], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !522, templateParams: !29, identifier: "b034c8e2bd6c6dd0750e2ec05d7b5f75")
!522 = !{!523, !529}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !521, file: !2, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64, dwarfAddressSpace: 0)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slot<async_task::runnable::Runnable<()>>", scope: !509, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !526, templateParams: !500, identifier: "f9124e9c80801ae960c85adc52d7fca1")
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "stamp", scope: !525, file: !2, baseType: !453, size: 64, align: 64, flags: DIFlagPrivate)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !525, file: !2, baseType: !478, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !521, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "one_lap", scope: !508, file: !2, baseType: !9, size: 64, align: 64, offset: 2048, flags: DIFlagPrivate)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mark_bit", scope: !508, file: !2, baseType: !9, size: 64, align: 64, offset: 2112, flags: DIFlagPrivate)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Unbounded", scope: !467, file: !2, baseType: !533, size: 4096, align: 1024, extraData: i128 2)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unbounded", scope: !465, file: !2, size: 4096, align: 1024, flags: DIFlagPrivate, elements: !534, templateParams: !500, identifier: "645a73fef5b53793633b785da30708b8")
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !533, file: !2, baseType: !536, size: 2048, align: 1024, offset: 1024, flags: DIFlagPrivate)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unbounded<async_task::runnable::Runnable<()>>", scope: !537, file: !2, size: 2048, align: 1024, flags: DIFlagPublic, elements: !538, templateParams: !500, identifier: "434460071c924b02b6199a5ec00cb302")
!537 = !DINamespace(name: "unbounded", scope: !462)
!538 = !{!539, !571}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !536, file: !2, baseType: !540, size: 1024, align: 1024, flags: DIFlagPrivate)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "CachePadded<concurrent_queue::unbounded::Position<async_task::runnable::Runnable<()>>>", scope: !513, file: !2, size: 1024, align: 1024, flags: DIFlagPublic, elements: !541, templateParams: !569, identifier: "3c7d658694f1786523ebb02210a85fd")
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !540, file: !2, baseType: !543, size: 128, align: 64, flags: DIFlagPrivate)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Position<async_task::runnable::Runnable<()>>", scope: !537, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !544, templateParams: !500, identifier: "9553a1bd07a1a50ad62d22bd80706819")
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !543, file: !2, baseType: !453, size: 64, align: 64, flags: DIFlagPrivate)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !543, file: !2, baseType: !547, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<concurrent_queue::unbounded::Block<async_task::runnable::Runnable<()>>>", scope: !210, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !548, templateParams: !567, identifier: "89c77c03419660d7fd8116bb7d74937c")
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !547, file: !2, baseType: !550, size: 64, align: 64, flags: DIFlagPrivate)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut concurrent_queue::unbounded::Block<async_task::runnable::Runnable<()>>>", scope: !181, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !551, templateParams: !565, identifier: "7712001b6e831b46b39437967ff04915")
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !550, file: !2, baseType: !553, size: 64, align: 64, flags: DIFlagPrivate)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut concurrent_queue::unbounded::Block<async_task::runnable::Runnable<()>>", baseType: !554, size: 64, align: 64, dwarfAddressSpace: 0)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Block<async_task::runnable::Runnable<()>>", scope: !537, file: !2, size: 4032, align: 64, flags: DIFlagPrivate, elements: !555, templateParams: !500, identifier: "6dbe2f53fe66a58ee805d29d72fd1d4e")
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !2, baseType: !547, size: 64, align: 64, offset: 3968, flags: DIFlagPrivate)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !554, file: !2, baseType: !558, size: 3968, align: 64, flags: DIFlagPrivate)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 3968, align: 64, elements: !563)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slot<async_task::runnable::Runnable<()>>", scope: !537, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !560, templateParams: !500, identifier: "a5705998a0f90a23f46c4225843db541")
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !559, file: !2, baseType: !478, size: 64, align: 64, flags: DIFlagPrivate)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !559, file: !2, baseType: !453, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!563 = !{!564}
!564 = !DISubrange(count: 31, lowerBound: 0)
!565 = !{!566}
!566 = !DITemplateTypeParameter(name: "T", type: !553)
!567 = !{!568}
!568 = !DITemplateTypeParameter(name: "T", type: !554)
!569 = !{!570}
!570 = !DITemplateTypeParameter(name: "T", type: !543)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !536, file: !2, baseType: !540, size: 1024, align: 1024, offset: 1024, flags: DIFlagPrivate)
!572 = !DIDerivedType(tag: DW_TAG_member, scope: !465, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!573 = !{!574}
!574 = !DITemplateTypeParameter(name: "T", type: !461)
!575 = !{!576}
!576 = !DITemplateTypeParameter(name: "T", type: !450)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !442, file: !2, baseType: !578, align: 8, offset: 64, flags: DIFlagPrivate)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !575, identifier: "8fd903a30e77026a236a4120426596fa")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !442, file: !2, baseType: !303, align: 8, offset: 64, flags: DIFlagPrivate)
!580 = !{!574, !306}
!581 = !{!582}
!582 = !DITemplateTypeParameter(name: "T", type: !442)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !435, file: !2, baseType: !584, align: 8, offset: 64, flags: DIFlagPrivate)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::Arc<concurrent_queue::ConcurrentQueue<async_task::runnable::Runnable<()>>, alloc::alloc::Global>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !581, identifier: "5cbd2b5db2c390bb84587c936c57f077")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !432, file: !2, baseType: !299, size: 64, align: 64, flags: DIFlagPrivate)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !432, file: !2, baseType: !303, align: 8, offset: 128, flags: DIFlagPrivate)
!587 = !{!582, !306}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !429, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!589 = !{!590}
!590 = !DITemplateTypeParameter(name: "T", type: !429)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !410, file: !2, baseType: !313, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!592 = !{!593}
!593 = !DITemplateTypeParameter(name: "T", type: !410)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "<async_executor::debug_executor::Uninitialized as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_executor::debug_executor::Uninitialized as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !597, vtableHolder: !602, templateParams: !29, identifier: "ce94514b90b80200ddf7958663cb5ab2")
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !596, file: !2, baseType: !6, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !596, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !596, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Uninitialized", scope: !603, file: !2, align: 8, flags: DIFlagProtected, elements: !29, identifier: "9382d9959a34b9053b0c74e893110f52")
!603 = !DINamespace(name: "debug_executor", scope: !343)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "<async_executor::debug_executor::ActiveTasks as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_executor::debug_executor::ActiveTasks as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !607, vtableHolder: !612, templateParams: !29, identifier: "145fe168d0249b6eeaf9b1cf437cc946")
!607 = !{!608, !609, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !606, file: !2, baseType: !6, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !606, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !606, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActiveTasks", scope: !603, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !613, templateParams: !29, identifier: "b489ed621646ec67564d9bb10c297718")
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !612, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagProtected)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "<async_executor::debug_executor::LocalRunners as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_executor::debug_executor::LocalRunners as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !618, vtableHolder: !623, templateParams: !29, identifier: "94516a718b4fea6a47bc012880902512")
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !617, file: !2, baseType: !6, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !617, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !617, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "LocalRunners", scope: !603, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !624, templateParams: !29, identifier: "f2b1464b434dcf9f50b004b02b2ddc36")
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !623, file: !2, baseType: !414, size: 64, align: 64, flags: DIFlagProtected)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "<async_executor::debug_executor::SleepCount as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_executor::debug_executor::SleepCount as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !629, vtableHolder: !634, templateParams: !29, identifier: "69305b6426e00a6f7e69d4d79ea0f32")
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !628, file: !2, baseType: !6, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !628, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !628, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !628, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "SleepCount", scope: !603, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !635, templateParams: !29, identifier: "9220c93a6d9f25251a3b2bb5817b8d2f")
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !634, file: !2, baseType: !333, size: 64, align: 64, flags: DIFlagProtected)
!637 = !{i32 8, !"PIC Level", i32 2}
!638 = !{i32 2, !"RtLibUseGOT", i32 1}
!639 = !{i32 2, !"Dwarf Version", i32 4}
!640 = !{i32 2, !"Debug Info Version", i32 3}
!641 = !{!"rustc version 1.80.0-dev"}
!642 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !643, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !644, globals: !755, splitDebugInlining: false, nameTableKind: None)
!643 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-executor-1.8.0/src/lib.rs/@/async_executor.1331364fa120f92d-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-executor-1.8.0")
!644 = !{!645, !653, !660, !667, !734, !741, !78, !745, !751}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !646, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !648)
!646 = !DINamespace(name: "rt", scope: !647)
!647 = !DINamespace(name: "fmt", scope: !33)
!648 = !{!649, !650, !651, !652}
!649 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!650 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!651 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!652 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !210, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !654)
!654 = !{!655, !656, !657, !658, !659}
!655 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!656 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!657 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!658 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!659 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "State", scope: !661, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagEnumClass, elements: !663)
!661 = !DINamespace(name: "once_cell", scope: !662)
!662 = !DINamespace(name: "async_lock", scope: null)
!663 = !{!664, !665, !666}
!664 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!665 = !DIEnumerator(name: "Initializing", value: 1, isUnsigned: true)
!666 = !DIEnumerator(name: "Initialized", value: 2, isUnsigned: true)
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !668, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagEnumClass, elements: !669)
!668 = !DINamespace(name: "alignment", scope: !54)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!670 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!671 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!672 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!673 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!674 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!675 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!676 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!677 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!678 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!679 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!680 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!681 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!682 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!683 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!684 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!685 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!686 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!687 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!688 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!689 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!690 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!691 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!692 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!693 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!694 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!695 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!696 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!697 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!698 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!699 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!700 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!701 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!702 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!703 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!704 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!705 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!706 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!707 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!708 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!709 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!710 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!711 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!712 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!713 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!714 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!715 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!716 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!717 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!718 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!719 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!720 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!721 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!722 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!723 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!724 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!725 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!726 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!727 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!728 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!729 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!730 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!731 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!732 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!733 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !735, file: !2, baseType: !736, size: 8, align: 8, flags: DIFlagEnumClass, elements: !737)
!735 = !DINamespace(name: "cmp", scope: !33)
!736 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!737 = !{!738, !739, !740}
!738 = !DIEnumerator(name: "Less", value: -1)
!739 = !DIEnumerator(name: "Equal", value: 0)
!740 = !DIEnumerator(name: "Greater", value: 1)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PopError", scope: !462, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !742)
!742 = !{!743, !744}
!743 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!744 = !DIEnumerator(name: "Closed", value: 1, isUnsigned: true)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !746, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !747)
!746 = !DINamespace(name: "panicking", scope: !33)
!747 = !{!748, !749, !750}
!748 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!749 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!750 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!751 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !246, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !752)
!752 = !{!753, !754}
!753 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!754 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!755 = !{!0, !164, !172, !182, !319, !399, !594, !604, !615, !626}
!756 = distinct !DISubprogram(name: "wait_with_parker<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN14event_listener21Listener$LT$T$C$B$GT$16wait_with_parker17h0f610e51e3fbf7fcE", scope: !758, file: !757, line: 1081, type: !962, scopeLine: 1081, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !642, templateParams: !960, declaration: !1037, retainedNodes: !1038)
!757 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/event-listener-4.0.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "7de12cd7a3ced25ebf9217e9754df9fb")
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", scope: !759, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !760, templateParams: !960, identifier: "83b7f692ef0485c0854c472543f9c29f")
!759 = !DINamespace(name: "event_listener", scope: null)
!760 = !{!761, !938}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !758, file: !2, baseType: !762, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", scope: !763, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !764, templateParams: !29, identifier: "dc571b9fd9d33de1cbef046fa6bbca53")
!763 = !DINamespace(name: "option", scope: !33)
!764 = !{!765}
!765 = !DICompositeType(tag: DW_TAG_variant_part, scope: !762, file: !2, size: 64, align: 64, elements: !766, templateParams: !29, identifier: "1c75bcd4279d08f6d7f0151ef500b652", discriminator: !937)
!766 = !{!767, !933}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !765, file: !2, baseType: !768, size: 64, align: 64, extraData: i128 0)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !762, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !769, identifier: "f244c10ebbc9ec40250443adbd767e88")
!769 = !{!770}
!770 = !DITemplateTypeParameter(name: "T", type: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<event_listener::Inner<()>, alloc::alloc::Global>", scope: !443, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !772, templateParams: !932, identifier: "1228a95c6b03e1b2fb427e40de735dcb")
!772 = !{!773, !929, !931}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !771, file: !2, baseType: !774, size: 64, align: 64, flags: DIFlagPrivate)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<event_listener::Inner<()>>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !775, templateParams: !927, identifier: "c52bdbd8a3fbb388321f906d81354227")
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !774, file: !2, baseType: !777, size: 64, align: 64, flags: DIFlagPrivate)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<event_listener::Inner<()>>", baseType: !778, size: 64, align: 64, dwarfAddressSpace: 0)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<event_listener::Inner<()>>", scope: !443, file: !2, size: 576, align: 64, flags: DIFlagPrivate, elements: !779, templateParams: !925, identifier: "4a6de4631d18a02df0546014d6ecf6ed")
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !778, file: !2, baseType: !453, size: 64, align: 64, flags: DIFlagPrivate)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !778, file: !2, baseType: !453, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !778, file: !2, baseType: !783, size: 448, align: 64, offset: 128, flags: DIFlagPrivate)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<()>", scope: !759, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !784, templateParams: !57, identifier: "9236e854376b0d4cd170528eda8b9048")
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "notified", scope: !783, file: !2, baseType: !453, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !783, file: !2, baseType: !787, size: 384, align: 64, flags: DIFlagPrivate)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "List<()>", scope: !788, file: !2, size: 384, align: 64, flags: DIFlagProtected, elements: !789, templateParams: !57, identifier: "831cf0078a2b22a4269095f5421b530e")
!788 = !DINamespace(name: "sys", scope: !759)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !2, baseType: !791, size: 384, align: 64, flags: DIFlagPrivate)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<event_listener::sys::Inner<()>>", scope: !196, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !792, templateParams: !923, identifier: "7dd8ddc59924866b415594ac3756958")
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !791, file: !2, baseType: !203, size: 32, align: 32, flags: DIFlagPrivate)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !791, file: !2, baseType: !221, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !2, baseType: !796, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::sys::Inner<()>>", scope: !181, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !797, templateParams: !923, identifier: "5ca6c82755304f17c40dfad2c9b3ae68")
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !796, file: !2, baseType: !799, size: 320, align: 64, flags: DIFlagPrivate)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<()>", scope: !788, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !800, templateParams: !57, identifier: "1f53821c64e1dc705c119a88ffdf14ef")
!800 = !{!801, !919, !920, !921, !922}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !799, file: !2, baseType: !802, size: 64, align: 64, flags: DIFlagPrivate)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>", scope: !763, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !803, templateParams: !29, identifier: "a651642ae60dbe27c9256a2e2987ea45")
!803 = !{!804}
!804 = !DICompositeType(tag: DW_TAG_variant_part, scope: !802, file: !2, size: 64, align: 64, elements: !805, templateParams: !29, identifier: "6c43d02f03a7616245ba6c23a6eac020", discriminator: !918)
!805 = !{!806, !914}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !804, file: !2, baseType: !807, size: 64, align: 64, extraData: i128 0)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !802, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !808, identifier: "2f4f6e313ad10698e41c9a467abba3e")
!808 = !{!809}
!809 = !DITemplateTypeParameter(name: "T", type: !810)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<event_listener::sys::Link<()>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !811, templateParams: !912, identifier: "ca7f93308dd70cba20b0c95ea39d96c7")
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !810, file: !2, baseType: !813, size: 64, align: 64, flags: DIFlagPrivate)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const event_listener::sys::Link<()>", baseType: !814, size: 64, align: 64, dwarfAddressSpace: 0)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "Link<()>", scope: !788, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !815, templateParams: !57, identifier: "d96a7b30b8aa87a186213cac4bbb5535")
!815 = !{!816, !902, !911}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !814, file: !2, baseType: !817, size: 192, align: 64, flags: DIFlagPrivate)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<event_listener::State<()>>", scope: !181, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !818, templateParams: !900, identifier: "ce455b90cf8a3226e6d085b7a348c813")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !817, file: !2, baseType: !820, size: 192, align: 64, flags: DIFlagPrivate)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::State<()>>", scope: !181, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !821, templateParams: !900, identifier: "ba0d6097fed2e29aa005287c811892a0")
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !820, file: !2, baseType: !823, size: 192, align: 64, flags: DIFlagPrivate)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "State<()>", scope: !759, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !824, templateParams: !29, identifier: "63dfe96b96a361658919f1094c803e1d")
!824 = !{!825}
!825 = !DICompositeType(tag: DW_TAG_variant_part, scope: !823, file: !2, size: 192, align: 64, elements: !826, templateParams: !29, identifier: "ddfa394a9dea3c7477624267fd559989", discriminator: !899)
!826 = !{!827, !829, !834, !897}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Created", scope: !825, file: !2, baseType: !828, size: 192, align: 64, extraData: i128 0)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "Created", scope: !823, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, templateParams: !57, identifier: "eebe2bf2e380cf59f003f13745fc4b61")
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Notified", scope: !825, file: !2, baseType: !830, size: 192, align: 64, extraData: i128 1)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notified", scope: !823, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !831, templateParams: !57, identifier: "ec8a14c0854d13a38e922f5838ae8e9c")
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !830, file: !2, baseType: !316, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !830, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPrivate)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Task", scope: !825, file: !2, baseType: !835, size: 192, align: 64, extraData: i128 2)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task", scope: !823, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !836, templateParams: !57, identifier: "62565a9d62398f017cec03b6f6071d12")
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !835, file: !2, baseType: !838, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task", scope: !759, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !839, templateParams: !29, identifier: "bab95dbe1505b2b7273f5e8e2a31eeaf")
!839 = !{!840}
!840 = !DICompositeType(tag: DW_TAG_variant_part, scope: !838, file: !2, size: 128, align: 64, elements: !841, templateParams: !29, identifier: "2c48b1223c2eb30e6abbd03b03356d27", discriminator: !896)
!841 = !{!842, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Waker", scope: !840, file: !2, baseType: !843, size: 128, align: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !838, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !844, templateParams: !29, identifier: "f984acde1be4429b167a7d96ebbb54fc")
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !843, file: !2, baseType: !267, size: 128, align: 64, flags: DIFlagPrivate)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "Unparker", scope: !840, file: !2, baseType: !847, size: 128, align: 64, extraData: i128 0)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !838, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !848, templateParams: !29, identifier: "26db9ed251879ce18293261e1d518cb7")
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !847, file: !2, baseType: !850, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !851, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !852, templateParams: !29, identifier: "5192ed2efe1020b6ccd5e36b4da17d5b")
!851 = !DINamespace(name: "parking", scope: null)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !850, file: !2, baseType: !854, size: 64, align: 64, flags: DIFlagPrivate)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<parking::Inner, alloc::alloc::Global>", scope: !443, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !855, templateParams: !895, identifier: "f2d46d41b9758d25450ea7070e7e54d0")
!855 = !{!856, !892, !894}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !854, file: !2, baseType: !857, size: 64, align: 64, flags: DIFlagPrivate)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<parking::Inner>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !858, templateParams: !890, identifier: "825cebb2feb53bbe75ce00c352a7557b")
!858 = !{!859}
