; ModuleID = 'async_lock.3f1c597594037a1d-cgu.0'
source_filename = "async_lock.3f1c597594037a1d-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::sys::thread_local::fast_local::lazy::Storage<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>" = type { %"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>>" }
%"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>>" = type { %"std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>" }
%"std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<core::option::Option<(parking::Parker, event_listener::Task)>>, ()>" = type { i64, [4 x i64] }
%"core::sync::atomic::AtomicUsize" = type { i64 }

@alloc_1ccfc410ce4ba7704b8709f0d6e60294 = private unnamed_addr constant <{ [51 x i8] }> <{ [51 x i8] c"fatal runtime error: thread local panicked on drop\0A" }>, align 1
@alloc_f7c18d5ab6a04e64e435b4d6f64423e3 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_1ccfc410ce4ba7704b8709f0d6e60294, [8 x i8] c"3\00\00\00\00\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !29, identifier: "3b9dc1cd24e5f6261916f3a71a8e93ed")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::pal::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !19, templateParams: !162, identifier: "5cc60cf3bc5ca3351bc45c96fb2576d0")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64, flags: DIFlagProtected)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::pal::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !29, identifier: "93c379795faa0383c896fabe3f393c")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "pal", scope: !26)
!26 = !DINamespace(name: "sys", scope: !18)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !31, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !32, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "f6fab78402c7921c81b48f94ff59f12a")
!32 = !DINamespace(name: "result", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !31, file: !2, size: 64, align: 64, elements: !36, templateParams: !29, identifier: "f20382f78447208541d43a2eb7c7b177", discriminator: !160)
!36 = !{!37, !156}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !35, file: !2, baseType: !38, size: 64, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !39, templateParams: !41, identifier: "7fff08edb161cdb6f65adbe333abb587")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!41 = !{!42, !43}
!42 = !DITemplateTypeParameter(name: "T", type: !7)
!43 = !DITemplateTypeParameter(name: "E", type: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !29, identifier: "9481a9f9dd3a514fccbd1ee45fe835c0")
!45 = !DINamespace(name: "error", scope: !17)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !44, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !50, templateParams: !29, identifier: "d19e764dc7d400364cac938e600e6e8e")
!49 = !DINamespace(name: "repr_bitpacked", scope: !45)
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !48, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagPrivate)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !57, identifier: "219b4814660fc803ec7ad9770695a")
!53 = !DINamespace(name: "non_null", scope: !54)
!54 = !DINamespace(name: "ptr", scope: !33)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !{!42}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !48, file: !2, baseType: !59, align: 8, offset: 64, flags: DIFlagPrivate)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !61, identifier: "b3a9535088463228dd721e3df15a74b4")
!60 = !DINamespace(name: "marker", scope: !33)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "T", type: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !64, templateParams: !29, identifier: "2d842b368858db53e5e95cb68f18ba4d")
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 128, align: 64, elements: !66, templateParams: !29, identifier: "7b170337c204a193ef1904d1caedcc36", discriminator: !155)
!66 = !{!67, !133, !137, !151}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !65, file: !2, baseType: !68, size: 128, align: 64, extraData: i128 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !69, templateParams: !72, identifier: "ec7ef559ca1c1873dcb949d9353e83c4")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !71, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!71 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "C", type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !76, templateParams: !29, identifier: "4a83a1c02e32f7677e925d15cbf9f223")
!76 = !{!77, !122}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !75, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !45, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !80)
!79 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!81 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !75, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPrivate)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !124, templateParams: !29, identifier: "fc4c978384b58c14d0c3b28c9444e0a6")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !2, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !29, identifier: "af492d0fde630cae993a48fd15ada2c5")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !123, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 10, lowerBound: 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !65, file: !2, baseType: !134, size: 128, align: 64, extraData: i128 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !135, templateParams: !72, identifier: "c722108768e442de944796846599cf6a")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !78, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !65, file: !2, baseType: !138, size: 128, align: 64, extraData: i128 2)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !139, templateParams: !72, identifier: "a889002bec16644f89535583317530e7")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !143, templateParams: !29, identifier: "1cc23320a6f881d629e59649fa6dee8b")
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !142, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !142, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !147, templateParams: !29, identifier: "9277eecd40495f85161460476aacc992")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !2, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !65, file: !2, baseType: !152, size: 128, align: 64, extraData: i128 3)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !153, templateParams: !72, identifier: "6be90b54a330d2fbea2d9f76e0bfb292")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !152, file: !2, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !35, file: !2, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !158, templateParams: !41, identifier: "a184e6321da6a5ec587e5ea90c206f8c")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !31, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!161 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !22)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "<core::cell::BorrowMutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::cell::BorrowMutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !167, vtableHolder: !172, templateParams: !29, identifier: "66a15e4ba0a44a3456f09c555c1b8eef")
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !166, file: !2, baseType: !6, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowMutError", scope: !173, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "8170d1cee2b16df69b0fe1e464b7845")
!173 = !DINamespace(name: "cell", scope: !33)
!174 = !{i32 8, !"PIC Level", i32 2}
!175 = !{i32 2, !"RtLibUseGOT", i32 1}
!176 = !{i32 2, !"Dwarf Version", i32 4}
!177 = !{i32 2, !"Debug Info Version", i32 3}
!178 = !{!"rustc version 1.80.0-dev"}
!179 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !180, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, globals: !280, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-lock-3.2.0/src/lib.rs/@/async_lock.3f1c597594037a1d-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-lock-3.2.0")
!181 = !{!182, !190, !199, !78, !206, !273}
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !183, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !185)
!183 = !DINamespace(name: "rt", scope: !184)
!184 = !DINamespace(name: "fmt", scope: !33)
!185 = !{!186, !187, !188, !189}
!186 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!187 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!188 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!189 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !191, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !193)
!191 = !DINamespace(name: "atomic", scope: !192)
!192 = !DINamespace(name: "sync", scope: !33)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!195 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!196 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!197 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!198 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !200, file: !2, baseType: !201, size: 8, align: 8, flags: DIFlagEnumClass, elements: !202)
!200 = !DINamespace(name: "cmp", scope: !33)
!201 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!202 = !{!203, !204, !205}
!203 = !DIEnumerator(name: "Less", value: -1)
!204 = !DIEnumerator(name: "Equal", value: 0)
!205 = !DIEnumerator(name: "Greater", value: 1)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !207, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagEnumClass, elements: !208)
!207 = !DINamespace(name: "alignment", scope: !54)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!209 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!212 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!213 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!220 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!221 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!222 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!223 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!224 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!225 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!226 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!227 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!228 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!229 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!230 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!231 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!232 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!233 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!234 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!235 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!236 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!237 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!238 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!239 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!240 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!241 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!242 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!243 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!244 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!245 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!246 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!247 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!248 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!249 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!250 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!251 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!252 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!253 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!254 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!255 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!256 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!257 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!258 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!259 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!260 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!261 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!262 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!263 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!264 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!265 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!266 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!267 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!268 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!269 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!270 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!271 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!272 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "State", scope: !274, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagEnumClass, elements: !276)
!274 = !DINamespace(name: "once_cell", scope: !275)
!275 = !DINamespace(name: "async_lock", scope: null)
!276 = !{!277, !278, !279}
!277 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "Initializing", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "Initialized", value: 2, isUnsigned: true)
!280 = !{!0, !164}
!281 = distinct !DISubprogram(name: "wait_with_parker<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN14event_listener21Listener$LT$T$C$B$GT$16wait_with_parker17h5269893ebfcdfa86E", scope: !283, file: !282, line: 1081, type: !552, scopeLine: 1081, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !550, declaration: !627, retainedNodes: !628)
!282 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/event-listener-4.0.1/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "7de12cd7a3ced25ebf9217e9754df9fb")
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", scope: !284, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !285, templateParams: !550, identifier: "83b7f692ef0485c0854c472543f9c29f")
!284 = !DINamespace(name: "event_listener", scope: null)
!285 = !{!286, !528}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !283, file: !2, baseType: !287, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", scope: !288, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !289, templateParams: !29, identifier: "dc571b9fd9d33de1cbef046fa6bbca53")
!288 = !DINamespace(name: "option", scope: !33)
!289 = !{!290}
!290 = !DICompositeType(tag: DW_TAG_variant_part, scope: !287, file: !2, size: 64, align: 64, elements: !291, templateParams: !29, identifier: "1c75bcd4279d08f6d7f0151ef500b652", discriminator: !527)
!291 = !{!292, !523}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !290, file: !2, baseType: !293, size: 64, align: 64, extraData: i128 0)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !287, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !294, identifier: "f244c10ebbc9ec40250443adbd767e88")
!294 = !{!295}
!295 = !DITemplateTypeParameter(name: "T", type: !296)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<event_listener::Inner<()>, alloc::alloc::Global>", scope: !297, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !299, templateParams: !522, identifier: "1228a95c6b03e1b2fb427e40de735dcb")
!297 = !DINamespace(name: "sync", scope: !298)
!298 = !DINamespace(name: "alloc", scope: null)
!299 = !{!300, !519, !521}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !296, file: !2, baseType: !301, size: 64, align: 64, flags: DIFlagPrivate)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<event_listener::Inner<()>>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !302, templateParams: !517, identifier: "c52bdbd8a3fbb388321f906d81354227")
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !301, file: !2, baseType: !304, size: 64, align: 64, flags: DIFlagPrivate)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<event_listener::Inner<()>>", baseType: !305, size: 64, align: 64, dwarfAddressSpace: 0)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<event_listener::Inner<()>>", scope: !297, file: !2, size: 576, align: 64, flags: DIFlagPrivate, elements: !306, templateParams: !515, identifier: "4a6de4631d18a02df0546014d6ecf6ed")
!306 = !{!307, !316, !317}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !305, file: !2, baseType: !308, size: 64, align: 64, flags: DIFlagPrivate)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !191, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !309, templateParams: !29, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !308, file: !2, baseType: !311, size: 64, align: 64, flags: DIFlagPrivate)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !173, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !312, templateParams: !314, identifier: "739795389d327d6873469e3d89b8c60e")
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !311, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!314 = !{!315}
!315 = !DITemplateTypeParameter(name: "T", type: !9)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !305, file: !2, baseType: !308, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !2, baseType: !318, size: 448, align: 64, offset: 128, flags: DIFlagPrivate)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<()>", scope: !284, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !319, templateParams: !57, identifier: "9236e854376b0d4cd170528eda8b9048")
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "notified", scope: !318, file: !2, baseType: !308, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !318, file: !2, baseType: !322, size: 384, align: 64, flags: DIFlagPrivate)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "List<()>", scope: !323, file: !2, size: 384, align: 64, flags: DIFlagProtected, elements: !324, templateParams: !57, identifier: "831cf0078a2b22a4269095f5421b530e")
!323 = !DINamespace(name: "sys", scope: !284)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !322, file: !2, baseType: !326, size: 384, align: 64, flags: DIFlagPrivate)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<event_listener::sys::Inner<()>>", scope: !327, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !329, templateParams: !513, identifier: "7dd8ddc59924866b415594ac3756958")
!327 = !DINamespace(name: "mutex", scope: !328)
!328 = !DINamespace(name: "sync", scope: !18)
!329 = !{!330, !346, !359}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !326, file: !2, baseType: !331, size: 32, align: 32, flags: DIFlagPrivate)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !332, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !335, templateParams: !29, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!332 = !DINamespace(name: "futex", scope: !333)
!333 = !DINamespace(name: "mutex", scope: !334)
!334 = !DINamespace(name: "sync", scope: !26)
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !331, file: !2, baseType: !337, size: 32, align: 32, flags: DIFlagPrivate)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !191, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !338, templateParams: !29, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !337, file: !2, baseType: !340, size: 32, align: 32, flags: DIFlagPrivate)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !173, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !341, templateParams: !344, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !340, file: !2, baseType: !343, size: 32, align: 32, flags: DIFlagPrivate)
!343 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!344 = !{!345}
!345 = !DITemplateTypeParameter(name: "T", type: !343)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !326, file: !2, baseType: !347, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !348, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !349, templateParams: !29, identifier: "f02169750979dbd37c1ab4c868f04f71")
!348 = !DINamespace(name: "poison", scope: !328)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !347, file: !2, baseType: !351, size: 8, align: 8, flags: DIFlagPrivate)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !191, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !352, templateParams: !29, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !351, file: !2, baseType: !354, size: 8, align: 8, flags: DIFlagPrivate)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !173, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !355, templateParams: !357, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !354, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagPrivate)
!357 = !{!358}
!358 = !DITemplateTypeParameter(name: "T", type: !79)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !2, baseType: !360, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::sys::Inner<()>>", scope: !173, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !361, templateParams: !513, identifier: "5ca6c82755304f17c40dfad2c9b3ae68")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !360, file: !2, baseType: !363, size: 320, align: 64, flags: DIFlagPrivate)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<()>", scope: !323, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !364, templateParams: !57, identifier: "1f53821c64e1dc705c119a88ffdf14ef")
!364 = !{!365, !509, !510, !511, !512}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !363, file: !2, baseType: !366, size: 64, align: 64, flags: DIFlagPrivate)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>", scope: !288, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !367, templateParams: !29, identifier: "a651642ae60dbe27c9256a2e2987ea45")
!367 = !{!368}
!368 = !DICompositeType(tag: DW_TAG_variant_part, scope: !366, file: !2, size: 64, align: 64, elements: !369, templateParams: !29, identifier: "6c43d02f03a7616245ba6c23a6eac020", discriminator: !508)
!369 = !{!370, !504}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !368, file: !2, baseType: !371, size: 64, align: 64, extraData: i128 0)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !366, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !372, identifier: "2f4f6e313ad10698e41c9a467abba3e")
!372 = !{!373}
!373 = !DITemplateTypeParameter(name: "T", type: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<event_listener::sys::Link<()>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !375, templateParams: !502, identifier: "ca7f93308dd70cba20b0c95ea39d96c7")
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !374, file: !2, baseType: !377, size: 64, align: 64, flags: DIFlagPrivate)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const event_listener::sys::Link<()>", baseType: !378, size: 64, align: 64, dwarfAddressSpace: 0)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Link<()>", scope: !323, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !379, templateParams: !57, identifier: "d96a7b30b8aa87a186213cac4bbb5535")
!379 = !{!380, !492, !501}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !378, file: !2, baseType: !381, size: 192, align: 64, flags: DIFlagPrivate)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<event_listener::State<()>>", scope: !173, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !382, templateParams: !490, identifier: "ce455b90cf8a3226e6d085b7a348c813")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !381, file: !2, baseType: !384, size: 192, align: 64, flags: DIFlagPrivate)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::State<()>>", scope: !173, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !385, templateParams: !490, identifier: "ba0d6097fed2e29aa005287c811892a0")
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !384, file: !2, baseType: !387, size: 192, align: 64, flags: DIFlagPrivate)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "State<()>", scope: !284, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !388, templateParams: !29, identifier: "63dfe96b96a361658919f1094c803e1d")
!388 = !{!389}
!389 = !DICompositeType(tag: DW_TAG_variant_part, scope: !387, file: !2, size: 192, align: 64, elements: !390, templateParams: !29, identifier: "ddfa394a9dea3c7477624267fd559989", discriminator: !489)
!390 = !{!391, !393, !399, !487}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Created", scope: !389, file: !2, baseType: !392, size: 192, align: 64, extraData: i128 0)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Created", scope: !387, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, templateParams: !57, identifier: "eebe2bf2e380cf59f003f13745fc4b61")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Notified", scope: !389, file: !2, baseType: !394, size: 192, align: 64, extraData: i128 1)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notified", scope: !387, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !395, templateParams: !57, identifier: "ec8a14c0854d13a38e922f5838ae8e9c")
!395 = !{!396, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !394, file: !2, baseType: !397, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!397 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !394, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPrivate)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Task", scope: !389, file: !2, baseType: !400, size: 192, align: 64, extraData: i128 2)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task", scope: !387, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !401, templateParams: !57, identifier: "62565a9d62398f017cec03b6f6071d12")
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !400, file: !2, baseType: !403, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task", scope: !284, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !404, templateParams: !29, identifier: "bab95dbe1505b2b7273f5e8e2a31eeaf")
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !403, file: !2, size: 128, align: 64, elements: !406, templateParams: !29, identifier: "2c48b1223c2eb30e6abbd03b03356d27", discriminator: !486)
!406 = !{!407, !433}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Waker", scope: !405, file: !2, baseType: !408, size: 128, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !403, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !409, templateParams: !29, identifier: "f984acde1be4429b167a7d96ebbb54fc")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !408, file: !2, baseType: !411, size: 128, align: 64, flags: DIFlagPrivate)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !412, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !414, templateParams: !29, identifier: "ec03eb30528f12f1717f729e65eac0d1")
!412 = !DINamespace(name: "wake", scope: !413)
!413 = !DINamespace(name: "task", scope: !33)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !411, file: !2, baseType: !416, size: 128, align: 64, flags: DIFlagPrivate)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !412, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !417, templateParams: !29, identifier: "212c6d54ee18011b525ba8a27d92578c")
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !416, file: !2, baseType: !6, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !416, file: !2, baseType: !420, size: 64, align: 64, flags: DIFlagPrivate)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !421, size: 64, align: 64, dwarfAddressSpace: 0)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !412, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !422, templateParams: !29, identifier: "f4abbf7758eb3384651691936bf57e5b")
!422 = !{!423, !427, !431, !432}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !421, file: !2, baseType: !424, size: 64, align: 64, flags: DIFlagPrivate)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !425, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !DISubroutineType(types: !426)
!426 = !{!416, !6}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !421, file: !2, baseType: !428, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !429, size: 64, align: 64, dwarfAddressSpace: 0)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !6}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !421, file: !2, baseType: !428, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !421, file: !2, baseType: !428, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "Unparker", scope: !405, file: !2, baseType: !434, size: 128, align: 64, extraData: i128 0)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !403, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !435, templateParams: !29, identifier: "26db9ed251879ce18293261e1d518cb7")
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !434, file: !2, baseType: !437, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !438, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !439, templateParams: !29, identifier: "5192ed2efe1020b6ccd5e36b4da17d5b")
!438 = !DINamespace(name: "parking", scope: null)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !437, file: !2, baseType: !441, size: 64, align: 64, flags: DIFlagPrivate)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<parking::Inner, alloc::alloc::Global>", scope: !297, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !442, templateParams: !484, identifier: "f2d46d41b9758d25450ea7070e7e54d0")
!442 = !{!443, !479, !481}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !441, file: !2, baseType: !444, size: 64, align: 64, flags: DIFlagPrivate)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<parking::Inner>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !445, templateParams: !477, identifier: "825cebb2feb53bbe75ce00c352a7557b")
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !444, file: !2, baseType: !447, size: 64, align: 64, flags: DIFlagPrivate)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<parking::Inner>", baseType: !448, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<parking::Inner>", scope: !297, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !449, templateParams: !475, identifier: "5b53f9341214387fb6b74fadd363563e")
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !448, file: !2, baseType: !308, size: 64, align: 64, flags: DIFlagPrivate)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !448, file: !2, baseType: !308, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !448, file: !2, baseType: !453, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !438, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !454, templateParams: !29, identifier: "5f39869ee684c5037dd93dab50c67fdb")
!454 = !{!455, !456, !465}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !453, file: !2, baseType: !308, size: 64, align: 64, flags: DIFlagPrivate)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !453, file: !2, baseType: !457, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !327, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !458, templateParams: !57, identifier: "d5fd249575a8d955fed7c24d847ce0e7")
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !457, file: !2, baseType: !331, size: 32, align: 32, flags: DIFlagPrivate)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !457, file: !2, baseType: !347, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !457, file: !2, baseType: !462, align: 8, offset: 40, flags: DIFlagPrivate)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !173, file: !2, align: 8, flags: DIFlagPublic, elements: !463, templateParams: !57, identifier: "df2a04390e4e7561d08d0a5a22c77b4a")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !462, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !453, file: !2, baseType: !466, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !467, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !468, templateParams: !29, identifier: "4ac5dba46f41aa1312825ffdc090ba3d")
!467 = !DINamespace(name: "condvar", scope: !328)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !466, file: !2, baseType: !470, size: 32, align: 32, flags: DIFlagPrivate)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !471, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !473, templateParams: !29, identifier: "85e7f52dd80c402ab0edc07952b121af")
!471 = !DINamespace(name: "futex", scope: !472)
!472 = !DINamespace(name: "condvar", scope: !334)
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !470, file: !2, baseType: !337, size: 32, align: 32, flags: DIFlagPrivate)
!475 = !{!476}
!476 = !DITemplateTypeParameter(name: "T", type: !453)
!477 = !{!478}
!478 = !DITemplateTypeParameter(name: "T", type: !448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !441, file: !2, baseType: !480, align: 8, offset: 64, flags: DIFlagPrivate)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<parking::Inner>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !477, identifier: "48ffbd424065b89079830852149b4cfc")
!481 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !441, file: !2, baseType: !482, align: 8, offset: 64, flags: DIFlagPrivate)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !483, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "14de19725ec4b1fd38fae074afd4da08")
!483 = !DINamespace(name: "alloc", scope: !298)
!484 = !{!476, !485}
!485 = !DITemplateTypeParameter(name: "A", type: !482)
!486 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "NotifiedTaken", scope: !389, file: !2, baseType: !488, size: 192, align: 64, extraData: i128 3)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotifiedTaken", scope: !387, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, templateParams: !57, identifier: "62f8f94ec586990abf11acec35a291c2")
!489 = !DIDerivedType(tag: DW_TAG_member, scope: !387, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!490 = !{!491}
!491 = !DITemplateTypeParameter(name: "T", type: !387)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !378, file: !2, baseType: !493, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>>", scope: !173, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !494, templateParams: !499, identifier: "efd26ad6b9e7548456865cd91786cab8")
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !493, file: !2, baseType: !496, size: 64, align: 64, flags: DIFlagPrivate)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>>", scope: !173, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !497, templateParams: !499, identifier: "a992c427cb11ecc7a9bede59a2c46259")
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !496, file: !2, baseType: !366, size: 64, align: 64, flags: DIFlagPrivate)
!499 = !{!500}
!500 = !DITemplateTypeParameter(name: "T", type: !366)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !2, baseType: !493, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!502 = !{!503}
!503 = !DITemplateTypeParameter(name: "T", type: !378)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !368, file: !2, baseType: !505, size: 64, align: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !366, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !506, templateParams: !372, identifier: "fc06e93de53e8de247be2b944fdbff52")
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !505, file: !2, baseType: !374, size: 64, align: 64, flags: DIFlagPublic)
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !363, file: !2, baseType: !366, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !2, baseType: !366, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !363, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "notified", scope: !363, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!513 = !{!514}
!514 = !DITemplateTypeParameter(name: "T", type: !363)
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "T", type: !318)
!517 = !{!518}
!518 = !DITemplateTypeParameter(name: "T", type: !305)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !296, file: !2, baseType: !520, align: 8, offset: 64, flags: DIFlagPrivate)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<event_listener::Inner<()>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !517, identifier: "1ceabe872a8d819ccd7eeb7e1ff5d79e")
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !296, file: !2, baseType: !482, align: 8, offset: 64, flags: DIFlagPrivate)
!522 = !{!516, !485}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !290, file: !2, baseType: !524, size: 64, align: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !287, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !525, templateParams: !294, identifier: "b635c134d561cdee547daa2c972e50b1")
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !524, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagPublic)
!527 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !283, file: !2, baseType: !529, size: 384, align: 64, flags: DIFlagPrivate)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<event_listener::sys::Listener<()>>", scope: !288, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !530, templateParams: !29, identifier: "b6935f8bec44da9f2b0d45570f533b65")
!530 = !{!531}
!531 = !DICompositeType(tag: DW_TAG_variant_part, scope: !529, file: !2, size: 384, align: 64, elements: !532, templateParams: !29, identifier: "4524821de6589915d1c2312c87fd9412", discriminator: !549)
!532 = !{!533, !545}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !531, file: !2, baseType: !534, size: 384, align: 64, extraData: i128 0)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !529, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !535, identifier: "5bc1a8b88c41e175d2f2f9a711c33761")
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Listener<()>", scope: !323, file: !2, size: 320, align: 64, flags: DIFlagProtected, elements: !538, templateParams: !57, identifier: "6c67e9e4a0a61d71a4e4345f56c07c62")
!538 = !{!539, !543}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !537, file: !2, baseType: !540, size: 320, align: 64, flags: DIFlagPrivate)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::sys::Link<()>>", scope: !173, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !541, templateParams: !502, identifier: "f7e4201bc01518672b0349a841413798")
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !540, file: !2, baseType: !378, size: 320, align: 64, flags: DIFlagPrivate)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_pin", scope: !537, file: !2, baseType: !544, align: 8, offset: 320, flags: DIFlagPrivate)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomPinned", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "796256403f7cfe154da7cf22e2ab8b2c")
!545 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !531, file: !2, baseType: !546, size: 384, align: 64, extraData: i128 1)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !529, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !547, templateParams: !535, identifier: "af29b3148323ebb374a689675fb70f9b")
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !546, file: !2, baseType: !537, size: 320, align: 64, offset: 64, flags: DIFlagPublic)
!549 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!550 = !{!42, !551}
!551 = !DITemplateTypeParameter(name: "B", type: !296)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !565, !572, !601, !612}
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<()>", scope: !288, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !555, templateParams: !29, identifier: "e4522e37ea160897c74a27967c8cd7d9")
!555 = !{!556}
!556 = !DICompositeType(tag: DW_TAG_variant_part, scope: !554, file: !2, size: 8, align: 8, elements: !557, templateParams: !29, identifier: "32b538f652c314cc30156c9fef9d8fbd", discriminator: !564)
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !556, file: !2, baseType: !559, size: 8, align: 8, extraData: i128 0)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !554, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !57, identifier: "83e4110844d3513a26e4d926477b961c")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !556, file: !2, baseType: !561, size: 8, align: 8, extraData: i128 1)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !554, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !562, templateParams: !57, identifier: "15d0a1e07d504bbc354d2f764e22e8c")
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !561, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!564 = !DIDerivedType(tag: DW_TAG_member, scope: !554, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<&mut event_listener::Listener<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>>", scope: !566, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !567, templateParams: !570, identifier: "fa245f641ca5103a13d81f4c541bb3f9")
!566 = !DINamespace(name: "pin", scope: !33)
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__pointer", scope: !565, file: !2, baseType: !569, size: 64, align: 64, flags: DIFlagPublic)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut event_listener::Listener<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!570 = !{!571}
!571 = !DITemplateTypeParameter(name: "Ptr", type: !569)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::time::Instant>", scope: !288, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !573, templateParams: !29, identifier: "c2bcd41f606d8ffcf0b82ec979be2648")
!573 = !{!574}
!574 = !DICompositeType(tag: DW_TAG_variant_part, scope: !572, file: !2, size: 128, align: 64, elements: !575, templateParams: !29, identifier: "e20be2e2724d11fd920ec7da578a4d86", discriminator: !600)
!575 = !{!576, !596}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !574, file: !2, baseType: !577, size: 128, align: 64, extraData: i128 1000000000)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !572, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !578, identifier: "c7169449d9c010b8e9d2e9e45fc721cd")
!578 = !{!579}
!579 = !DITemplateTypeParameter(name: "T", type: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Instant", scope: !581, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !582, templateParams: !29, identifier: "a1af9a6f59182c43b7f40bb485d4895c")
!581 = !DINamespace(name: "time", scope: !18)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !580, file: !2, baseType: !584, size: 128, align: 64, flags: DIFlagPrivate)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "Instant", scope: !585, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !586, templateParams: !29, identifier: "6a79d88fe16b06f569b2a1495770bf9c")
!585 = !DINamespace(name: "time", scope: !24)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !584, file: !2, baseType: !588, size: 128, align: 64, flags: DIFlagPrivate)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timespec", scope: !585, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !589, templateParams: !29, identifier: "713fd4c4d92360449b629588da718a41")
!589 = !{!590, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !588, file: !2, baseType: !591, size: 64, align: 64, flags: DIFlagPrivate)
!591 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !588, file: !2, baseType: !593, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !585, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !594, templateParams: !29, identifier: "34cd0a5e1340b1d71313099b10c73024")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !593, file: !2, baseType: !343, size: 32, align: 32, flags: DIFlagPrivate)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !574, file: !2, baseType: !597, size: 128, align: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !572, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !598, templateParams: !578, identifier: "f4af1952df026bc35ff8aa3391bce895")
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !597, file: !2, baseType: !580, size: 128, align: 64, flags: DIFlagPublic)
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !2, baseType: !343, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&parking::Parker", baseType: !602, size: 64, align: 64, dwarfAddressSpace: 0)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !438, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !603, templateParams: !29, identifier: "41d7f00bd7dcf5386de56676b39abc0b")
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "unparker", scope: !602, file: !2, baseType: !437, size: 64, align: 64, flags: DIFlagPrivate)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !602, file: !2, baseType: !606, align: 8, offset: 64, flags: DIFlagPrivate)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::cell::Cell<()>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !607, identifier: "83aff4402c54c54956628c6a359f3a70")
!607 = !{!608}
!608 = !DITemplateTypeParameter(name: "T", type: !609)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<()>", scope: !173, file: !2, align: 8, flags: DIFlagPublic, elements: !610, templateParams: !57, identifier: "99152f47ca36bb11fcaaf2b6a04a429e")
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !609, file: !2, baseType: !462, align: 8, flags: DIFlagPrivate)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskRef", scope: !284, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !613, templateParams: !29, identifier: "b1e99a70a62b848736335a5018c4f523")
!613 = !{!614}
!614 = !DICompositeType(tag: DW_TAG_variant_part, scope: !612, file: !2, size: 128, align: 64, elements: !615, templateParams: !29, identifier: "c43a79a2c37008cea6c48709f5f079f1", discriminator: !626)
!615 = !{!616, !621}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Waker", scope: !614, file: !2, baseType: !617, size: 128, align: 64, extraData: i128 0)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !612, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !618, templateParams: !29, identifier: "593960c9067bec0f44b6d7f3ca07e9fb")
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !617, file: !2, baseType: !620, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::Waker", baseType: !411, size: 64, align: 64, dwarfAddressSpace: 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Unparker", scope: !614, file: !2, baseType: !622, size: 128, align: 64, extraData: i128 1)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !612, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !623, templateParams: !29, identifier: "860264e1e8050543d57a1006e83bc124")
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !622, file: !2, baseType: !625, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&parking::Unparker", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !612, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!627 = !DISubprogram(name: "wait_with_parker<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN14event_listener21Listener$LT$T$C$B$GT$16wait_with_parker17h5269893ebfcdfa86E", scope: !283, file: !282, line: 1081, type: !552, scopeLine: 1081, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !550)
!628 = !{!629, !630, !631, !632, !633, !646, !649, !651, !653, !655}
!629 = !DILocalVariable(name: "self", arg: 1, scope: !281, file: !282, line: 1082, type: !565)
!630 = !DILocalVariable(name: "deadline", arg: 2, scope: !281, file: !282, line: 1083, type: !572)
!631 = !DILocalVariable(name: "parker", arg: 3, scope: !281, file: !282, line: 1084, type: !601)
!632 = !DILocalVariable(name: "unparker", arg: 4, scope: !281, file: !282, line: 1085, type: !612)
!633 = !DILocalVariable(name: "this", scope: !634, file: !282, line: 1087, type: !635, align: 8)
!634 = distinct !DILexicalBlock(scope: !281, file: !282, line: 1087, column: 9)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "ListenerProject<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", scope: !284, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !636, templateParams: !550, identifier: "6746f8f2616af0cc95995a11c2095f17")
!636 = !{!637, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !635, file: !2, baseType: !638, size: 64, align: 64, flags: DIFlagPrivate)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !635, file: !2, baseType: !640, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<&mut core::option::Option<event_listener::sys::Listener<()>>>", scope: !566, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !641, templateParams: !644, identifier: "589ef82dbad456517d9220ab487de0e1")
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__pointer", scope: !640, file: !2, baseType: !643, size: 64, align: 64, flags: DIFlagPublic)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<event_listener::sys::Listener<()>>", baseType: !529, size: 64, align: 64, dwarfAddressSpace: 0)
!644 = !{!645}
!645 = !DITemplateTypeParameter(name: "Ptr", type: !643)
!646 = !DILocalVariable(name: "inner", scope: !647, file: !282, line: 1088, type: !648, align: 8)
!647 = distinct !DILexicalBlock(scope: !634, file: !282, line: 1088, column: 9)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&event_listener::Inner<()>", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DILocalVariable(name: "tag", scope: !650, file: !282, line: 1095, type: !7, align: 1)
!650 = distinct !DILexicalBlock(scope: !647, file: !282, line: 1095, column: 88)
!651 = !DILocalVariable(name: "deadline", scope: !652, file: !282, line: 1105, type: !580, align: 8)
!652 = distinct !DILexicalBlock(scope: !647, file: !282, line: 1105, column: 17)
!653 = !DILocalVariable(name: "now", scope: !654, file: !282, line: 1107, type: !580, align: 8)
!654 = distinct !DILexicalBlock(scope: !652, file: !282, line: 1107, column: 21)
!655 = !DILocalVariable(name: "tag", scope: !656, file: !282, line: 1119, type: !7, align: 1)
!656 = distinct !DILexicalBlock(scope: !647, file: !282, line: 1119, column: 92)
!657 = !DILocation(line: 1107, column: 25, scope: !654)
!658 = !DILocation(line: 1105, column: 22, scope: !652)
!659 = !DILocalVariable(name: "msg", scope: !660, file: !661, line: 895, type: !146, align: 8)
!660 = distinct !DILexicalBlock(scope: !662, file: !661, line: 895, column: 5)
!661 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "1839402b3e3d27abc7bbff44f5b669ff")
!662 = distinct !DISubprogram(name: "expect<&alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h5eabaf8842cb17d4E", scope: !663, file: !661, line: 895, type: !677, scopeLine: 895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !669, declaration: !687, retainedNodes: !688)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", scope: !288, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !664, templateParams: !29, identifier: "f927ee8d048d54f2e41ee79a4b900be0")
!664 = !{!665}
!665 = !DICompositeType(tag: DW_TAG_variant_part, scope: !663, file: !2, size: 64, align: 64, elements: !666, templateParams: !29, identifier: "7661925260f2ab342bc727d716f665d1", discriminator: !676)
!666 = !{!667, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !665, file: !2, baseType: !668, size: 64, align: 64, extraData: i128 0)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !663, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !669, identifier: "fab5772a33d2b2d5799dd8471d680133")
!669 = !{!670}
!670 = !DITemplateTypeParameter(name: "T", type: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>", baseType: !296, size: 64, align: 64, dwarfAddressSpace: 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !665, file: !2, baseType: !673, size: 64, align: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !663, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !674, templateParams: !669, identifier: "b40d4231a19f8c9e60c27236298f1568")
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !673, file: !2, baseType: !671, size: 64, align: 64, flags: DIFlagPublic)
!676 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!677 = !DISubroutineType(types: !678)
!678 = !{!671, !663, !146, !679}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !680, size: 64, align: 64, dwarfAddressSpace: 0)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !681, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !683, templateParams: !29, identifier: "83f60b789274e9dfe5288fdb9ee764d1")
!681 = !DINamespace(name: "location", scope: !682)
!682 = !DINamespace(name: "panic", scope: !33)
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !680, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !680, file: !2, baseType: !343, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !680, file: !2, baseType: !343, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!687 = !DISubprogram(name: "expect<&alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h5eabaf8842cb17d4E", scope: !663, file: !661, line: 895, type: !677, scopeLine: 895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !669)
!688 = !{!689, !659, !690}
!689 = !DILocalVariable(name: "self", arg: 1, scope: !660, file: !661, line: 895, type: !663)
!690 = !DILocalVariable(name: "val", scope: !691, file: !661, line: 897, type: !671, align: 8)
!691 = distinct !DILexicalBlock(scope: !660, file: !661, line: 897, column: 13)
!692 = !DILocation(line: 0, scope: !660, inlinedAt: !693)
!693 = !DILocation(line: 1091, column: 14, scope: !634)
!694 = !DILocalVariable(name: "msg", scope: !695, file: !661, line: 895, type: !146, align: 8)
!695 = distinct !DILexicalBlock(scope: !696, file: !661, line: 895, column: 5)
!696 = distinct !DISubprogram(name: "expect<event_listener::State<()>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h2103f891841b1556E", scope: !697, file: !661, line: 895, type: !708, scopeLine: 895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !490, declaration: !710, retainedNodes: !711)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<event_listener::State<()>>", scope: !288, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !698, templateParams: !29, identifier: "4335fcf8a085892e9f42a3ccd82c349d")
!698 = !{!699}
!699 = !DICompositeType(tag: DW_TAG_variant_part, scope: !697, file: !2, size: 192, align: 64, elements: !700, templateParams: !29, identifier: "de3c2c8a6506a51ef13d0fb5796ec8c0", discriminator: !707)
!700 = !{!701, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !699, file: !2, baseType: !702, size: 192, align: 64, extraData: i128 4)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !697, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !490, identifier: "f250c58e9d1be3159e8b2be560804e55")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !699, file: !2, baseType: !704, size: 192, align: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !697, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !705, templateParams: !490, identifier: "bbcfc3ada940069ca7b8eb87bd7e06d3")
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !704, file: !2, baseType: !387, size: 192, align: 64, flags: DIFlagPublic)
!707 = !DIDerivedType(tag: DW_TAG_member, scope: !697, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!708 = !DISubroutineType(types: !709)
!709 = !{!387, !697, !146, !679}
!710 = !DISubprogram(name: "expect<event_listener::State<()>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h2103f891841b1556E", scope: !697, file: !661, line: 895, type: !708, scopeLine: 895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !490)
!711 = !{!712, !694, !713}
!712 = !DILocalVariable(name: "self", arg: 1, scope: !695, file: !661, line: 895, type: !697)
!713 = !DILocalVariable(name: "val", scope: !714, file: !661, line: 897, type: !387, align: 8)
!714 = distinct !DILexicalBlock(scope: !695, file: !661, line: 897, column: 13)
!715 = !DILocation(line: 0, scope: !695, inlinedAt: !716)
!716 = !DILocation(line: 1112, column: 30, scope: !654)
!717 = !DILocation(line: 0, scope: !281)
!718 = !DILocation(line: 1095, column: 21, scope: !650)
!719 = !DILocation(line: 895, column: 25, scope: !695, inlinedAt: !716)
!720 = !DILocation(line: 1119, column: 25, scope: !656)
!721 = !DILocalVariable(name: "event", scope: !722, file: !282, line: 1009, type: !638, align: 8)
!722 = !DILexicalBlockFile(scope: !723, file: !282, discriminator: 0)
!723 = distinct !DILexicalBlock(scope: !725, file: !724, line: 987, column: 17)
!724 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/pin-project-lite-0.2.13/src/lib.rs", directory: "", checksumkind: CSK_MD5, checksum: "5351df2cf9ad264a639a0d7db482e003")
!725 = distinct !DILexicalBlock(scope: !726, file: !724, line: 983, column: 9)
!726 = distinct !DISubprogram(name: "project<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN14event_listener1_55_$LT$impl$u20$event_listener..Listener$LT$T$C$B$GT$$GT$7project17h4c4aeb01615c63f6E", scope: !283, file: !724, line: 983, type: !727, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !550, declaration: !729, retainedNodes: !730)
!727 = !DISubroutineType(types: !728)
!728 = !{!635, !565}
!729 = !DISubprogram(name: "project<(), alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN14event_listener1_55_$LT$impl$u20$event_listener..Listener$LT$T$C$B$GT$$GT$7project17h4c4aeb01615c63f6E", scope: !283, file: !724, line: 983, type: !727, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !550)
!730 = !{!731, !721, !733}
!731 = !DILocalVariable(name: "self", arg: 1, scope: !732, file: !282, line: 1009, type: !565)
!732 = !DILexicalBlockFile(scope: !725, file: !282, discriminator: 0)
!733 = !DILocalVariable(name: "listener", scope: !722, file: !282, line: 1009, type: !643, align: 8)
!734 = !DILocation(line: 0, scope: !722, inlinedAt: !735)
!735 = !DILocation(line: 1087, column: 29, scope: !281)
!736 = !DILocation(line: 1009, column: 1, scope: !722, inlinedAt: !735)
!737 = !DILocation(line: 0, scope: !634)
!738 = !DILocalVariable(name: "self", arg: 1, scope: !739, file: !661, line: 684, type: !638)
!739 = distinct !DILexicalBlock(scope: !740, file: !661, line: 684, column: 5)
!740 = distinct !DISubprogram(name: "as_ref<alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17he218af578ad10efdE", scope: !287, file: !661, line: 684, type: !741, scopeLine: 684, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !294, declaration: !744, retainedNodes: !745)
!741 = !DISubroutineType(types: !742)
!742 = !{!663, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", baseType: !287, size: 64, align: 64, dwarfAddressSpace: 0)
!744 = !DISubprogram(name: "as_ref<alloc::sync::Arc<event_listener::Inner<()>, alloc::alloc::Global>>", linkageName: "_ZN4core6option15Option$LT$T$GT$6as_ref17he218af578ad10efdE", scope: !287, file: !661, line: 684, type: !741, scopeLine: 684, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !294)
!745 = !{!738, !746}
!746 = !DILocalVariable(name: "x", scope: !747, file: !661, line: 686, type: !671, align: 8)
!747 = distinct !DILexicalBlock(scope: !739, file: !661, line: 686, column: 13)
!748 = !DILocation(line: 0, scope: !739, inlinedAt: !749)
!749 = !DILocation(line: 1090, column: 14, scope: !634)
!750 = !DILocation(line: 685, column: 15, scope: !739, inlinedAt: !749)
!751 = !DILocation(line: 685, column: 9, scope: !739, inlinedAt: !749)
!752 = !DILocation(line: 898, column: 21, scope: !660, inlinedAt: !693)
!753 = !DILocalVariable(name: "self", arg: 1, scope: !754, file: !755, line: 3772, type: !671)
!754 = distinct !DISubprogram(name: "borrow<event_listener::Inner<()>, alloc::alloc::Global>", linkageName: "_ZN79_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..borrow..Borrow$LT$T$GT$$GT$6borrow17h8a4347715a4f55fdE", scope: !756, file: !755, line: 3772, type: !757, scopeLine: 3772, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !522, retainedNodes: !759)
!755 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/sync.rs", directory: "", checksumkind: CSK_MD5, checksum: "d97152ce06873160e4001a6951abf5fd")
!756 = !DINamespace(name: "{impl#72}", scope: !297)
!757 = !DISubroutineType(types: !758)
!758 = !{!648, !671}
!759 = !{!753}
!760 = !DILocation(line: 0, scope: !754, inlinedAt: !761)
!761 = distinct !DILocation(line: 1088, column: 21, scope: !634)
!762 = !DILocation(line: 3773, column: 9, scope: !754, inlinedAt: !761)
!763 = !DILocation(line: 0, scope: !647)
!764 = !DILocation(line: 1095, column: 28, scope: !650)
!765 = !{i8 0, i8 3}
!766 = !DILocalVariable(name: "pieces", scope: !767, file: !768, line: 341, type: !898, align: 8)
!767 = distinct !DILexicalBlock(scope: !769, file: !768, line: 341, column: 5)
!768 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!769 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17h371adf6c5c55922eE", scope: !770, file: !768, line: 341, type: !896, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, templateParams: !29, declaration: !902, retainedNodes: !903)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !184, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !771, templateParams: !29, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!771 = !{!772, !778, !821}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !770, file: !2, baseType: !773, size: 128, align: 64, flags: DIFlagPrivate)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !774, templateParams: !29, identifier: "4e66b00a376d6af5b8765440fb2839f")
!774 = !{!775, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !773, file: !2, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !773, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !770, file: !2, baseType: !779, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !288, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !780, templateParams: !29, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!780 = !{!781}
!781 = !DICompositeType(tag: DW_TAG_variant_part, scope: !779, file: !2, size: 128, align: 64, elements: !782, templateParams: !29, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !820)
!782 = !{!783, !816}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !781, file: !2, baseType: !784, size: 128, align: 64, extraData: i128 0)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !779, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !785, identifier: "c062391546990b9ae716e587a9c44107")
!785 = !{!786}
!786 = !DITemplateTypeParameter(name: "T", type: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !788, templateParams: !29, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!788 = !{!789, !815}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !787, file: !2, baseType: !790, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64, dwarfAddressSpace: 0)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !183, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !792, templateParams: !29, identifier: "402846c0893391618e34a15e0598c24e")
!792 = !{!793, !794, !796, !797, !798, !814}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !791, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !791, file: !2, baseType: !795, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!795 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !791, file: !2, baseType: !182, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !791, file: !2, baseType: !343, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !791, file: !2, baseType: !799, size: 128, align: 64, flags: DIFlagPublic)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !183, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !800, templateParams: !29, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!800 = !{!801}
!801 = !DICompositeType(tag: DW_TAG_variant_part, scope: !799, file: !2, size: 128, align: 64, elements: !802, templateParams: !29, identifier: "96fecae849037968fdad1729d3166571", discriminator: !813)
!802 = !{!803, !807, !811}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !801, file: !2, baseType: !804, size: 128, align: 64, extraData: i128 0)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !799, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !805, templateParams: !29, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !804, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !801, file: !2, baseType: !808, size: 128, align: 64, extraData: i128 1)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !799, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !809, templateParams: !29, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !808, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !801, file: !2, baseType: !812, size: 128, align: 64, extraData: i128 2)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !799, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, identifier: "844235131be8a6898de5150ba908049f")
!813 = !DIDerivedType(tag: DW_TAG_member, scope: !799, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !791, file: !2, baseType: !799, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !787, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !781, file: !2, baseType: !817, size: 128, align: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !779, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !818, templateParams: !785, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !817, file: !2, baseType: !787, size: 128, align: 64, flags: DIFlagPublic)
!820 = !DIDerivedType(tag: DW_TAG_member, scope: !779, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !770, file: !2, baseType: !822, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !823, templateParams: !29, identifier: "baf028fc654408299b6dd770f089fd48")
!823 = !{!824, !895}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !822, file: !2, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64, dwarfAddressSpace: 0)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !183, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !827, templateParams: !29, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !826, file: !2, baseType: !829, size: 128, align: 64, flags: DIFlagPrivate)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !183, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !830, templateParams: !29, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!830 = !{!831}
!831 = !DICompositeType(tag: DW_TAG_variant_part, scope: !829, file: !2, size: 128, align: 64, elements: !832, templateParams: !29, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !894)
!832 = !{!833, !890}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !831, file: !2, baseType: !834, size: 128, align: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !829, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !835, templateParams: !29, identifier: "7c7df21330d573ca4eefe40395fd691")
!835 = !{!836, !840}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !834, file: !2, baseType: !837, size: 64, align: 64, flags: DIFlagPrivate)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !838, size: 64, align: 64, dwarfAddressSpace: 0)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !839, file: !2, align: 8, elements: !29, identifier: "728a64207294457ae982b2390ae8a902")
!839 = !DINamespace(name: "{extern#0}", scope: !183)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !834, file: !2, baseType: !841, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !842, size: 64, align: 64, dwarfAddressSpace: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!844, !837, !860}
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !32, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !845, templateParams: !29, identifier: "d2df09569ea43718984b3f07c77d7786")
!845 = !{!846}
!846 = !DICompositeType(tag: DW_TAG_variant_part, scope: !844, file: !2, size: 8, align: 8, elements: !847, templateParams: !29, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !859)
!847 = !{!848, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !846, file: !2, baseType: !849, size: 8, align: 8, extraData: i128 0)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !844, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !850, templateParams: !852, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !849, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!852 = !{!42, !853}
!853 = !DITemplateTypeParameter(name: "E", type: !854)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !184, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !846, file: !2, baseType: !856, size: 8, align: 8, extraData: i128 1)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !844, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !857, templateParams: !852, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!857 = !{!858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !856, file: !2, baseType: !854, align: 8, offset: 8, flags: DIFlagPublic)
!859 = !DIDerivedType(tag: DW_TAG_member, scope: !844, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !861, size: 64, align: 64, dwarfAddressSpace: 0)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !184, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !862, templateParams: !29, identifier: "9d9578b0f9368582a2201563ca126cd4")
!862 = !{!863, !864, !865, !866, !878, !879}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !861, file: !2, baseType: !343, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !861, file: !2, baseType: !795, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !861, file: !2, baseType: !182, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !861, file: !2, baseType: !867, size: 128, align: 64, flags: DIFlagPrivate)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !288, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !868, templateParams: !29, identifier: "3850c4a210aea148b16f79ec227c427")
!868 = !{!869}
!869 = !DICompositeType(tag: DW_TAG_variant_part, scope: !867, file: !2, size: 128, align: 64, elements: !870, templateParams: !29, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !877)
!870 = !{!871, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !869, file: !2, baseType: !872, size: 128, align: 64, extraData: i128 0)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !867, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !314, identifier: "10be3845cc366e59d680126f255dea8b")
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !869, file: !2, baseType: !874, size: 128, align: 64, extraData: i128 1)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !867, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !875, templateParams: !314, identifier: "d166501012b6febc55685f1b3285acb8")
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !874, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!877 = !DIDerivedType(tag: DW_TAG_member, scope: !867, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !861, file: !2, baseType: !867, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !861, file: !2, baseType: !880, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !881, templateParams: !29, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!881 = !{!882, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !880, file: !2, baseType: !883, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64, dwarfAddressSpace: 0)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !29, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !880, file: !2, baseType: !886, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !887, size: 64, align: 64, dwarfAddressSpace: 0)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 6, lowerBound: 0)
