; ModuleID = 'async_signal.202203b544e74697-cgu.0'
source_filename = "async_signal.202203b544e74697-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"slab::Entry<core::option::Option<core::task::wake::Waker>>" = type { i64, [2 x i64] }
%"async_io::reactor::Direction" = type { %"core::option::Option<(usize, usize)>", %"slab::Slab<core::option::Option<core::task::wake::Waker>>", i64, %"core::option::Option<core::task::wake::Waker>" }
%"core::option::Option<(usize, usize)>" = type { i64, [2 x i64] }
%"slab::Slab<core::option::Option<core::task::wake::Waker>>" = type { %"alloc::vec::Vec<slab::Entry<core::option::Option<core::task::wake::Waker>>>", i64, i64 }
%"alloc::vec::Vec<slab::Entry<core::option::Option<core::task::wake::Waker>>>" = type { %"alloc::raw_vec::RawVec<slab::Entry<core::option::Option<core::task::wake::Waker>>>", i64 }
%"alloc::raw_vec::RawVec<slab::Entry<core::option::Option<core::task::wake::Waker>>>" = type { i64, ptr, %"alloc::alloc::Global" }
%"alloc::alloc::Global" = type {}
%"core::option::Option<core::task::wake::Waker>" = type { ptr, [1 x i64] }
%"signal_hook_registry::SigId" = type { i128, i32, [3 x i32] }

@_ZN3std9panicking11panic_count18GLOBAL_PANIC_COUNT17h00e7dcd913cdfbe0E = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !9, templateParams: !12, identifier: "3ce104670d23cbc41299f657a9cf1bea")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !{}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "<&core::option::Option<core::task::wake::Waker> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !15, isLocal: true, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<core::task::wake::Waker> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !16, vtableHolder: !21, templateParams: !12, identifier: "945b6424a8246515b262ef753cb978f7")
!16 = !{!17, !18, !19, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !15, file: !2, baseType: !6, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !15, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !15, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::task::wake::Waker>", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::task::wake::Waker>", scope: !23, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !25, templateParams: !12, identifier: "fdf92b2a7f95e10b1f6af3c28f571177")
!23 = !DINamespace(name: "option", scope: !24)
!24 = !DINamespace(name: "core", scope: null)
!25 = !{!26}
!26 = !DICompositeType(tag: DW_TAG_variant_part, scope: !22, file: !2, size: 128, align: 64, elements: !27, templateParams: !12, identifier: "79b709c92f110a7567e6b4260f3fffd1", discriminator: !58)
!27 = !{!28, !54}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !26, file: !2, baseType: !29, size: 128, align: 64, extraData: i128 0)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !22, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !30, identifier: "e3b1b04ced3820bf6ad9a1cf1a84b270")
!30 = !{!31}
!31 = !DITemplateTypeParameter(name: "T", type: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !35, templateParams: !12, identifier: "ec03eb30528f12f1717f729e65eac0d1")
!33 = !DINamespace(name: "wake", scope: !34)
!34 = !DINamespace(name: "task", scope: !24)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !32, file: !2, baseType: !37, size: 128, align: 64, flags: DIFlagPrivate)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !33, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !38, templateParams: !12, identifier: "212c6d54ee18011b525ba8a27d92578c")
!38 = !{!39, !40}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !37, file: !2, baseType: !6, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !37, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagPrivate)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !33, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !43, templateParams: !12, identifier: "f4abbf7758eb3384651691936bf57e5b")
!43 = !{!44, !48, !52, !53}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !42, file: !2, baseType: !45, size: 64, align: 64, flags: DIFlagPrivate)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DISubroutineType(types: !47)
!47 = !{!37, !6}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !42, file: !2, baseType: !49, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !6}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !42, file: !2, baseType: !49, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !42, file: !2, baseType: !49, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !26, file: !2, baseType: !55, size: 128, align: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !22, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !56, templateParams: !30, identifier: "f45b850959d020985d588404342ce426")
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !55, file: !2, baseType: !32, size: 128, align: 64, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, scope: !22, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagArtificial)
!59 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "<&async_signal::Signal as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&async_signal::Signal as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !63, vtableHolder: !68, templateParams: !12, identifier: "516838f85b092dbd56266d9a7e8faf2b")
!63 = !{!64, !65, !66, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !62, file: !2, baseType: !6, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !62, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !62, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !62, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&async_signal::Signal", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Signal", scope: !70, file: !2, baseType: !71, size: 32, align: 32, flags: DIFlagEnumClass, elements: !72)
!70 = !DINamespace(name: "async_signal", scope: null)
!71 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!73 = !DIEnumerator(name: "Hup", value: 1)
!74 = !DIEnumerator(name: "Int", value: 2)
!75 = !DIEnumerator(name: "Quit", value: 3)
!76 = !DIEnumerator(name: "Ill", value: 4)
!77 = !DIEnumerator(name: "Trap", value: 5)
!78 = !DIEnumerator(name: "Abort", value: 6)
!79 = !DIEnumerator(name: "Bus", value: 7)
!80 = !DIEnumerator(name: "Fpe", value: 8)
!81 = !DIEnumerator(name: "Kill", value: 9)
!82 = !DIEnumerator(name: "Usr1", value: 10)
!83 = !DIEnumerator(name: "Segv", value: 11)
!84 = !DIEnumerator(name: "Usr2", value: 12)
!85 = !DIEnumerator(name: "Pipe", value: 13)
!86 = !DIEnumerator(name: "Alarm", value: 14)
!87 = !DIEnumerator(name: "Term", value: 15)
!88 = !DIEnumerator(name: "Child", value: 17)
!89 = !DIEnumerator(name: "Cont", value: 18)
!90 = !DIEnumerator(name: "Stop", value: 19)
!91 = !DIEnumerator(name: "Tstp", value: 20)
!92 = !DIEnumerator(name: "Ttin", value: 21)
!93 = !DIEnumerator(name: "Ttou", value: 22)
!94 = !DIEnumerator(name: "Urg", value: 23)
!95 = !DIEnumerator(name: "Xcpu", value: 24)
!96 = !DIEnumerator(name: "Xfsz", value: 25)
!97 = !DIEnumerator(name: "Vtalarm", value: 26)
!98 = !DIEnumerator(name: "Prof", value: 27)
!99 = !DIEnumerator(name: "Winch", value: 28)
!100 = !DIEnumerator(name: "Io", value: 29)
!101 = !DIEnumerator(name: "Sys", value: 31)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "<&async_io::reactor::Direction as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&async_io::reactor::Direction as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !105, vtableHolder: !110, templateParams: !12, identifier: "22b8df5e0f4992dc425e6850ef79f534")
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !104, file: !2, baseType: !6, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !104, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !104, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&async_io::reactor::Direction", baseType: !111, size: 64, align: 64, dwarfAddressSpace: 0)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Direction", scope: !112, file: !2, size: 704, align: 64, flags: DIFlagPrivate, elements: !114, templateParams: !12, identifier: "6da8b981c2b2a613b39a6463be0587dc")
!112 = !DINamespace(name: "reactor", scope: !113)
!113 = !DINamespace(name: "async_io", scope: null)
!114 = !{!115, !116, !134, !135}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 512, flags: DIFlagPrivate)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !111, file: !2, baseType: !117, size: 192, align: 64, flags: DIFlagPrivate)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, usize)>", scope: !23, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !118, templateParams: !12, identifier: "60ebe44f7f85bde5fbf5224152b43805")
!118 = !{!119}
!119 = !DICompositeType(tag: DW_TAG_variant_part, scope: !117, file: !2, size: 192, align: 64, elements: !120, templateParams: !12, identifier: "c17f74bf80ade714e536ad0954baea5d", discriminator: !133)
!120 = !{!121, !129}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !119, file: !2, baseType: !122, size: 192, align: 64, extraData: i128 0)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !117, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !123, identifier: "46c80ea7422eb85448862a3bf2409858")
!123 = !{!124}
!124 = !DITemplateTypeParameter(name: "T", type: !125)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, usize)", file: !2, size: 128, align: 64, elements: !126, templateParams: !12, identifier: "ca118d84a4b6c0e17708a0e2b6ab8550")
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !125, file: !2, baseType: !9, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !125, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !119, file: !2, baseType: !130, size: 192, align: 64, extraData: i128 1)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !117, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !131, templateParams: !123, identifier: "b6b31ddb5542ad91e7fac01539c76943")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !2, baseType: !125, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, scope: !117, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagArtificial)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !111, file: !2, baseType: !22, size: 128, align: 64, offset: 576, flags: DIFlagPrivate)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "wakers", scope: !111, file: !2, baseType: !136, size: 320, align: 64, offset: 192, flags: DIFlagPrivate)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slab<core::option::Option<core::task::wake::Waker>>", scope: !137, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !138, templateParams: !167, identifier: "164c75fb0fc14a34a102a46612863fda")
!137 = !DINamespace(name: "slab", scope: null)
!138 = !{!139, !189, !190}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !136, file: !2, baseType: !140, size: 192, align: 64, flags: DIFlagPrivate)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<slab::Entry<core::option::Option<core::task::wake::Waker>>, alloc::alloc::Global>", scope: !141, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !143, templateParams: !186, identifier: "2984134d7d3225067f68d45feed19b78")
!141 = !DINamespace(name: "vec", scope: !142)
!142 = !DINamespace(name: "alloc", scope: null)
!143 = !{!144, !188}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !140, file: !2, baseType: !145, size: 128, align: 64, flags: DIFlagPrivate)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<slab::Entry<core::option::Option<core::task::wake::Waker>>, alloc::alloc::Global>", scope: !146, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !147, templateParams: !186, identifier: "9c5ac50ed7db8e338391a0ce9c167c08")
!146 = !DINamespace(name: "raw_vec", scope: !142)
!147 = !{!148, !179, !183}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !145, file: !2, baseType: !149, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<slab::Entry<core::option::Option<core::task::wake::Waker>>>", scope: !150, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !152, templateParams: !174, identifier: "ef8dd6e846db0f3baa266ebbbd46f9a6")
!150 = !DINamespace(name: "unique", scope: !151)
!151 = !DINamespace(name: "ptr", scope: !24)
!152 = !{!153, !176}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !149, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagPrivate)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<slab::Entry<core::option::Option<core::task::wake::Waker>>>", scope: !155, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !156, templateParams: !174, identifier: "871aa4b73c6492e8c25d6fe6d537ba3c")
!155 = !DINamespace(name: "non_null", scope: !151)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !154, file: !2, baseType: !158, size: 64, align: 64, flags: DIFlagPrivate)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const slab::Entry<core::option::Option<core::task::wake::Waker>>", baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<core::option::Option<core::task::wake::Waker>>", scope: !137, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !160, templateParams: !12, identifier: "dba5a182387037feede16c3779be426")
!160 = !{!161}
!161 = !DICompositeType(tag: DW_TAG_variant_part, scope: !159, file: !2, size: 192, align: 64, elements: !162, templateParams: !12, identifier: "6c8429f9e5d10db842c0b161ee131c19", discriminator: !173)
!162 = !{!163, !169}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Vacant", scope: !161, file: !2, baseType: !164, size: 192, align: 64, extraData: i128 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vacant", scope: !159, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !165, templateParams: !167, identifier: "7a3fdceafe0308e12447f767b5a53dad")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!167 = !{!168}
!168 = !DITemplateTypeParameter(name: "T", type: !22)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "Occupied", scope: !161, file: !2, baseType: !170, size: 192, align: 64, extraData: i128 1)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Occupied", scope: !159, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !171, templateParams: !167, identifier: "44a5481899ff703fc0bc641cc2e5c22a")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !170, file: !2, baseType: !22, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagArtificial)
!174 = !{!175}
!175 = !DITemplateTypeParameter(name: "T", type: !159)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !149, file: !2, baseType: !177, align: 8, offset: 64, flags: DIFlagPrivate)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<slab::Entry<core::option::Option<core::task::wake::Waker>>>", scope: !178, file: !2, align: 8, flags: DIFlagPublic, elements: !12, templateParams: !174, identifier: "72a74fdc8618b2746ab5800ff2005f19")
!178 = !DINamespace(name: "marker", scope: !24)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !145, file: !2, baseType: !180, size: 64, align: 64, flags: DIFlagPrivate)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !146, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !181, templateParams: !12, identifier: "62de598dd28eaf1c7c0f61ca013e23b")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !180, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !145, file: !2, baseType: !184, align: 8, offset: 128, flags: DIFlagPrivate)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !185, file: !2, align: 8, flags: DIFlagPublic, elements: !12, identifier: "14de19725ec4b1fd38fae074afd4da08")
!185 = !DINamespace(name: "alloc", scope: !142)
!186 = !{!175, !187}
!187 = !DITemplateTypeParameter(name: "A", type: !184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !140, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !194, vtableHolder: !199, templateParams: !12, identifier: "84b1534180bf746fe7f84d518dd21fd7")
!194 = !{!195, !196, !197, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !193, file: !2, baseType: !6, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !193, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !193, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "<alloc::sync::Arc<async_io::reactor::Source, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::sync::Arc<async_io::reactor::Source, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !203, vtableHolder: !208, templateParams: !12, identifier: "c09bc41a1767b3493615caa26fc9b6c1")
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !202, file: !2, baseType: !6, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !202, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !202, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !202, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<async_io::reactor::Source, alloc::alloc::Global>", scope: !209, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !210, templateParams: !293, identifier: "67ce06212caebc5152aa42151e039c54")
!209 = !DINamespace(name: "sync", scope: !142)
!210 = !{!211, !290, !292}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !208, file: !2, baseType: !212, size: 64, align: 64, flags: DIFlagPrivate)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<async_io::reactor::Source>>", scope: !155, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !213, templateParams: !288, identifier: "1f568c9b13e3755631e5b305cb0668f9")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !212, file: !2, baseType: !215, size: 64, align: 64, flags: DIFlagPrivate)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<async_io::reactor::Source>", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<async_io::reactor::Source>", scope: !209, file: !2, size: 1728, align: 64, flags: DIFlagPrivate, elements: !217, templateParams: !286, identifier: "f5345b380e8581d0644d8908845c3a23")
!217 = !{!218, !230, !231}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !216, file: !2, baseType: !219, size: 64, align: 64, flags: DIFlagPrivate)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !220, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !222, templateParams: !12, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!220 = !DINamespace(name: "atomic", scope: !221)
!221 = !DINamespace(name: "sync", scope: !24)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !219, file: !2, baseType: !224, size: 64, align: 64, flags: DIFlagPrivate)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !225, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !226, templateParams: !228, identifier: "739795389d327d6873469e3d89b8c60e")
!225 = !DINamespace(name: "cell", scope: !24)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !224, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!228 = !{!229}
!229 = !DITemplateTypeParameter(name: "T", type: !9)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !216, file: !2, baseType: !219, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !2, baseType: !232, size: 1600, align: 64, offset: 128, flags: DIFlagPrivate)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Source", scope: !112, file: !2, size: 1600, align: 64, flags: DIFlagProtected, elements: !233, templateParams: !12, identifier: "bbb97a89347f59cd9f6852d5a98f06a")
!233 = !{!234, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "registration", scope: !232, file: !2, baseType: !235, size: 32, align: 32, offset: 1536, flags: DIFlagPrivate)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "Registration", scope: !236, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !237, templateParams: !12, identifier: "5fdc780a771acb092831fb918b11c16d")
!236 = !DINamespace(name: "unix", scope: !112)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !235, file: !2, baseType: !71, size: 32, align: 32, flags: DIFlagPrivate)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !232, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !232, file: !2, baseType: !241, size: 1472, align: 64, offset: 64, flags: DIFlagPrivate)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<[async_io::reactor::Direction; 2]>", scope: !242, file: !2, size: 1472, align: 64, flags: DIFlagPublic, elements: !245, templateParams: !284, identifier: "8f1100341512ef50143e4000edcdfb60")
!242 = !DINamespace(name: "mutex", scope: !243)
!243 = !DINamespace(name: "sync", scope: !244)
!244 = !DINamespace(name: "std", scope: null)
!245 = !{!246, !263, !277}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !241, file: !2, baseType: !247, size: 32, align: 32, flags: DIFlagPrivate)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !248, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !252, templateParams: !12, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!248 = !DINamespace(name: "futex", scope: !249)
!249 = !DINamespace(name: "mutex", scope: !250)
!250 = !DINamespace(name: "sync", scope: !251)
!251 = !DINamespace(name: "sys", scope: !244)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !247, file: !2, baseType: !254, size: 32, align: 32, flags: DIFlagPrivate)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !220, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !255, templateParams: !12, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !254, file: !2, baseType: !257, size: 32, align: 32, flags: DIFlagPrivate)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !225, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !258, templateParams: !261, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !257, file: !2, baseType: !260, size: 32, align: 32, flags: DIFlagPrivate)
!260 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!261 = !{!262}
!262 = !DITemplateTypeParameter(name: "T", type: !260)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !241, file: !2, baseType: !264, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !265, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !266, templateParams: !12, identifier: "f02169750979dbd37c1ab4c868f04f71")
!265 = !DINamespace(name: "poison", scope: !243)
!266 = !{!267}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !264, file: !2, baseType: !268, size: 8, align: 8, flags: DIFlagPrivate)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !220, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !269, templateParams: !12, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !268, file: !2, baseType: !271, size: 8, align: 8, flags: DIFlagPrivate)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !225, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !272, templateParams: !275, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !271, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagPrivate)
!274 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!275 = !{!276}
!276 = !DITemplateTypeParameter(name: "T", type: !274)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !2, baseType: !278, size: 1408, align: 64, offset: 64, flags: DIFlagPrivate)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<[async_io::reactor::Direction; 2]>", scope: !225, file: !2, size: 1408, align: 64, flags: DIFlagPublic, elements: !279, templateParams: !284, identifier: "80b4e2cbaea5d9c41bcbd1341dd716f1")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !278, file: !2, baseType: !281, size: 1408, align: 64, flags: DIFlagPrivate)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 1408, align: 64, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 2, lowerBound: 0)
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "T", type: !281)
!286 = !{!287}
!287 = !DITemplateTypeParameter(name: "T", type: !232)
!288 = !{!289}
!289 = !DITemplateTypeParameter(name: "T", type: !216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !208, file: !2, baseType: !291, align: 8, offset: 64, flags: DIFlagPrivate)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<async_io::reactor::Source>>", scope: !178, file: !2, align: 8, flags: DIFlagPublic, elements: !12, templateParams: !288, identifier: "17a0cb26c8335f997a98bfecd922518e")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !208, file: !2, baseType: !184, align: 8, offset: 64, flags: DIFlagPrivate)
!293 = !{!287, !187}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "<&core::option::Option<std::os::unix::net::stream::UnixStream> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<std::os::unix::net::stream::UnixStream> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !297, vtableHolder: !302, templateParams: !12, identifier: "2fa14a96b1df767716c77a0cc5ca4fd9")
!297 = !{!298, !299, !300, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !296, file: !2, baseType: !6, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !296, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !296, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !296, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<std::os::unix::net::stream::UnixStream>", baseType: !303, size: 64, align: 64, dwarfAddressSpace: 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::os::unix::net::stream::UnixStream>", scope: !23, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !304, templateParams: !12, identifier: "c6699034166db0dfb3097b2613eade37")
!304 = !{!305}
!305 = !DICompositeType(tag: DW_TAG_variant_part, scope: !303, file: !2, size: 32, align: 32, elements: !306, templateParams: !12, identifier: "7ea5061a320348722e05ce745585fd5d", discriminator: !337)
!306 = !{!307, !333}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !305, file: !2, baseType: !308, size: 32, align: 32, extraData: i128 4294967295)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !303, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !12, templateParams: !309, identifier: "b3cf23aab6ca52939419a6442e877608")
!309 = !{!310}
!310 = !DITemplateTypeParameter(name: "T", type: !311)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnixStream", scope: !312, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !316, templateParams: !12, identifier: "ffbf177fc5cbadfabe049ab6e19715a5")
!312 = !DINamespace(name: "stream", scope: !313)
!313 = !DINamespace(name: "net", scope: !314)
!314 = !DINamespace(name: "unix", scope: !315)
!315 = !DINamespace(name: "os", scope: !244)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !311, file: !2, baseType: !318, size: 32, align: 32, flags: DIFlagProtected)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !319, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !322, templateParams: !12, identifier: "1951796691ba3fede456b44026433595")
!319 = !DINamespace(name: "net", scope: !320)
!320 = !DINamespace(name: "unix", scope: !321)
!321 = !DINamespace(name: "pal", scope: !251)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !318, file: !2, baseType: !324, size: 32, align: 32, flags: DIFlagPrivate)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileDesc", scope: !325, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !326, templateParams: !12, identifier: "766aac3a0e07fe27152a6686a9dfcdd0")
!325 = !DINamespace(name: "fd", scope: !320)
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !324, file: !2, baseType: !328, size: 32, align: 32, flags: DIFlagPrivate)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedFd", scope: !329, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !331, templateParams: !12, identifier: "66924ffd015b2a9919159be22d7979f7")
!329 = !DINamespace(name: "owned", scope: !330)
!330 = !DINamespace(name: "fd", scope: !315)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !328, file: !2, baseType: !71, size: 32, align: 32, flags: DIFlagPrivate)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !305, file: !2, baseType: !334, size: 32, align: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !303, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !335, templateParams: !309, identifier: "9a26fd7c6c67936bedbb57e8ac412a93")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !2, baseType: !311, size: 32, align: 32, flags: DIFlagPublic)
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !303, file: !2, baseType: !260, size: 32, align: 32, flags: DIFlagArtificial)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "<async_io::reactor::unix::Registration as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_io::reactor::unix::Registration as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !341, vtableHolder: !235, templateParams: !12, identifier: "c907cb9d0c78f149353b4c7d91866ff0")
!341 = !{!342, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !340, file: !2, baseType: !6, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !340, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !340, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !340, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "<&std::sync::mutex::Mutex<[async_io::reactor::Direction; 2]> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&std::sync::mutex::Mutex<[async_io::reactor::Direction; 2]> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !349, vtableHolder: !354, templateParams: !12, identifier: "636a30bec9d7ad7d70586733325cbada")
!349 = !{!350, !351, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !348, file: !2, baseType: !6, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !348, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !348, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !348, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<[async_io::reactor::Direction; 2]>", baseType: !241, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "<core::option::Option<(usize, usize)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<(usize, usize)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !358, vtableHolder: !117, templateParams: !12, identifier: "8efebf10a5cbcf378b480c37546a8aa0")
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !357, file: !2, baseType: !6, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !357, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "<core::option::Option<core::task::wake::Waker> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<core::task::wake::Waker> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !366, vtableHolder: !22, templateParams: !12, identifier: "66e5a02c4ada21ac5b67d55f3c6ca71")
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !365, file: !2, baseType: !6, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !365, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !365, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "<&slab::Slab<core::option::Option<core::task::wake::Waker>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&slab::Slab<core::option::Option<core::task::wake::Waker>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !374, vtableHolder: !379, templateParams: !12, identifier: "85e37e020c1a510147eda91de8ebbce1")
!374 = !{!375, !376, !377, !378}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !373, file: !2, baseType: !6, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !373, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !373, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&slab::Slab<core::option::Option<core::task::wake::Waker>>", baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "<&core::task::wake::Waker as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::task::wake::Waker as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !383, vtableHolder: !388, templateParams: !12, identifier: "2ed15e257a79e393286a96c218604bc")
!383 = !{!384, !385, !386, !387}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !382, file: !2, baseType: !6, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !382, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !382, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !382, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::Waker", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "<&std::os::unix::net::stream::UnixStream as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&std::os::unix::net::stream::UnixStream as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !392, vtableHolder: !397, templateParams: !12, identifier: "833afef181b68cd3dc8a4d47319ab961")
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !391, file: !2, baseType: !6, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !391, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !391, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !391, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::os::unix::net::stream::UnixStream", baseType: !311, size: 64, align: 64, dwarfAddressSpace: 0)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "<&(usize, usize) as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&(usize, usize) as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !401, vtableHolder: !406, templateParams: !12, identifier: "d4dff16899bbecf21ea1e4269a9a6d31")
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !400, file: !2, baseType: !6, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !400, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(usize, usize)", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "<&[async_io::reactor::Direction; 2] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[async_io::reactor::Direction; 2] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !410, vtableHolder: !415, templateParams: !12, identifier: "dffe6482a7c567257ddbb68991e1e161")
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !409, file: !2, baseType: !6, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !409, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !409, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[async_io::reactor::Direction; 2]", baseType: !281, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !418, isLocal: true, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !419, vtableHolder: !424, templateParams: !12, identifier: "f614f8b463743339f8d80bd2fd809446")
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !418, file: !2, baseType: !6, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !418, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !418, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !418, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !425, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !426, templateParams: !12, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!425 = !DINamespace(name: "fmt", scope: !24)
!426 = !{!427, !438, !488}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !424, file: !2, baseType: !428, size: 128, align: 64, flags: DIFlagPrivate)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !429, templateParams: !12, identifier: "4e66b00a376d6af5b8765440fb2839f")
!429 = !{!430, !437}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !428, file: !2, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64, dwarfAddressSpace: 0)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !433, templateParams: !12, identifier: "9277eecd40495f85161460476aacc992")
!433 = !{!434, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !432, file: !2, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !432, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !428, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !424, file: !2, baseType: !439, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !23, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !440, templateParams: !12, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!440 = !{!441}
!441 = !DICompositeType(tag: DW_TAG_variant_part, scope: !439, file: !2, size: 128, align: 64, elements: !442, templateParams: !12, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !487)
!442 = !{!443, !483}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !441, file: !2, baseType: !444, size: 128, align: 64, extraData: i128 0)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !439, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !445, identifier: "c062391546990b9ae716e587a9c44107")
!445 = !{!446}
!446 = !DITemplateTypeParameter(name: "T", type: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !448, templateParams: !12, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!448 = !{!449, !482}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !447, file: !2, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !452, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !453, templateParams: !12, identifier: "402846c0893391618e34a15e0598c24e")
!452 = !DINamespace(name: "rt", scope: !425)
!453 = !{!454, !455, !457, !464, !465, !481}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !451, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !451, file: !2, baseType: !456, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!456 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !451, file: !2, baseType: !458, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !452, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagEnumClass, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!461 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!462 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!463 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !2, baseType: !260, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !451, file: !2, baseType: !466, size: 128, align: 64, flags: DIFlagPublic)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !452, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !467, templateParams: !12, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!467 = !{!468}
!468 = !DICompositeType(tag: DW_TAG_variant_part, scope: !466, file: !2, size: 128, align: 64, elements: !469, templateParams: !12, identifier: "96fecae849037968fdad1729d3166571", discriminator: !480)
!469 = !{!470, !474, !478}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !468, file: !2, baseType: !471, size: 128, align: 64, extraData: i128 0)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !466, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !472, templateParams: !12, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !471, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !468, file: !2, baseType: !475, size: 128, align: 64, extraData: i128 1)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !466, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !476, templateParams: !12, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !475, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !468, file: !2, baseType: !479, size: 128, align: 64, extraData: i128 2)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !466, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, identifier: "844235131be8a6898de5150ba908049f")
!480 = !DIDerivedType(tag: DW_TAG_member, scope: !466, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagArtificial)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !451, file: !2, baseType: !466, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !447, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !441, file: !2, baseType: !484, size: 128, align: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !439, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !485, templateParams: !445, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !484, file: !2, baseType: !447, size: 128, align: 64, flags: DIFlagPublic)
!487 = !DIDerivedType(tag: DW_TAG_member, scope: !439, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagArtificial)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !424, file: !2, baseType: !489, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !490, templateParams: !12, identifier: "baf028fc654408299b6dd770f089fd48")
!490 = !{!491, !564}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !489, file: !2, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !452, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !494, templateParams: !12, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !493, file: !2, baseType: !496, size: 128, align: 64, flags: DIFlagPrivate)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !452, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !497, templateParams: !12, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!497 = !{!498}
!498 = !DICompositeType(tag: DW_TAG_variant_part, scope: !496, file: !2, size: 128, align: 64, elements: !499, templateParams: !12, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !563)
!499 = !{!500, !559}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !498, file: !2, baseType: !501, size: 128, align: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !496, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !502, templateParams: !12, identifier: "7c7df21330d573ca4eefe40395fd691")
!502 = !{!503, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !501, file: !2, baseType: !504, size: 64, align: 64, flags: DIFlagPrivate)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !506, file: !2, align: 8, elements: !12, identifier: "728a64207294457ae982b2390ae8a902")
!506 = !DINamespace(name: "{extern#0}", scope: !452)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !501, file: !2, baseType: !508, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !504, !529}
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !512, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !513, templateParams: !12, identifier: "d2df09569ea43718984b3f07c77d7786")
!512 = !DINamespace(name: "result", scope: !24)
!513 = !{!514}
!514 = !DICompositeType(tag: DW_TAG_variant_part, scope: !511, file: !2, size: 8, align: 8, elements: !515, templateParams: !12, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !528)
!515 = !{!516, !524}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !514, file: !2, baseType: !517, size: 8, align: 8, extraData: i128 0)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !511, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !518, templateParams: !520, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !517, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!520 = !{!521, !522}
!521 = !DITemplateTypeParameter(name: "T", type: !7)
!522 = !DITemplateTypeParameter(name: "E", type: !523)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !425, file: !2, align: 8, flags: DIFlagPublic, elements: !12, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !514, file: !2, baseType: !525, size: 8, align: 8, extraData: i128 1)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !511, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !526, templateParams: !520, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !525, file: !2, baseType: !523, align: 8, offset: 8, flags: DIFlagPublic)
!528 = !DIDerivedType(tag: DW_TAG_member, scope: !511, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagArtificial)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !530, size: 64, align: 64, dwarfAddressSpace: 0)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !425, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !531, templateParams: !12, identifier: "9d9578b0f9368582a2201563ca126cd4")
!531 = !{!532, !533, !534, !535, !547, !548}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !2, baseType: !260, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !530, file: !2, baseType: !456, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !530, file: !2, baseType: !458, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !530, file: !2, baseType: !536, size: 128, align: 64, flags: DIFlagPrivate)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !23, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !537, templateParams: !12, identifier: "3850c4a210aea148b16f79ec227c427")
!537 = !{!538}
!538 = !DICompositeType(tag: DW_TAG_variant_part, scope: !536, file: !2, size: 128, align: 64, elements: !539, templateParams: !12, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !546)
!539 = !{!540, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !538, file: !2, baseType: !541, size: 128, align: 64, extraData: i128 0)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !536, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !12, templateParams: !228, identifier: "10be3845cc366e59d680126f255dea8b")
!542 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !538, file: !2, baseType: !543, size: 128, align: 64, extraData: i128 1)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !536, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !544, templateParams: !228, identifier: "d166501012b6febc55685f1b3285acb8")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !543, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagArtificial)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !530, file: !2, baseType: !536, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !530, file: !2, baseType: !549, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !550, templateParams: !12, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!550 = !{!551, !554}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !549, file: !2, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64, dwarfAddressSpace: 0)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !12, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!554 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !549, file: !2, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !556, size: 64, align: 64, dwarfAddressSpace: 0)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 6, lowerBound: 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !498, file: !2, baseType: !560, size: 128, align: 64, extraData: i128 0)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !496, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !561, templateParams: !12, identifier: "fb37c399e04d1117cfdf49fc8e0ef2cd")
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !560, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !496, file: !2, baseType: !59, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !489, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !568, vtableHolder: !573, templateParams: !12, identifier: "cff74116dd1b0531eb9ac650399ff52a")
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !567, file: !2, baseType: !6, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !567, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !567, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !567, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!573 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "<async_signal::pipe::Notifier as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_signal::pipe::Notifier as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !577, vtableHolder: !582, templateParams: !12, identifier: "38f2e8c81657212253df8f10aa7f9548")
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !576, file: !2, baseType: !6, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !576, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !576, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !576, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notifier", scope: !583, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !584, templateParams: !12, identifier: "12975b00879a78dfa2b4ec52559cce8a")
!583 = !DINamespace(name: "pipe", scope: !70)
!584 = !{!585, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !582, file: !2, baseType: !586, size: 128, align: 64, flags: DIFlagPrivate)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Async<std::os::unix::net::stream::UnixStream>", scope: !113, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !587, templateParams: !309, identifier: "fcced34fd62357517ea0f99318b13dec")
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !586, file: !2, baseType: !208, size: 64, align: 64, flags: DIFlagPrivate)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !586, file: !2, baseType: !303, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !582, file: !2, baseType: !311, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "<async_signal::{impl#1}::fmt::RegisteredSignals as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_signal::{impl#1}::fmt::RegisteredSignals as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !594, vtableHolder: !599, templateParams: !12, identifier: "98e189ce770a0df516bf27c27ee22f83")
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !593, file: !2, baseType: !6, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !593, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !593, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !593, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "RegisteredSignals", scope: !600, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !602, templateParams: !12, identifier: "3b10cacd56574336e240e493b352a447")
!600 = !DINamespace(name: "fmt", scope: !601)
!601 = !DINamespace(name: "{impl#1}", scope: !70)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !599, file: !2, baseType: !604, size: 64, align: 64, flags: DIFlagProtected)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::collections::hash::map::HashMap<async_signal::Signal, signal_hook_registry::SigId, std::hash::random::RandomState>", baseType: !605, size: 64, align: 64, dwarfAddressSpace: 0)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<async_signal::Signal, signal_hook_registry::SigId, std::hash::random::RandomState>", scope: !606, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !609, templateParams: !660, identifier: "d31c2cdf3038830947a83fa2293aa02e")
!606 = !DINamespace(name: "map", scope: !607)
!607 = !DINamespace(name: "hash", scope: !608)
!608 = !DINamespace(name: "collections", scope: !244)
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !605, file: !2, baseType: !611, size: 384, align: 64, flags: DIFlagPrivate)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<async_signal::Signal, signal_hook_registry::SigId, std::hash::random::RandomState, alloc::alloc::Global>", scope: !612, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !614, templateParams: !656, identifier: "8826cdd1fb838a05a4ef9f386d0abd2")
!612 = !DINamespace(name: "map", scope: !613)
!613 = !DINamespace(name: "hashbrown", scope: null)
!614 = !{!615, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !611, file: !2, baseType: !616, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !617, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !619, templateParams: !12, identifier: "3de5c15f3baf62b2f84c9b0bb0c2fdd")
!617 = !DINamespace(name: "random", scope: !618)
!618 = !DINamespace(name: "hash", scope: !244)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !616, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagPrivate)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !616, file: !2, baseType: !59, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !611, file: !2, baseType: !623, size: 256, align: 64, flags: DIFlagProtected)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(async_signal::Signal, signal_hook_registry::SigId), alloc::alloc::Global>", scope: !624, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !625, templateParams: !655, identifier: "488dff6f0d162a07126d34fad40c48bf")
!624 = !DINamespace(name: "raw", scope: !613)
!625 = !{!626, !637, !638}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !623, file: !2, baseType: !627, size: 256, align: 64, flags: DIFlagPrivate)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTableInner", scope: !624, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !628, templateParams: !12, identifier: "3e56e1ccbdf318246ae2e5a04f9c862c")
!628 = !{!629, !630, !635, !636}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !627, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !627, file: !2, baseType: !631, size: 64, align: 64, flags: DIFlagPrivate)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !155, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !632, templateParams: !275, identifier: "a4acf166b74ef43af1db8d6335ca167e")
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !631, file: !2, baseType: !634, size: 64, align: 64, flags: DIFlagPrivate)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !627, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !627, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !623, file: !2, baseType: !184, align: 8, offset: 256, flags: DIFlagPrivate)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !623, file: !2, baseType: !639, align: 8, offset: 256, flags: DIFlagPrivate)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(async_signal::Signal, signal_hook_registry::SigId)>", scope: !178, file: !2, align: 8, flags: DIFlagPublic, elements: !12, templateParams: !640, identifier: "15d15ca43ab8d3492b3ed5a4336bc995")
!640 = !{!641}
!641 = !DITemplateTypeParameter(name: "T", type: !642)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "(async_signal::Signal, signal_hook_registry::SigId)", file: !2, size: 384, align: 128, elements: !643, templateParams: !12, identifier: "3396cf764e5101defeade67dd76fd65")
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !642, file: !2, baseType: !69, size: 32, align: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !642, file: !2, baseType: !646, size: 256, align: 128, offset: 128)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "SigId", scope: !647, file: !2, size: 256, align: 128, flags: DIFlagPublic, elements: !648, templateParams: !12, identifier: "1377d686d9997b90d2a8a576caa195e0")
!647 = !DINamespace(name: "signal_hook_registry", scope: null)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !646, file: !2, baseType: !71, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !646, file: !2, baseType: !651, size: 128, align: 128, flags: DIFlagPrivate)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActionId", scope: !647, file: !2, size: 128, align: 128, flags: DIFlagPrivate, elements: !652, templateParams: !12, identifier: "68b417b1e02df7fdd037a8fa6fa2ecba")
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !651, file: !2, baseType: !654, size: 128, align: 128, flags: DIFlagPrivate)
!654 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!655 = !{!641, !187}
!656 = !{!657, !658, !659, !187}
!657 = !DITemplateTypeParameter(name: "K", type: !69)
!658 = !DITemplateTypeParameter(name: "V", type: !646)
!659 = !DITemplateTypeParameter(name: "S", type: !616)
!660 = !{!657, !658, !659}
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "<async_io::Async<std::os::unix::net::stream::UnixStream> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "<async_io::Async<std::os::unix::net::stream::UnixStream> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !664, vtableHolder: !586, templateParams: !12, identifier: "c36293be5803a2de56a2fcf3841012b")
!664 = !{!665, !666, !667, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !663, file: !2, baseType: !6, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !663, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !663, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !663, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!669 = !{i32 8, !"PIC Level", i32 2}
!670 = !{i32 2, !"RtLibUseGOT", i32 1}
!671 = !{i32 2, !"Dwarf Version", i32 4}
!672 = !{i32 2, !"Debug Info Version", i32 3}
!673 = !{!"rustc version 1.80.0-dev"}
!674 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !675, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !676, globals: !807, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-signal-0.2.5/src/lib.rs/@/async_signal.202203b544e74697-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-signal-0.2.5")
!676 = !{!69, !677, !458, !722, !729, !796, !801}
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !678, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagEnumClass, elements: !680)
!678 = !DINamespace(name: "error", scope: !679)
!679 = !DINamespace(name: "io", scope: !244)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!681 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!682 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!683 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!684 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!685 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!686 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!687 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!688 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!689 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!690 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!691 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!692 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!693 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!694 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!695 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!696 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!697 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!698 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!699 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!700 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!701 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!702 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!703 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!704 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!705 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!706 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!707 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!708 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!709 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!710 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!711 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!712 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!713 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!714 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!715 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!716 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!717 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!718 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!719 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!720 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!721 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !220, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagEnumClass, elements: !723)
!723 = !{!724, !725, !726, !727, !728}
!724 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!725 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!726 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!727 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!728 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !730, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagEnumClass, elements: !731)
!730 = !DINamespace(name: "alignment", scope: !151)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!732 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!733 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!734 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!735 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!736 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!737 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!738 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!739 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!740 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!741 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!742 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!743 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!744 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!745 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!746 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!747 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!748 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!749 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!750 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!751 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!752 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!753 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!754 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!755 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!756 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!757 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!758 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!759 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!760 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!761 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!762 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!763 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!764 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!765 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!766 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!767 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!768 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!769 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!770 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!771 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!772 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!773 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!774 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!775 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!776 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!777 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!778 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!779 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!780 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!781 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!782 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!783 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!784 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!785 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!786 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!787 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!788 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!789 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!790 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!791 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!792 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!793 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!794 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!795 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !797, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagEnumClass, elements: !798)
!797 = !DINamespace(name: "ffi", scope: !24)
!798 = !{!799, !800}
!799 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!800 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !802, file: !2, baseType: !274, size: 8, align: 8, flags: DIFlagEnumClass, elements: !803)
!802 = !DINamespace(name: "panicking", scope: !24)
!803 = !{!804, !805, !806}
!804 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!805 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!806 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!807 = !{!0, !13, !60, !102, !191, !200, !294, !338, !346, !355, !363, !371, !380, !389, !398, !407, !416, !565, !574, !591, !661}
!808 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h40eba7a03f944241E", scope: !810, file: !809, line: 2385, type: !811, scopeLine: 2385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !12, retainedNodes: !814)
!809 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!810 = !DINamespace(name: "{impl#12}", scope: !425)
!811 = !DISubroutineType(types: !812)
!812 = !{!511, !813, !529}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !573, size: 64, align: 64, dwarfAddressSpace: 0)
!814 = !{!815, !816}
!815 = !DILocalVariable(name: "self", arg: 1, scope: !808, file: !809, line: 2385, type: !813)
!816 = !DILocalVariable(name: "f", arg: 2, scope: !808, file: !809, line: 2385, type: !529)
!817 = !DILocation(line: 0, scope: !808)
!818 = !DILocation(line: 2386, column: 9, scope: !808)
!819 = !DILocation(line: 2387, column: 6, scope: !808)
!820 = distinct !DISubprogram(name: "fmt<std::os::unix::net::stream::UnixStream>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h03be6afb8fe5fbacE", scope: !821, file: !809, line: 2354, type: !822, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !309, retainedNodes: !825)
!821 = !DINamespace(name: "{impl#51}", scope: !425)
!822 = !DISubroutineType(types: !823)
!823 = !{!511, !824, !529}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&std::os::unix::net::stream::UnixStream", baseType: !397, size: 64, align: 64, dwarfAddressSpace: 0)
!825 = !{!826, !827}
!826 = !DILocalVariable(name: "self", arg: 1, scope: !820, file: !809, line: 2354, type: !824)
!827 = !DILocalVariable(name: "f", arg: 2, scope: !820, file: !809, line: 2354, type: !529)
!828 = !DILocation(line: 0, scope: !820)
!829 = !DILocation(line: 2354, column: 71, scope: !820)
!830 = !{i64 4}
!831 = !DILocation(line: 2354, column: 62, scope: !820)
!832 = !DILocation(line: 2354, column: 84, scope: !820)
!833 = distinct !DISubprogram(name: "fmt<async_signal::Signal>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h146d1ce221f8b843E", scope: !821, file: !809, line: 2354, type: !834, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !840, retainedNodes: !837)
!834 = !DISubroutineType(types: !835)
!835 = !{!511, !836, !529}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&async_signal::Signal", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!837 = !{!838, !839}
!838 = !DILocalVariable(name: "self", arg: 1, scope: !833, file: !809, line: 2354, type: !836)
!839 = !DILocalVariable(name: "f", arg: 2, scope: !833, file: !809, line: 2354, type: !529)
!840 = !{!841}
!841 = !DITemplateTypeParameter(name: "T", type: !69)
!842 = !DILocation(line: 0, scope: !833)
!843 = !DILocation(line: 2354, column: 71, scope: !833)
!844 = !DILocation(line: 2354, column: 62, scope: !833)
!845 = !{i32 1, i32 32}
!846 = !DILocalVariable(name: "self", arg: 1, scope: !847, file: !848, line: 152, type: !68)
!847 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN57_$LT$async_signal..Signal$u20$as$u20$core..fmt..Debug$GT$3fmt17h6c9f4e1d07cc8f77E", scope: !849, file: !848, line: 152, type: !850, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !12, retainedNodes: !852)
!848 = !DIFile(filename: "src/lib.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-signal-0.2.5", checksumkind: CSK_MD5, checksum: "710b892dc249acaea8343d681499344c")
!849 = !DINamespace(name: "{impl#11}", scope: !70)
!850 = !DISubroutineType(types: !851)
!851 = !{!511, !68, !529}
!852 = !{!846, !853}
!853 = !DILocalVariable(name: "f", arg: 2, scope: !847, file: !848, line: 152, type: !529)
!854 = !DILocation(line: 0, scope: !847, inlinedAt: !855)
!855 = distinct !DILocation(line: 2354, column: 62, scope: !833)
!856 = !DILocation(line: 152, column: 31, scope: !847, inlinedAt: !855)
!857 = !DILocation(line: 2354, column: 84, scope: !833)
!858 = distinct !DISubprogram(name: "fmt<async_io::reactor::Direction>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h1d69a82588c79890E", scope: !821, file: !809, line: 2354, type: !859, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !865, retainedNodes: !862)
!859 = !DISubroutineType(types: !860)
!860 = !{!511, !861, !529}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&async_io::reactor::Direction", baseType: !110, size: 64, align: 64, dwarfAddressSpace: 0)
!862 = !{!863, !864}
!863 = !DILocalVariable(name: "self", arg: 1, scope: !858, file: !809, line: 2354, type: !861)
!864 = !DILocalVariable(name: "f", arg: 2, scope: !858, file: !809, line: 2354, type: !529)
!865 = !{!866}
!866 = !DITemplateTypeParameter(name: "T", type: !111)
!867 = !DILocation(line: 0, scope: !858)
!868 = !DILocation(line: 2354, column: 71, scope: !858)
!869 = !{i64 8}
!870 = !DILocalVariable(name: "self", arg: 1, scope: !871, file: !872, line: 389, type: !110)
!871 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN65_$LT$async_io..reactor..Direction$u20$as$u20$core..fmt..Debug$GT$3fmt17hcb4a5e1f9fb38158E", scope: !873, file: !872, line: 389, type: !874, scopeLine: 389, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !12, retainedNodes: !876)
!872 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/async-io-2.2.2/src/reactor.rs", directory: "", checksumkind: CSK_MD5, checksum: "02b3eaf400f2716ea1e8d931cda81a3c")
!873 = !DINamespace(name: "{impl#16}", scope: !112)
!874 = !DISubroutineType(types: !875)
!875 = !{!511, !110, !529}
!876 = !{!870, !877}
!877 = !DILocalVariable(name: "f", arg: 2, scope: !871, file: !872, line: 389, type: !529)
!878 = !DILocation(line: 0, scope: !871, inlinedAt: !879)
!879 = distinct !DILocation(line: 2354, column: 62, scope: !858)
!880 = !DILocation(line: 392, column: 5, scope: !871, inlinedAt: !879)
!881 = !DILocation(line: 398, column: 5, scope: !871, inlinedAt: !879)
!882 = !DILocation(line: 403, column: 5, scope: !871, inlinedAt: !879)
!883 = !{!884, !886}
!884 = distinct !{!884, !885, !"_ZN65_$LT$async_io..reactor..Direction$u20$as$u20$core..fmt..Debug$GT$3fmt17hcb4a5e1f9fb38158E: %self"}
!885 = distinct !{!885, !"_ZN65_$LT$async_io..reactor..Direction$u20$as$u20$core..fmt..Debug$GT$3fmt17hcb4a5e1f9fb38158E"}
!886 = distinct !{!886, !885, !"_ZN65_$LT$async_io..reactor..Direction$u20$as$u20$core..fmt..Debug$GT$3fmt17hcb4a5e1f9fb38158E: %f"}
!887 = !DILocation(line: 389, column: 10, scope: !871, inlinedAt: !879)
!888 = !DILocation(line: 389, column: 14, scope: !871, inlinedAt: !879)
!889 = !DILocation(line: 2354, column: 84, scope: !858)
!890 = distinct !DISubprogram(name: "fmt<std::sync::mutex::Mutex<[async_io::reactor::Direction; 2]>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h4d82bc6f144d1fbfE", scope: !821, file: !809, line: 2354, type: !891, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !897, retainedNodes: !894)
!891 = !DISubroutineType(types: !892)
!892 = !{!511, !893, !529}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&std::sync::mutex::Mutex<[async_io::reactor::Direction; 2]>", baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!894 = !{!895, !896}
!895 = !DILocalVariable(name: "self", arg: 1, scope: !890, file: !809, line: 2354, type: !893)
!896 = !DILocalVariable(name: "f", arg: 2, scope: !890, file: !809, line: 2354, type: !529)
!897 = !{!898}
!898 = !DITemplateTypeParameter(name: "T", type: !241)
!899 = !DILocation(line: 0, scope: !890)
!900 = !DILocation(line: 2354, column: 71, scope: !890)
!901 = !DILocalVariable(name: "err", scope: !902, file: !903, line: 511, type: !928, align: 8)
!902 = distinct !DILexicalBlock(scope: !904, file: !903, line: 511, column: 13)
!903 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sync/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "59c3c45bbe13b393286ad3c4249f4f26")
!904 = distinct !DILexicalBlock(scope: !905, file: !903, line: 506, column: 9)
!905 = distinct !DISubprogram(name: "fmt<[async_io::reactor::Direction; 2]>", linkageName: "_ZN69_$LT$std..sync..mutex..Mutex$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17h68c821938d1b85bbE", scope: !906, file: !903, line: 505, type: !907, scopeLine: 505, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !674, templateParams: !284, retainedNodes: !909)
!906 = !DINamespace(name: "{impl#10}", scope: !242)
!907 = !DISubroutineType(types: !908)
!908 = !{!511, !354, !529}
!909 = !{!910, !911, !912, !919, !901}
!910 = !DILocalVariable(name: "self", arg: 1, scope: !905, file: !903, line: 505, type: !354)
!911 = !DILocalVariable(name: "f", arg: 2, scope: !905, file: !903, line: 505, type: !529)
!912 = !DILocalVariable(name: "d", scope: !904, file: !903, line: 506, type: !913, align: 8)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugStruct", scope: !914, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !915, templateParams: !12, identifier: "56e47a374f1450843695d3c27d8f38a9")
!914 = !DINamespace(name: "builders", scope: !425)
!915 = !{!916, !917, !918}
