; ModuleID = 'blocking.2db90af22f9c2020-cgu.0'
source_filename = "blocking.2db90af22f9c2020-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::option::Option<&dyn tracing_core::field::Value>" = type { ptr, [1 x i64] }

@_ZN12tracing_core8metadata9MAX_LEVEL17h2def28f3c9fb9790E = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"
@alloc_8d68fcbc011419193bd208f22e2789d1 = private unnamed_addr constant <{ [28 x i8] }> <{ [28 x i8] c"failed to write whole buffer" }>, align 1
@alloc_626cc8bfd6c94d404aa777557e31db63 = private unnamed_addr constant <{ ptr, [9 x i8], [7 x i8] }> <{ ptr @alloc_8d68fcbc011419193bd208f22e2789d1, [9 x i8] c"\1C\00\00\00\00\00\00\00\17", [7 x i8] undef }>, align 8
@alloc_2316e63258fe9d5bdff37bf003386e61 = private unnamed_addr constant <{ [78 x i8] }> <{ [78 x i8] c"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/io/mod.rs" }>, align 1
@alloc_d9fb3a4fb251add6517075192273824f = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_2316e63258fe9d5bdff37bf003386e61, [16 x i8] c"N\00\00\00\00\00\00\00\A9\06\00\00$\00\00\00" }>, align 8
@alloc_a439077caaee6bab9af745f1531d72a4 = private unnamed_addr constant <{ [86 x i8] }> <{ [86 x i8] c"a formatting trait implementation returned an error when the underlying stream did not" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !29, identifier: "3b9dc1cd24e5f6261916f3a71a8e93ed")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::pal::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !19, templateParams: !162, identifier: "5cc60cf3bc5ca3351bc45c96fb2576d0")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64, flags: DIFlagProtected)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::pal::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !29, identifier: "93c379795faa0383c896fabe3f393c")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "pal", scope: !26)
!26 = !DINamespace(name: "sys", scope: !18)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !31, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !32, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "f6fab78402c7921c81b48f94ff59f12a")
!32 = !DINamespace(name: "result", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !31, file: !2, size: 64, align: 64, elements: !36, templateParams: !29, identifier: "f20382f78447208541d43a2eb7c7b177", discriminator: !160)
!36 = !{!37, !156}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !35, file: !2, baseType: !38, size: 64, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !39, templateParams: !41, identifier: "7fff08edb161cdb6f65adbe333abb587")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!41 = !{!42, !43}
!42 = !DITemplateTypeParameter(name: "T", type: !7)
!43 = !DITemplateTypeParameter(name: "E", type: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !29, identifier: "9481a9f9dd3a514fccbd1ee45fe835c0")
!45 = !DINamespace(name: "error", scope: !17)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !44, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !50, templateParams: !29, identifier: "d19e764dc7d400364cac938e600e6e8e")
!49 = !DINamespace(name: "repr_bitpacked", scope: !45)
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !48, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagPrivate)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !57, identifier: "219b4814660fc803ec7ad9770695a")
!53 = !DINamespace(name: "non_null", scope: !54)
!54 = !DINamespace(name: "ptr", scope: !33)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !{!42}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !48, file: !2, baseType: !59, align: 8, offset: 64, flags: DIFlagPrivate)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !61, identifier: "b3a9535088463228dd721e3df15a74b4")
!60 = !DINamespace(name: "marker", scope: !33)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "T", type: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !64, templateParams: !29, identifier: "2d842b368858db53e5e95cb68f18ba4d")
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 128, align: 64, elements: !66, templateParams: !29, identifier: "7b170337c204a193ef1904d1caedcc36", discriminator: !155)
!66 = !{!67, !133, !137, !151}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !65, file: !2, baseType: !68, size: 128, align: 64, extraData: i128 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !69, templateParams: !72, identifier: "ec7ef559ca1c1873dcb949d9353e83c4")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !71, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!71 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "C", type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !76, templateParams: !29, identifier: "4a83a1c02e32f7677e925d15cbf9f223")
!76 = !{!77, !122}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !75, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !45, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !80)
!79 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!81 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !75, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPrivate)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !124, templateParams: !29, identifier: "fc4c978384b58c14d0c3b28c9444e0a6")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !2, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !29, identifier: "af492d0fde630cae993a48fd15ada2c5")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !123, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 10, lowerBound: 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !65, file: !2, baseType: !134, size: 128, align: 64, extraData: i128 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !135, templateParams: !72, identifier: "c722108768e442de944796846599cf6a")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !78, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !65, file: !2, baseType: !138, size: 128, align: 64, extraData: i128 2)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !139, templateParams: !72, identifier: "a889002bec16644f89535583317530e7")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !143, templateParams: !29, identifier: "1cc23320a6f881d629e59649fa6dee8b")
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !142, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !142, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !147, templateParams: !29, identifier: "9277eecd40495f85161460476aacc992")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !2, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !65, file: !2, baseType: !152, size: 128, align: 64, extraData: i128 3)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !153, templateParams: !72, identifier: "6be90b54a330d2fbea2d9f76e0bfb292")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !152, file: !2, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !35, file: !2, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !158, templateParams: !41, identifier: "a184e6321da6a5ec587e5ea90c206f8c")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !31, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!161 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !22)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#2}<blocking::{impl#0}::grow_pool::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable}", scope: null, file: !2, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#2}<blocking::{impl#0}::grow_pool::{closure_env#0}, ()> as core::ops::function::FnOnce<()>>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !167, vtableHolder: !172, templateParams: !29, identifier: "546fc45ccaa853a3871f2015f023ae3")
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !166, file: !2, baseType: !6, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#2}<blocking::{impl#0}::grow_pool::{closure_env#0}, ()>", scope: !173, file: !2, size: 256, align: 64, elements: !176, templateParams: !29, identifier: "8ba487977465baf2123d01c0a2c0fddc")
!173 = !DINamespace(name: "spawn_unchecked_", scope: !174)
!174 = !DINamespace(name: "{impl#0}", scope: !175)
!175 = !DINamespace(name: "thread", scope: !18)
!176 = !{!177, !279, !368, !459}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "their_thread", scope: !172, file: !2, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !175, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !179, templateParams: !29, identifier: "da020854dd8ea7daeead21e2c69d69b5")
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !178, file: !2, baseType: !181, size: 64, align: 64, flags: DIFlagPrivate)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::Inner, alloc::alloc::Global>>", scope: !182, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !183, templateParams: !277, identifier: "e850415cf6381bb8c8b90ae8e0a029dc")
!182 = !DINamespace(name: "pin", scope: !33)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pointer", scope: !181, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagPublic)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner, alloc::alloc::Global>", scope: !186, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !188, templateParams: !275, identifier: "fa5ee1058f86b360c6c2632d7d762122")
!186 = !DINamespace(name: "sync", scope: !187)
!187 = !DINamespace(name: "alloc", scope: null)
!188 = !{!189, !270, !272}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !185, file: !2, baseType: !190, size: 64, align: 64, flags: DIFlagPrivate)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !191, templateParams: !268, identifier: "44fff7789d116067d476ca52181deb78")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !190, file: !2, baseType: !193, size: 64, align: 64, flags: DIFlagPrivate)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !186, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !195, templateParams: !266, identifier: "201984a528076f0ec8ccc060637c4041")
!195 = !{!196, !208, !209}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !194, file: !2, baseType: !197, size: 64, align: 64, flags: DIFlagPrivate)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !198, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !200, templateParams: !29, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!198 = !DINamespace(name: "atomic", scope: !199)
!199 = !DINamespace(name: "sync", scope: !33)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !197, file: !2, baseType: !202, size: 64, align: 64, flags: DIFlagPrivate)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !203, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !204, templateParams: !206, identifier: "739795389d327d6873469e3d89b8c60e")
!203 = !DINamespace(name: "cell", scope: !33)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !202, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!206 = !{!207}
!207 = !DITemplateTypeParameter(name: "T", type: !9)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !194, file: !2, baseType: !197, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !2, baseType: !210, size: 320, align: 64, offset: 128, flags: DIFlagPrivate)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !175, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !211, templateParams: !29, identifier: "9e0a9741f6fa2ccfcba73ef38873d1cf")
!211 = !{!212, !235, !250}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !2, baseType: !213, size: 192, align: 64, flags: DIFlagPrivate)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadName", scope: !175, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !214, templateParams: !29, identifier: "c3872e726cfd6d333d72ad3bbd134247")
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_variant_part, scope: !213, file: !2, size: 192, align: 64, elements: !216, templateParams: !29, identifier: "b0281fd09be56052530680f2492a10d5", discriminator: !234)
!216 = !{!217, !219, !232}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Main", scope: !215, file: !2, baseType: !218, size: 192, align: 64, extraData: i128 0)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Main", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, identifier: "a9db681dc6c362b459abcecd7567395")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Other", scope: !215, file: !2, baseType: !220, size: 192, align: 64, extraData: i128 1)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "Other", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !221, templateParams: !29, identifier: "6b24980ce5f57ca1959a166fdba6d879")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !220, file: !2, baseType: !223, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !224, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !226, templateParams: !29, identifier: "c4dc8be4010768a0af6d73bbbf55d297")
!224 = !DINamespace(name: "c_str", scope: !225)
!225 = !DINamespace(name: "ffi", scope: !187)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !223, file: !2, baseType: !228, size: 128, align: 64, flags: DIFlagPrivate)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !229, templateParams: !29, identifier: "8330ffeee5616422e87b117256cb85e0")
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !228, file: !2, baseType: !149, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !228, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Unnamed", scope: !215, file: !2, baseType: !233, size: 192, align: 64, extraData: i128 2)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unnamed", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, identifier: "2fdc5c3b09ff6d5c6b590d5ff3906408")
!234 = !DIDerivedType(tag: DW_TAG_member, scope: !213, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !2, baseType: !236, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !175, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !237, templateParams: !29, identifier: "ce0292bcf6d863a36c034d77773e7341")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !236, file: !2, baseType: !239, size: 64, align: 64, flags: DIFlagPrivate)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<u64>", scope: !240, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !242, templateParams: !248, identifier: "865ca377f9884d17eb6d1de2ac2b0ca4")
!240 = !DINamespace(name: "nonzero", scope: !241)
!241 = !DINamespace(name: "num", scope: !33)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !239, file: !2, baseType: !244, size: 64, align: 64, flags: DIFlagPrivate)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64Inner", scope: !245, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !246, templateParams: !29, identifier: "83ed7247d11b03e3fd807680270ea392")
!245 = !DINamespace(name: "private", scope: !240)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !244, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagPrivate)
!248 = !{!249}
!249 = !DITemplateTypeParameter(name: "T", type: !161)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !210, file: !2, baseType: !251, size: 32, align: 32, offset: 256, flags: DIFlagPrivate)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !252, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !255, templateParams: !29, identifier: "392acbf83fc4ca99fbbca9b8c8a91eca")
!252 = !DINamespace(name: "futex", scope: !253)
!253 = !DINamespace(name: "thread_parking", scope: !254)
!254 = !DINamespace(name: "sync", scope: !26)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !251, file: !2, baseType: !257, size: 32, align: 32, flags: DIFlagPrivate)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !258, templateParams: !29, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !257, file: !2, baseType: !260, size: 32, align: 32, flags: DIFlagPrivate)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !203, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !261, templateParams: !264, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !2, baseType: !263, size: 32, align: 32, flags: DIFlagPrivate)
!263 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!264 = !{!265}
!265 = !DITemplateTypeParameter(name: "T", type: !263)
!266 = !{!267}
!267 = !DITemplateTypeParameter(name: "T", type: !210)
!268 = !{!269}
!269 = !DITemplateTypeParameter(name: "T", type: !194)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !185, file: !2, baseType: !271, align: 8, offset: 64, flags: DIFlagPrivate)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !268, identifier: "dc027c3dc64cb48394190ba124e686")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !185, file: !2, baseType: !273, align: 8, offset: 64, flags: DIFlagPrivate)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !274, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "14de19725ec4b1fd38fae074afd4da08")
!274 = !DINamespace(name: "alloc", scope: !187)
!275 = !{!267, !276}
!276 = !DITemplateTypeParameter(name: "A", type: !273)
!277 = !{!278}
!278 = !DITemplateTypeParameter(name: "Ptr", type: !185)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "output_capture", scope: !172, file: !2, baseType: !280, size: 64, align: 64, offset: 128)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>, alloc::alloc::Global>>", scope: !281, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !282, templateParams: !29, identifier: "353607d119aacc4b8050fcc3e9ecbe16")
!281 = !DINamespace(name: "option", scope: !33)
!282 = !{!283}
!283 = !DICompositeType(tag: DW_TAG_variant_part, scope: !280, file: !2, size: 64, align: 64, elements: !284, templateParams: !29, identifier: "821fdbb89c3281969bac0cc5f570175e", discriminator: !367)
!284 = !{!285, !363}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !283, file: !2, baseType: !286, size: 64, align: 64, extraData: i128 0)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !280, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !287, identifier: "e31005e0ae5c899b1dd572ca49362600")
!287 = !{!288}
!288 = !DITemplateTypeParameter(name: "T", type: !289)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>, alloc::alloc::Global>", scope: !186, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !290, templateParams: !362, identifier: "d368347c492c191566d06226d7ad9970")
!290 = !{!291, !359, !361}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !289, file: !2, baseType: !292, size: 64, align: 64, flags: DIFlagPrivate)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !293, templateParams: !357, identifier: "1816aa34acf57685fc54469d8fc648ba")
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !292, file: !2, baseType: !295, size: 64, align: 64, flags: DIFlagPrivate)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !296, size: 64, align: 64, dwarfAddressSpace: 0)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !186, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !297, templateParams: !355, identifier: "e5dd7bf3cae52bf5dc6a4bf2186caa62")
!297 = !{!298, !299, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !296, file: !2, baseType: !197, size: 64, align: 64, flags: DIFlagPrivate)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !296, file: !2, baseType: !197, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !2, baseType: !301, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !302, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !304, templateParams: !353, identifier: "9dda1b91e7642ca95c5fe7789cc35c6")
!302 = !DINamespace(name: "mutex", scope: !303)
!303 = !DINamespace(name: "sync", scope: !18)
!304 = !{!305, !311, !324}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !301, file: !2, baseType: !306, size: 32, align: 32, flags: DIFlagPrivate)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !307, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !309, templateParams: !29, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!307 = !DINamespace(name: "futex", scope: !308)
!308 = !DINamespace(name: "mutex", scope: !254)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !306, file: !2, baseType: !257, size: 32, align: 32, flags: DIFlagPrivate)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !301, file: !2, baseType: !312, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !313, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !314, templateParams: !29, identifier: "f02169750979dbd37c1ab4c868f04f71")
!313 = !DINamespace(name: "poison", scope: !303)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !312, file: !2, baseType: !316, size: 8, align: 8, flags: DIFlagPrivate)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !198, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !317, templateParams: !29, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !316, file: !2, baseType: !319, size: 8, align: 8, flags: DIFlagPrivate)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !203, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !320, templateParams: !322, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !319, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagPrivate)
!322 = !{!323}
!323 = !DITemplateTypeParameter(name: "T", type: !79)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !2, baseType: !325, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !203, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !326, templateParams: !353, identifier: "70258c3eedc01a708fda133ce9a9a03a")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !2, baseType: !328, size: 192, align: 64, flags: DIFlagPrivate)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !329, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !330, templateParams: !351, identifier: "5eeffe5c8759a91ecea2395996ca4803")
!329 = !DINamespace(name: "vec", scope: !187)
!330 = !{!331, !352}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !328, file: !2, baseType: !332, size: 128, align: 64, flags: DIFlagPrivate)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !333, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !334, templateParams: !351, identifier: "e3a1c33ec7c5ab794d7cc23cda5d1ffd")
!333 = !DINamespace(name: "raw_vec", scope: !187)
!334 = !{!335, !346, !350}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !332, file: !2, baseType: !336, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !337, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !338, templateParams: !322, identifier: "5576e714cda244bc7fd48da241c2cd71")
!337 = !DINamespace(name: "unique", scope: !54)
!338 = !{!339, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !336, file: !2, baseType: !340, size: 64, align: 64, flags: DIFlagPrivate)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !341, templateParams: !322, identifier: "a4acf166b74ef43af1db8d6335ca167e")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !340, file: !2, baseType: !343, size: 64, align: 64, flags: DIFlagPrivate)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !336, file: !2, baseType: !345, align: 8, offset: 64, flags: DIFlagPrivate)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !322, identifier: "1bed48daca504789908cb96b32f89e65")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !332, file: !2, baseType: !347, size: 64, align: 64, flags: DIFlagPrivate)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !333, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !348, templateParams: !29, identifier: "62de598dd28eaf1c7c0f61ca013e23b")
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !347, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !332, file: !2, baseType: !273, align: 8, offset: 128, flags: DIFlagPrivate)
!351 = !{!323, !276}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !328, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!353 = !{!354}
!354 = !DITemplateTypeParameter(name: "T", type: !328)
!355 = !{!356}
!356 = !DITemplateTypeParameter(name: "T", type: !301)
!357 = !{!358}
!358 = !DITemplateTypeParameter(name: "T", type: !296)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !289, file: !2, baseType: !360, align: 8, offset: 64, flags: DIFlagPrivate)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !357, identifier: "4cbe26118651079999eb3cd0f2e2f3bb")
!361 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !289, file: !2, baseType: !273, align: 8, offset: 64, flags: DIFlagPrivate)
!362 = !{!356, !276}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !283, file: !2, baseType: !364, size: 64, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !280, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !365, templateParams: !287, identifier: "5ff77775231d79f59eb2d9eb7de764bf")
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !364, file: !2, baseType: !289, size: 64, align: 64, flags: DIFlagPublic)
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !280, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !172, file: !2, baseType: !369, size: 64, align: 64, offset: 192)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaybeDangling<blocking::{impl#0}::grow_pool::{closure_env#0}>", scope: !173, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !370, templateParams: !457, identifier: "c365f2796a19463ff4b6231551519c9a")
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !369, file: !2, baseType: !372, size: 64, align: 64, flags: DIFlagProtected)
!372 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<blocking::{impl#0}::grow_pool::{closure_env#0}>", scope: !373, file: !2, size: 64, align: 64, elements: !375, templateParams: !457, identifier: "392b9868c217f48da5eb26a6f4984e9")
!373 = !DINamespace(name: "maybe_uninit", scope: !374)
!374 = !DINamespace(name: "mem", scope: !33)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !372, file: !2, baseType: !7, align: 8)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !372, file: !2, baseType: !378, size: 64, align: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<blocking::{impl#0}::grow_pool::{closure_env#0}>", scope: !379, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !380, templateParams: !457, identifier: "57e9bdae637880b59b76b0be10d8e5ab")
!379 = !DINamespace(name: "manually_drop", scope: !374)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !378, file: !2, baseType: !382, size: 64, align: 64, flags: DIFlagPrivate)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !383, file: !2, size: 64, align: 64, elements: !386, templateParams: !29, identifier: "c1a494ea4b0f48968d922beaacfac77e")
!383 = !DINamespace(name: "grow_pool", scope: !384)
!384 = !DINamespace(name: "{impl#0}", scope: !385)
!385 = !DINamespace(name: "blocking", scope: null)
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !382, file: !2, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&blocking::Executor", baseType: !389, size: 64, align: 64, dwarfAddressSpace: 0)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "Executor", scope: !385, file: !2, size: 576, align: 64, flags: DIFlagPrivate, elements: !390, templateParams: !29, identifier: "114630adea5c09f0c3cff3a6eac1c49e")
!390 = !{!391, !447}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !389, file: !2, baseType: !392, size: 512, align: 64, flags: DIFlagPrivate)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<blocking::Inner>", scope: !302, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !393, templateParams: !445, identifier: "f76acf0a7b6a9611c454e8165fb5f637")
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !392, file: !2, baseType: !306, size: 32, align: 32, flags: DIFlagPrivate)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !392, file: !2, baseType: !312, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !2, baseType: !397, size: 448, align: 64, offset: 64, flags: DIFlagPrivate)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<blocking::Inner>", scope: !203, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !398, templateParams: !445, identifier: "3b0fdc07bdf802e4566b1560f1017405")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !397, file: !2, baseType: !400, size: 448, align: 64, flags: DIFlagPrivate)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !385, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !401, templateParams: !29, identifier: "54d0dd18d89c3390c5869fa64a680c91")
!401 = !{!402, !403, !404, !438}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "idle_count", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !400, file: !2, baseType: !9, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !400, file: !2, baseType: !405, size: 256, align: 64, flags: DIFlagPrivate)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "VecDeque<async_task::runnable::Runnable<()>, alloc::alloc::Global>", scope: !406, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !408, templateParams: !437, identifier: "8692a4ae19be87aad4b358062856003b")
!406 = !DINamespace(name: "vec_deque", scope: !407)
!407 = !DINamespace(name: "collections", scope: !187)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !405, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !405, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !405, file: !2, baseType: !412, size: 128, align: 64, flags: DIFlagPrivate)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<async_task::runnable::Runnable<()>, alloc::alloc::Global>", scope: !333, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !413, templateParams: !437, identifier: "29893346574b8ddc75cb90f6fc3db0")
!413 = !{!414, !435, !436}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !412, file: !2, baseType: !415, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<async_task::runnable::Runnable<()>>", scope: !337, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !416, templateParams: !431, identifier: "614feb34a20c5ebcf6fd1e0361a61fbe")
!416 = !{!417, !433}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !415, file: !2, baseType: !418, size: 64, align: 64, flags: DIFlagPrivate)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<async_task::runnable::Runnable<()>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !419, templateParams: !431, identifier: "c37c015444e17215e5179701d4e1e057")
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !418, file: !2, baseType: !421, size: 64, align: 64, flags: DIFlagPrivate)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const async_task::runnable::Runnable<()>", baseType: !422, size: 64, align: 64, dwarfAddressSpace: 0)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "Runnable<()>", scope: !423, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !425, templateParams: !429, identifier: "373ef637f7b5f1b828418b1e44bf5375")
!423 = !DINamespace(name: "runnable", scope: !424)
!424 = !DINamespace(name: "async_task", scope: null)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !422, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagProtected)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !422, file: !2, baseType: !428, align: 8, offset: 64, flags: DIFlagProtected)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<()>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !57, identifier: "c0ac5dd9794ce0c9804cd88f3d5e02b")
!429 = !{!430}
!430 = !DITemplateTypeParameter(name: "M", type: !7)
!431 = !{!432}
!432 = !DITemplateTypeParameter(name: "T", type: !422)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !415, file: !2, baseType: !434, align: 8, offset: 64, flags: DIFlagPrivate)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<async_task::runnable::Runnable<()>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !431, identifier: "92cb0d9cc3e8690665621ad9963115c5")
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !412, file: !2, baseType: !347, size: 64, align: 64, flags: DIFlagPrivate)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !412, file: !2, baseType: !273, align: 8, offset: 128, flags: DIFlagPrivate)
!437 = !{!432, !276}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "thread_limit", scope: !400, file: !2, baseType: !439, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<usize>", scope: !240, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !440, templateParams: !206, identifier: "4e63919ca2bffb0d986fc8bb37a159aa")
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !439, file: !2, baseType: !442, size: 64, align: 64, flags: DIFlagPrivate)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroUsizeInner", scope: !245, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !443, templateParams: !29, identifier: "328a4c3f0e58d2308ba10f5d54a88ef7")
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !442, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!445 = !{!446}
!446 = !DITemplateTypeParameter(name: "T", type: !400)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !389, file: !2, baseType: !448, size: 32, align: 32, offset: 512, flags: DIFlagPrivate)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !449, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !450, templateParams: !29, identifier: "4ac5dba46f41aa1312825ffdc090ba3d")
!449 = !DINamespace(name: "condvar", scope: !303)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !448, file: !2, baseType: !452, size: 32, align: 32, flags: DIFlagPrivate)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !453, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !455, templateParams: !29, identifier: "85e7f52dd80c402ab0edc07952b121af")
!453 = !DINamespace(name: "futex", scope: !454)
!454 = !DINamespace(name: "condvar", scope: !254)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !452, file: !2, baseType: !257, size: 32, align: 32, flags: DIFlagPrivate)
!457 = !{!458}
!458 = !DITemplateTypeParameter(name: "T", type: !382)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "their_packet", scope: !172, file: !2, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Packet<()>, alloc::alloc::Global>", scope: !186, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !461, templateParams: !583, identifier: "8d6333b05a2acab04cda501785e26fa8")
!461 = !{!462, !580, !582}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !460, file: !2, baseType: !463, size: 64, align: 64, flags: DIFlagPrivate)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !464, templateParams: !578, identifier: "706f6949b4896073e3aa6f4227c60fa7")
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !463, file: !2, baseType: !466, size: 64, align: 64, flags: DIFlagPrivate)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Packet<()>>", baseType: !467, size: 64, align: 64, dwarfAddressSpace: 0)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Packet<()>>", scope: !186, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !468, templateParams: !576, identifier: "a2d5f927010532da186a36005df2b922")
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !467, file: !2, baseType: !197, size: 64, align: 64, flags: DIFlagPrivate)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !467, file: !2, baseType: !197, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !467, file: !2, baseType: !472, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<()>", scope: !175, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !473, templateParams: !57, identifier: "92a1a808c17e07f48bc8bbe72c952ca9")
!473 = !{!474, !514, !558}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !472, file: !2, baseType: !475, size: 64, align: 64, flags: DIFlagPrivate)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::thread::scoped::ScopeData, alloc::alloc::Global>>", scope: !281, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !476, templateParams: !29, identifier: "6e7340be679a35d1244818875bdb05f3")
!476 = !{!477}
!477 = !DICompositeType(tag: DW_TAG_variant_part, scope: !475, file: !2, size: 64, align: 64, elements: !478, templateParams: !29, identifier: "435d335a45af982f43233b79b989040", discriminator: !513)
!478 = !{!479, !509}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !477, file: !2, baseType: !480, size: 64, align: 64, extraData: i128 0)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !475, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !481, identifier: "8422707dbfaccd8b6ee1e229901342f1")
!481 = !{!482}
!482 = !DITemplateTypeParameter(name: "T", type: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::scoped::ScopeData, alloc::alloc::Global>", scope: !186, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !484, templateParams: !508, identifier: "1dd903a20371540c4f7b713eba87dafb")
!484 = !{!485, !505, !507}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !483, file: !2, baseType: !486, size: 64, align: 64, flags: DIFlagPrivate)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !487, templateParams: !503, identifier: "c6c8002d2c3b2ab975c2231faabbf4e2")
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !486, file: !2, baseType: !489, size: 64, align: 64, flags: DIFlagPrivate)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::scoped::ScopeData>", baseType: !490, size: 64, align: 64, dwarfAddressSpace: 0)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::scoped::ScopeData>", scope: !186, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !491, templateParams: !501, identifier: "ce7aca20af23615fd46a2383d1f2cb95")
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !490, file: !2, baseType: !197, size: 64, align: 64, flags: DIFlagPrivate)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !490, file: !2, baseType: !197, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !2, baseType: !495, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScopeData", scope: !496, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !497, templateParams: !29, identifier: "d2296de7556aed2d6db2875624efbd38")
!496 = !DINamespace(name: "scoped", scope: !175)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_running_threads", scope: !495, file: !2, baseType: !197, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "a_thread_panicked", scope: !495, file: !2, baseType: !316, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "main_thread", scope: !495, file: !2, baseType: !178, size: 64, align: 64, flags: DIFlagPrivate)
!501 = !{!502}
!502 = !DITemplateTypeParameter(name: "T", type: !495)
!503 = !{!504}
!504 = !DITemplateTypeParameter(name: "T", type: !490)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !483, file: !2, baseType: !506, align: 8, offset: 64, flags: DIFlagPrivate)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !503, identifier: "aaf2d9dbc548cdceceee8ec3e1137f0")
!507 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !483, file: !2, baseType: !273, align: 8, offset: 64, flags: DIFlagPrivate)
!508 = !{!502, !276}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !477, file: !2, baseType: !510, size: 64, align: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !475, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !511, templateParams: !481, identifier: "631d184f82293a2ea205598edb73066f")
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !510, file: !2, baseType: !483, size: 64, align: 64, flags: DIFlagPublic)
!513 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !472, file: !2, baseType: !515, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>>", scope: !203, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !516, templateParams: !556, identifier: "7f366a5a3159fd2e4626898c8c4ef400")
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !515, file: !2, baseType: !518, size: 192, align: 64, flags: DIFlagPrivate)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>", scope: !281, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !519, templateParams: !29, identifier: "a41c5ffc8a61c999f22e0992cdd74e7c")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_variant_part, scope: !518, file: !2, size: 192, align: 64, elements: !521, templateParams: !29, identifier: "32e198e0b7d6d96a7205be14de605815", discriminator: !555)
!521 = !{!522, !551}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !520, file: !2, baseType: !523, size: 192, align: 64, extraData: i128 0)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !518, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !524, identifier: "db874c5de8dbc8be2eafc9dc871ccbae")
!524 = !{!525}
!525 = !DITemplateTypeParameter(name: "T", type: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !527, templateParams: !29, identifier: "53dec22df4875abbdb0f8e9ab7096d8c")
!527 = !{!528}
!528 = !DICompositeType(tag: DW_TAG_variant_part, scope: !526, file: !2, size: 128, align: 64, elements: !529, templateParams: !29, identifier: "9330202a7894ebe9d2bebfb13ca94b5f", discriminator: !550)
!529 = !{!530, !546}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !528, file: !2, baseType: !531, size: 128, align: 64, extraData: i128 0)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !526, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !532, templateParams: !534, identifier: "1d2102a372591620634126e96a2e2142")
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !531, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!534 = !{!42, !535}
!535 = !DITemplateTypeParameter(name: "E", type: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !537, templateParams: !29, identifier: "69efc71d62726b9d235d74b72706b922")
!537 = !{!538, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !536, file: !2, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64, dwarfAddressSpace: 0)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !29, identifier: "d9d0340af71c3931acd562336146ce60")
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !536, file: !2, baseType: !542, size: 64, align: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !543, size: 64, align: 64, dwarfAddressSpace: 0)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 4, lowerBound: 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !528, file: !2, baseType: !547, size: 128, align: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !526, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !548, templateParams: !534, identifier: "79beb65a77bb93c117a0bf64f94129e3")
!548 = !{!549}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !547, file: !2, baseType: !536, size: 128, align: 64, flags: DIFlagPublic)
!550 = !DIDerivedType(tag: DW_TAG_member, scope: !526, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !520, file: !2, baseType: !552, size: 192, align: 64, extraData: i128 1)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !518, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !553, templateParams: !524, identifier: "b0d8cf371ba9963131ed631ba1e90ea7")
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !552, file: !2, baseType: !526, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!556 = !{!557}
!557 = !DITemplateTypeParameter(name: "T", type: !518)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !472, file: !2, baseType: !559, align: 8, offset: 256, flags: DIFlagPrivate)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<&std::thread::scoped::ScopeData>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !560, identifier: "de4d4f706a189c25d59a6aaaceec8191")
!560 = !{!561}
!561 = !DITemplateTypeParameter(name: "T", type: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&std::thread::scoped::ScopeData>", scope: !281, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !563, templateParams: !29, identifier: "3498bd962d2cc03658e9ad6ca97bf63e")
!563 = !{!564}
!564 = !DICompositeType(tag: DW_TAG_variant_part, scope: !562, file: !2, size: 64, align: 64, elements: !565, templateParams: !29, identifier: "5e59ea6fd400334a4506cb43a12047fb", discriminator: !575)
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !564, file: !2, baseType: !567, size: 64, align: 64, extraData: i128 0)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !562, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !568, identifier: "b453ea9704a195e25abf65638be8f41a")
!568 = !{!569}
!569 = !DITemplateTypeParameter(name: "T", type: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::thread::scoped::ScopeData", baseType: !495, size: 64, align: 64, dwarfAddressSpace: 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !564, file: !2, baseType: !572, size: 64, align: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !562, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !573, templateParams: !568, identifier: "50910516a5c3eddaa9d7697268724509")
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !572, file: !2, baseType: !570, size: 64, align: 64, flags: DIFlagPublic)
!575 = !DIDerivedType(tag: DW_TAG_member, scope: !562, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!576 = !{!577}
!577 = !DITemplateTypeParameter(name: "T", type: !472)
!578 = !{!579}
!579 = !DITemplateTypeParameter(name: "T", type: !467)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !460, file: !2, baseType: !581, align: 8, offset: 64, flags: DIFlagPrivate)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Packet<()>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !578, identifier: "5f4a68e00677b9f7e0ab01e91808973b")
!582 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !460, file: !2, baseType: !273, align: 8, offset: 64, flags: DIFlagPrivate)
!583 = !{!577, !276}
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !587, vtableHolder: !592, templateParams: !29, identifier: "e988aa02e9b40b3f2165e2ec0252f6b8")
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !586, file: !2, baseType: !6, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !586, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !586, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !596, vtableHolder: !601, templateParams: !29, identifier: "148086e383c35074abdcd9ef824dc09f")
!596 = !{!597, !598, !599, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !595, file: !2, baseType: !6, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !595, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !595, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !595, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !224, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !602, templateParams: !29, identifier: "1cecfabb6d8e7754cff6ccae89599a10")
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !601, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !601, file: !2, baseType: !328, size: 192, align: 64, flags: DIFlagPrivate)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<blocking::Inner>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<blocking::Inner>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !608, vtableHolder: !613, templateParams: !29, identifier: "f6d6e3598ba9bf9a6a203356ab286602")
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !607, file: !2, baseType: !6, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !607, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !607, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !607, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<blocking::Inner>>", scope: !313, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !614, templateParams: !625, identifier: "5c2bf4bd9a8eac10d0d36a0586ac62ab")
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !613, file: !2, baseType: !616, size: 128, align: 64, flags: DIFlagPrivate)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<blocking::Inner>", scope: !302, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !617, templateParams: !445, identifier: "7269df3cb05fb2a871662b6d6600718")
!617 = !{!618, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !616, file: !2, baseType: !619, size: 64, align: 64, flags: DIFlagPrivate)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<blocking::Inner>", baseType: !392, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !616, file: !2, baseType: !621, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !313, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !622, templateParams: !29, identifier: "d9443e3e6bb8ddba7b9137625ad6dc21")
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !621, file: !2, baseType: !624, size: 8, align: 8, flags: DIFlagPrivate)
!624 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!625 = !{!626}
!626 = !DITemplateTypeParameter(name: "T", type: !616)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<blocking::Inner>, std::sync::condvar::WaitTimeoutResult)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<blocking::Inner>, std::sync::condvar::WaitTimeoutResult)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !630, vtableHolder: !635, templateParams: !29, identifier: "a1710985ab91987dec7a7da2090333f9")
!630 = !{!631, !632, !633, !634}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !629, file: !2, baseType: !6, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !629, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !629, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<(std::sync::mutex::MutexGuard<blocking::Inner>, std::sync::condvar::WaitTimeoutResult)>", scope: !313, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !636, templateParams: !645, identifier: "f966b4f6946d502fe4e13d136e9a9fcb")
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !635, file: !2, baseType: !638, size: 192, align: 64, flags: DIFlagPrivate)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "(std::sync::mutex::MutexGuard<blocking::Inner>, std::sync::condvar::WaitTimeoutResult)", file: !2, size: 192, align: 64, elements: !639, templateParams: !29, identifier: "ea74802ae18980d2921db8de6a245a58")
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !638, file: !2, baseType: !616, size: 128, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !638, file: !2, baseType: !642, size: 8, align: 8, offset: 128)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitTimeoutResult", scope: !449, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !643, templateParams: !29, identifier: "52e4c1d5aa834b32d644882c2f3fe365")
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !642, file: !2, baseType: !624, size: 8, align: 8, flags: DIFlagPrivate)
!645 = !{!646}
!646 = !DITemplateTypeParameter(name: "T", type: !638)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !649, isLocal: true, isDefinition: true)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !650, vtableHolder: !9, templateParams: !29, identifier: "3ce104670d23cbc41299f657a9cf1bea")
!650 = !{!651, !652, !653, !654}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !649, file: !2, baseType: !6, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !649, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !649, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !649, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !658, vtableHolder: !663, templateParams: !29, identifier: "7fd8880e7ccad070a8c3ed73729c2d2b")
!658 = !{!659, !660, !661, !662}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !657, file: !2, baseType: !6, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !657, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !657, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !657, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "<&core::time::Duration as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::time::Duration as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !667, vtableHolder: !672, templateParams: !29, identifier: "f8b6c279e7587fac77a068d26550a5f0")
!667 = !{!668, !669, !670, !671}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !666, file: !2, baseType: !6, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !666, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !666, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !666, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::time::Duration", baseType: !673, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Duration", scope: !674, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !675, templateParams: !29, identifier: "e6e9d820da14977b115222421f695430")
!674 = !DINamespace(name: "time", scope: !33)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "secs", scope: !673, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagPrivate)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nanos", scope: !673, file: !2, baseType: !678, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !674, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !679, templateParams: !29, identifier: "18ac0ffc1bb3876b843131ad5ec34da7")
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !678, file: !2, baseType: !263, size: 32, align: 32, flags: DIFlagPrivate)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "EXECUTOR", linkageName: "_ZN8blocking8Executor3get8EXECUTOR17h4429df7ad190c265E", scope: !683, file: !684, line: 175, type: !685, isLocal: false, isDefinition: true, align: 64)
!683 = !DINamespace(name: "get", scope: !384)
!684 = !DIFile(filename: "src/lib.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/blocking-1.5.1", checksumkind: CSK_MD5, checksum: "ef6c82884c7086f535c1b153f64826d1")
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnceCell<blocking::Executor>", scope: !686, file: !2, size: 768, align: 64, flags: DIFlagPublic, elements: !688, templateParams: !873, identifier: "6538bb6bd5c2456b9a3b7898bf384490")
!686 = !DINamespace(name: "once_cell", scope: !687)
!687 = !DINamespace(name: "async_lock", scope: null)
!688 = !{!689, !860, !861, !862}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "active_initializers", scope: !685, file: !2, baseType: !690, size: 64, align: 64, flags: DIFlagPrivate)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Event<()>", scope: !691, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !692, templateParams: !57, identifier: "ef0b164ba12296c0ec2bce90410e0ceb")
!691 = !DINamespace(name: "event_listener", scope: null)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !690, file: !2, baseType: !694, size: 64, align: 64, flags: DIFlagPrivate)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<event_listener::Inner<()>>", scope: !198, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !695, templateParams: !858, identifier: "46aea05c1bfa3d0c8915ada64da452bf")
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !694, file: !2, baseType: !697, size: 64, align: 64, flags: DIFlagPrivate)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut event_listener::Inner<()>>", scope: !203, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !698, templateParams: !856, identifier: "d0df41f348973dd8cf47a321f4600e37")
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !697, file: !2, baseType: !700, size: 64, align: 64, flags: DIFlagPrivate)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut event_listener::Inner<()>", baseType: !701, size: 64, align: 64, dwarfAddressSpace: 0)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<()>", scope: !691, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !702, templateParams: !57, identifier: "9236e854376b0d4cd170528eda8b9048")
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "notified", scope: !701, file: !2, baseType: !197, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !701, file: !2, baseType: !705, size: 384, align: 64, flags: DIFlagPrivate)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "List<()>", scope: !706, file: !2, size: 384, align: 64, flags: DIFlagProtected, elements: !707, templateParams: !57, identifier: "831cf0078a2b22a4269095f5421b530e")
!706 = !DINamespace(name: "sys", scope: !691)
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !705, file: !2, baseType: !709, size: 384, align: 64, flags: DIFlagPrivate)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<event_listener::sys::Inner<()>>", scope: !302, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !710, templateParams: !854, identifier: "7dd8ddc59924866b415594ac3756958")
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !709, file: !2, baseType: !306, size: 32, align: 32, flags: DIFlagPrivate)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !709, file: !2, baseType: !312, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !709, file: !2, baseType: !714, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::sys::Inner<()>>", scope: !203, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !715, templateParams: !854, identifier: "5ca6c82755304f17c40dfad2c9b3ae68")
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !714, file: !2, baseType: !717, size: 320, align: 64, flags: DIFlagPrivate)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner<()>", scope: !706, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !718, templateParams: !57, identifier: "1f53821c64e1dc705c119a88ffdf14ef")
!718 = !{!719, !850, !851, !852, !853}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !717, file: !2, baseType: !720, size: 64, align: 64, flags: DIFlagPrivate)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>", scope: !281, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !721, templateParams: !29, identifier: "a651642ae60dbe27c9256a2e2987ea45")
!721 = !{!722}
!722 = !DICompositeType(tag: DW_TAG_variant_part, scope: !720, file: !2, size: 64, align: 64, elements: !723, templateParams: !29, identifier: "6c43d02f03a7616245ba6c23a6eac020", discriminator: !849)
!723 = !{!724, !845}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !722, file: !2, baseType: !725, size: 64, align: 64, extraData: i128 0)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !720, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !726, identifier: "2f4f6e313ad10698e41c9a467abba3e")
!726 = !{!727}
!727 = !DITemplateTypeParameter(name: "T", type: !728)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<event_listener::sys::Link<()>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !729, templateParams: !843, identifier: "ca7f93308dd70cba20b0c95ea39d96c7")
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !728, file: !2, baseType: !731, size: 64, align: 64, flags: DIFlagPrivate)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const event_listener::sys::Link<()>", baseType: !732, size: 64, align: 64, dwarfAddressSpace: 0)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "Link<()>", scope: !706, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !733, templateParams: !57, identifier: "d96a7b30b8aa87a186213cac4bbb5535")
!733 = !{!734, !833, !842}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !732, file: !2, baseType: !735, size: 192, align: 64, flags: DIFlagPrivate)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<event_listener::State<()>>", scope: !203, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !736, templateParams: !831, identifier: "ce455b90cf8a3226e6d085b7a348c813")
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !735, file: !2, baseType: !738, size: 192, align: 64, flags: DIFlagPrivate)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<event_listener::State<()>>", scope: !203, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !739, templateParams: !831, identifier: "ba0d6097fed2e29aa005287c811892a0")
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !738, file: !2, baseType: !741, size: 192, align: 64, flags: DIFlagPrivate)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "State<()>", scope: !691, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !742, templateParams: !29, identifier: "63dfe96b96a361658919f1094c803e1d")
!742 = !{!743}
!743 = !DICompositeType(tag: DW_TAG_variant_part, scope: !741, file: !2, size: 192, align: 64, elements: !744, templateParams: !29, identifier: "ddfa394a9dea3c7477624267fd559989", discriminator: !830)
!744 = !{!745, !747, !752, !828}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "Created", scope: !743, file: !2, baseType: !746, size: 192, align: 64, extraData: i128 0)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "Created", scope: !741, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, templateParams: !57, identifier: "eebe2bf2e380cf59f003f13745fc4b61")
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Notified", scope: !743, file: !2, baseType: !748, size: 192, align: 64, extraData: i128 1)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notified", scope: !741, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !749, templateParams: !57, identifier: "ec8a14c0854d13a38e922f5838ae8e9c")
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !748, file: !2, baseType: !624, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !748, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPrivate)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Task", scope: !743, file: !2, baseType: !753, size: 192, align: 64, extraData: i128 2)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task", scope: !741, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !754, templateParams: !57, identifier: "62565a9d62398f017cec03b6f6071d12")
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !753, file: !2, baseType: !756, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task", scope: !691, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !757, templateParams: !29, identifier: "bab95dbe1505b2b7273f5e8e2a31eeaf")
!757 = !{!758}
!758 = !DICompositeType(tag: DW_TAG_variant_part, scope: !756, file: !2, size: 128, align: 64, elements: !759, templateParams: !29, identifier: "2c48b1223c2eb30e6abbd03b03356d27", discriminator: !827)
!759 = !{!760, !786}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Waker", scope: !758, file: !2, baseType: !761, size: 128, align: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !756, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !762, templateParams: !29, identifier: "f984acde1be4429b167a7d96ebbb54fc")
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !761, file: !2, baseType: !764, size: 128, align: 64, flags: DIFlagPrivate)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !765, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !767, templateParams: !29, identifier: "ec03eb30528f12f1717f729e65eac0d1")
!765 = !DINamespace(name: "wake", scope: !766)
!766 = !DINamespace(name: "task", scope: !33)
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !764, file: !2, baseType: !769, size: 128, align: 64, flags: DIFlagPrivate)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !765, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !770, templateParams: !29, identifier: "212c6d54ee18011b525ba8a27d92578c")
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !769, file: !2, baseType: !6, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !769, file: !2, baseType: !773, size: 64, align: 64, flags: DIFlagPrivate)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !774, size: 64, align: 64, dwarfAddressSpace: 0)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !765, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !775, templateParams: !29, identifier: "f4abbf7758eb3384651691936bf57e5b")
!775 = !{!776, !780, !784, !785}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !774, file: !2, baseType: !777, size: 64, align: 64, flags: DIFlagPrivate)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !778, size: 64, align: 64, dwarfAddressSpace: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!769, !6}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !774, file: !2, baseType: !781, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !782, size: 64, align: 64, dwarfAddressSpace: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !6}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !774, file: !2, baseType: !781, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !774, file: !2, baseType: !781, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Unparker", scope: !758, file: !2, baseType: !787, size: 128, align: 64, extraData: i128 0)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !756, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !788, templateParams: !29, identifier: "26db9ed251879ce18293261e1d518cb7")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !2, baseType: !790, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unparker", scope: !791, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !792, templateParams: !29, identifier: "5192ed2efe1020b6ccd5e36b4da17d5b")
!791 = !DINamespace(name: "parking", scope: null)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !790, file: !2, baseType: !794, size: 64, align: 64, flags: DIFlagPrivate)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<parking::Inner, alloc::alloc::Global>", scope: !186, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !795, templateParams: !826, identifier: "f2d46d41b9758d25450ea7070e7e54d0")
!795 = !{!796, !823, !825}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !794, file: !2, baseType: !797, size: 64, align: 64, flags: DIFlagPrivate)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<parking::Inner>>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !798, templateParams: !821, identifier: "825cebb2feb53bbe75ce00c352a7557b")
!798 = !{!799}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !797, file: !2, baseType: !800, size: 64, align: 64, flags: DIFlagPrivate)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<parking::Inner>", baseType: !801, size: 64, align: 64, dwarfAddressSpace: 0)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<parking::Inner>", scope: !186, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !802, templateParams: !819, identifier: "5b53f9341214387fb6b74fadd363563e")
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !801, file: !2, baseType: !197, size: 64, align: 64, flags: DIFlagPrivate)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !801, file: !2, baseType: !197, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !2, baseType: !806, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !791, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !807, templateParams: !29, identifier: "5f39869ee684c5037dd93dab50c67fdb")
!807 = !{!808, !809, !818}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !806, file: !2, baseType: !197, size: 64, align: 64, flags: DIFlagPrivate)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !806, file: !2, baseType: !810, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !302, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !811, templateParams: !57, identifier: "d5fd249575a8d955fed7c24d847ce0e7")
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !810, file: !2, baseType: !306, size: 32, align: 32, flags: DIFlagPrivate)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !810, file: !2, baseType: !312, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !810, file: !2, baseType: !815, align: 8, offset: 40, flags: DIFlagPrivate)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !203, file: !2, align: 8, flags: DIFlagPublic, elements: !816, templateParams: !57, identifier: "df2a04390e4e7561d08d0a5a22c77b4a")
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !815, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !806, file: !2, baseType: !448, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!819 = !{!820}
!820 = !DITemplateTypeParameter(name: "T", type: !806)
!821 = !{!822}
!822 = !DITemplateTypeParameter(name: "T", type: !801)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !794, file: !2, baseType: !824, align: 8, offset: 64, flags: DIFlagPrivate)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<parking::Inner>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !821, identifier: "48ffbd424065b89079830852149b4cfc")
!825 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !794, file: !2, baseType: !273, align: 8, offset: 64, flags: DIFlagPrivate)
!826 = !{!820, !276}
!827 = !DIDerivedType(tag: DW_TAG_member, scope: !756, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "NotifiedTaken", scope: !743, file: !2, baseType: !829, size: 192, align: 64, extraData: i128 3)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "NotifiedTaken", scope: !741, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !29, templateParams: !57, identifier: "62f8f94ec586990abf11acec35a291c2")
!830 = !DIDerivedType(tag: DW_TAG_member, scope: !741, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!831 = !{!832}
!832 = !DITemplateTypeParameter(name: "T", type: !741)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !732, file: !2, baseType: !834, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>>", scope: !203, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !835, templateParams: !840, identifier: "efd26ad6b9e7548456865cd91786cab8")
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !834, file: !2, baseType: !837, size: 64, align: 64, flags: DIFlagPrivate)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::ptr::non_null::NonNull<event_listener::sys::Link<()>>>>", scope: !203, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !838, templateParams: !840, identifier: "a992c427cb11ecc7a9bede59a2c46259")
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !837, file: !2, baseType: !720, size: 64, align: 64, flags: DIFlagPrivate)
!840 = !{!841}
!841 = !DITemplateTypeParameter(name: "T", type: !720)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !2, baseType: !834, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!843 = !{!844}
!844 = !DITemplateTypeParameter(name: "T", type: !732)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !722, file: !2, baseType: !846, size: 64, align: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !720, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !847, templateParams: !726, identifier: "fc06e93de53e8de247be2b944fdbff52")
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !846, file: !2, baseType: !728, size: 64, align: 64, flags: DIFlagPublic)
!849 = !DIDerivedType(tag: DW_TAG_member, scope: !720, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
