; ModuleID = 'futures_util.189b71d2afac8c40-cgu.0'
source_filename = "futures_util.189b71d2afac8c40-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"slab::Entry<core::option::Option<core::task::wake::Waker>>" = type { i64, [2 x i64] }

@_ZN3std9panicking11panic_count18GLOBAL_PANIC_COUNT17h00e7dcd913cdfbe0E = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"
@vtable.0 = private constant <{ [24 x i8], ptr, ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\10\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN91_$LT$std..panicking..begin_panic..Payload$LT$A$GT$$u20$as$u20$core..panic..PanicPayload$GT$8take_box17h61e6caec6f3d0d6fE", ptr @"_ZN91_$LT$std..panicking..begin_panic..Payload$LT$A$GT$$u20$as$u20$core..panic..PanicPayload$GT$3get17h65661c684ed79500E" }>, align 8, !dbg !0
@alloc_00ae4b301f7fab8ac9617c03fcbd7274 = private unnamed_addr constant <{ [43 x i8] }> <{ [43 x i8] c"called `Result::unwrap()` on an `Err` value" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::panicking::begin_panic::Payload<&str> as core::panic::PanicPayload>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::panicking::begin_panic::Payload<&str> as core::panic::PanicPayload>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !13, templateParams: !27, identifier: "4d8b3c0140605c50495b45d94d6d5a84")
!4 = !{!5, !8, !10, !11, !12}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload<&str>", scope: !14, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !17, templateParams: !42, identifier: "4d4e0a9d220d367280f5a92851d927cf")
!14 = !DINamespace(name: "begin_panic", scope: !15)
!15 = !DINamespace(name: "panicking", scope: !16)
!16 = !DINamespace(name: "std", scope: null)
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !13, file: !2, baseType: !19, size: 128, align: 64, flags: DIFlagProtected)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !22, templateParams: !27, identifier: "c9cc8e2c9bc8d3061e54de437c9b5882")
!20 = !DINamespace(name: "option", scope: !21)
!21 = !DINamespace(name: "core", scope: null)
!22 = !{!23}
!23 = !DICompositeType(tag: DW_TAG_variant_part, scope: !19, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "dc91c89dee9d03b772ff0b7d0b60a9cb", discriminator: !40)
!24 = !{!25, !36}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !23, file: !2, baseType: !26, size: 128, align: 64, extraData: i128 0)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !19, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !28, identifier: "20871c480156d021cbbc4b2eec20a35c")
!27 = !{}
!28 = !{!29}
!29 = !DITemplateTypeParameter(name: "T", type: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !31, templateParams: !27, identifier: "9277eecd40495f85161460476aacc992")
!31 = !{!32, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !30, file: !2, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !30, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !23, file: !2, baseType: !37, size: 128, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !19, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !38, templateParams: !28, identifier: "2bd48e68865dce7a72b4a9887ea344e7")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !30, size: 128, align: 64, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!41 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!42 = !{!43}
!43 = !DITemplateTypeParameter(name: "A", type: !30)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !52, templateParams: !27, identifier: "1e73eee341a91a863d991554f5eb294f")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>>", scope: !53, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !210, identifier: "d70a328eb1c91c79a680758509db3081")
!53 = !DINamespace(name: "poison", scope: !54)
!54 = !DINamespace(name: "sync", scope: !16)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !52, file: !2, baseType: !57, size: 128, align: 64, flags: DIFlagPrivate)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>", scope: !58, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !203, identifier: "86a299b769549eb8a2c4b9b2f027aa1f")
!58 = !DINamespace(name: "mutex", scope: !54)
!59 = !{!60, !205}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !57, file: !2, baseType: !61, size: 64, align: 64, flags: DIFlagPrivate)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>", scope: !58, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !63, templateParams: !203, identifier: "cd43bea6b15cf511ce3c69df60bde21b")
!63 = !{!64, !84, !96}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !62, file: !2, baseType: !65, size: 32, align: 32, flags: DIFlagPrivate)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !66, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !70, templateParams: !27, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!66 = !DINamespace(name: "futex", scope: !67)
!67 = !DINamespace(name: "mutex", scope: !68)
!68 = !DINamespace(name: "sync", scope: !69)
!69 = !DINamespace(name: "sys", scope: !16)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !65, file: !2, baseType: !72, size: 32, align: 32, flags: DIFlagPrivate)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !73, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !75, templateParams: !27, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!73 = !DINamespace(name: "atomic", scope: !74)
!74 = !DINamespace(name: "sync", scope: !21)
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !72, file: !2, baseType: !77, size: 32, align: 32, flags: DIFlagPrivate)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !78, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !79, templateParams: !82, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!78 = !DINamespace(name: "cell", scope: !21)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !77, file: !2, baseType: !81, size: 32, align: 32, flags: DIFlagPrivate)
!81 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "T", type: !81)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !62, file: !2, baseType: !85, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !53, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !86, templateParams: !27, identifier: "f02169750979dbd37c1ab4c868f04f71")
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !85, file: !2, baseType: !88, size: 8, align: 8, flags: DIFlagPrivate)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !73, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !89, templateParams: !27, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !88, file: !2, baseType: !91, size: 8, align: 8, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !78, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !92, templateParams: !94, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagPrivate)
!94 = !{!95}
!95 = !DITemplateTypeParameter(name: "T", type: !34)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !2, baseType: !97, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>>", scope: !78, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !98, templateParams: !203, identifier: "a05eefaaa75c07fed764c2efa0b6083")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !97, file: !2, baseType: !100, size: 320, align: 64, flags: DIFlagPrivate)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<slab::Slab<core::option::Option<core::task::wake::Waker>>>", scope: !20, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !101, templateParams: !27, identifier: "5f0bb2c610b2389f650ab4272d454750")
!101 = !{!102}
!102 = !DICompositeType(tag: DW_TAG_variant_part, scope: !100, file: !2, size: 320, align: 64, elements: !103, templateParams: !27, identifier: "48153507bc18a5e66a4592abe2d8f5", discriminator: !202)
!103 = !{!104, !198}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !102, file: !2, baseType: !105, size: 320, align: 64, extraData: i128 9223372036854775808)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !100, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !106, identifier: "2817bb094fc98f7b3fd0842ecd7485c")
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "T", type: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slab<core::option::Option<core::task::wake::Waker>>", scope: !109, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !110, templateParams: !139, identifier: "164c75fb0fc14a34a102a46612863fda")
!109 = !DINamespace(name: "slab", scope: null)
!110 = !{!111, !196, !197}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !108, file: !2, baseType: !112, size: 192, align: 64, flags: DIFlagPrivate)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<slab::Entry<core::option::Option<core::task::wake::Waker>>, alloc::alloc::Global>", scope: !113, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !115, templateParams: !193, identifier: "2984134d7d3225067f68d45feed19b78")
!113 = !DINamespace(name: "vec", scope: !114)
!114 = !DINamespace(name: "alloc", scope: null)
!115 = !{!116, !195}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !112, file: !2, baseType: !117, size: 128, align: 64, flags: DIFlagPrivate)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<slab::Entry<core::option::Option<core::task::wake::Waker>>, alloc::alloc::Global>", scope: !118, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !119, templateParams: !193, identifier: "9c5ac50ed7db8e338391a0ce9c167c08")
!118 = !DINamespace(name: "raw_vec", scope: !114)
!119 = !{!120, !186, !190}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !117, file: !2, baseType: !121, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<slab::Entry<core::option::Option<core::task::wake::Waker>>>", scope: !122, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !124, templateParams: !181, identifier: "ef8dd6e846db0f3baa266ebbbd46f9a6")
!122 = !DINamespace(name: "unique", scope: !123)
!123 = !DINamespace(name: "ptr", scope: !21)
!124 = !{!125, !183}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !121, file: !2, baseType: !126, size: 64, align: 64, flags: DIFlagPrivate)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<slab::Entry<core::option::Option<core::task::wake::Waker>>>", scope: !127, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !128, templateParams: !181, identifier: "871aa4b73c6492e8c25d6fe6d537ba3c")
!127 = !DINamespace(name: "non_null", scope: !123)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !126, file: !2, baseType: !130, size: 64, align: 64, flags: DIFlagPrivate)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const slab::Entry<core::option::Option<core::task::wake::Waker>>", baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry<core::option::Option<core::task::wake::Waker>>", scope: !109, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !132, templateParams: !27, identifier: "dba5a182387037feede16c3779be426")
!132 = !{!133}
!133 = !DICompositeType(tag: DW_TAG_variant_part, scope: !131, file: !2, size: 192, align: 64, elements: !134, templateParams: !27, identifier: "6c8429f9e5d10db842c0b161ee131c19", discriminator: !180)
!134 = !{!135, !176}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Vacant", scope: !133, file: !2, baseType: !136, size: 192, align: 64, extraData: i128 0)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vacant", scope: !131, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !137, templateParams: !139, identifier: "7a3fdceafe0308e12447f767b5a53dad")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!139 = !{!140}
!140 = !DITemplateTypeParameter(name: "T", type: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::task::wake::Waker>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !142, templateParams: !27, identifier: "fdf92b2a7f95e10b1f6af3c28f571177")
!142 = !{!143}
!143 = !DICompositeType(tag: DW_TAG_variant_part, scope: !141, file: !2, size: 128, align: 64, elements: !144, templateParams: !27, identifier: "79b709c92f110a7567e6b4260f3fffd1", discriminator: !175)
!144 = !{!145, !171}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !143, file: !2, baseType: !146, size: 128, align: 64, extraData: i128 0)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !141, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !147, identifier: "e3b1b04ced3820bf6ad9a1cf1a84b270")
!147 = !{!148}
!148 = !DITemplateTypeParameter(name: "T", type: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !150, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !152, templateParams: !27, identifier: "ec03eb30528f12f1717f729e65eac0d1")
!150 = !DINamespace(name: "wake", scope: !151)
!151 = !DINamespace(name: "task", scope: !21)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !149, file: !2, baseType: !154, size: 128, align: 64, flags: DIFlagPrivate)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !150, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !155, templateParams: !27, identifier: "212c6d54ee18011b525ba8a27d92578c")
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !2, baseType: !6, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !154, file: !2, baseType: !158, size: 64, align: 64, flags: DIFlagPrivate)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !150, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !160, templateParams: !27, identifier: "f4abbf7758eb3384651691936bf57e5b")
!160 = !{!161, !165, !169, !170}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !159, file: !2, baseType: !162, size: 64, align: 64, flags: DIFlagPrivate)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!163 = !DISubroutineType(types: !164)
!164 = !{!154, !6}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !159, file: !2, baseType: !166, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !6}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !159, file: !2, baseType: !166, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !159, file: !2, baseType: !166, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !143, file: !2, baseType: !172, size: 128, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !141, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !173, templateParams: !147, identifier: "f45b850959d020985d588404342ce426")
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !172, file: !2, baseType: !149, size: 128, align: 64, flags: DIFlagPublic)
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !141, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Occupied", scope: !133, file: !2, baseType: !177, size: 192, align: 64, extraData: i128 1)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Occupied", scope: !131, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !178, templateParams: !139, identifier: "44a5481899ff703fc0bc641cc2e5c22a")
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !177, file: !2, baseType: !141, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "T", type: !131)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !121, file: !2, baseType: !184, align: 8, offset: 64, flags: DIFlagPrivate)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<slab::Entry<core::option::Option<core::task::wake::Waker>>>", scope: !185, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !181, identifier: "72a74fdc8618b2746ab5800ff2005f19")
!185 = !DINamespace(name: "marker", scope: !21)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !117, file: !2, baseType: !187, size: 64, align: 64, flags: DIFlagPrivate)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !118, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !188, templateParams: !27, identifier: "62de598dd28eaf1c7c0f61ca013e23b")
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !117, file: !2, baseType: !191, align: 8, offset: 128, flags: DIFlagPrivate)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !192, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "14de19725ec4b1fd38fae074afd4da08")
!192 = !DINamespace(name: "alloc", scope: !114)
!193 = !{!182, !194}
!194 = !DITemplateTypeParameter(name: "A", type: !191)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !112, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !108, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !102, file: !2, baseType: !199, size: 320, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !100, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !200, templateParams: !106, identifier: "fdef10e771e41a254f79513a1f445f75")
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !199, file: !2, baseType: !108, size: 320, align: 64, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "T", type: !100)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !57, file: !2, baseType: !206, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !53, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !207, templateParams: !27, identifier: "d9443e3e6bb8ddba7b9137625ad6dc21")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !206, file: !2, baseType: !209, size: 8, align: 8, flags: DIFlagPrivate)
!209 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!210 = !{!211}
!211 = !DITemplateTypeParameter(name: "T", type: !57)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "<&str as core::any::Any>::{vtable}", scope: null, file: !2, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::any::Any>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !215, vtableHolder: !30, templateParams: !27, identifier: "5adec2b5c980c23f6b7a3d8e04860d6")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !214, file: !2, baseType: !6, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !214, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !214, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !214, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!220 = !{i32 8, !"PIC Level", i32 2}
!221 = !{i32 2, !"RtLibUseGOT", i32 1}
!222 = !{i32 2, !"Dwarf Version", i32 4}
!223 = !{i32 2, !"Debug Info Version", i32 3}
!224 = !{!"rustc version 1.80.0-dev"}
!225 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !226, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !227, globals: !316, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/futures-util-0.3.29/src/lib.rs/@/futures_util.189b71d2afac8c40-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/futures-util-0.3.29")
!227 = !{!228, !235, !243, !310}
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !73, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !229)
!229 = !{!230, !231, !232, !233, !234}
!230 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!231 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!232 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!233 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!234 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !236, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !238)
!236 = !DINamespace(name: "rt", scope: !237)
!237 = !DINamespace(name: "fmt", scope: !21)
!238 = !{!239, !240, !241, !242}
!239 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!240 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!241 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!242 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !244, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagEnumClass, elements: !245)
!244 = !DINamespace(name: "alignment", scope: !123)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!246 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!247 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!248 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!249 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!250 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!251 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!252 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!253 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!254 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!255 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!256 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!257 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!258 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!259 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!260 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!261 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!262 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!263 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!264 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!265 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!266 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!267 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!268 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!269 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!270 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!271 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!272 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!273 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!274 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!275 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!276 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!277 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!278 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!279 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!280 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!281 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!282 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!283 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!284 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!285 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!286 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!287 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!288 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!289 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!290 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!291 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!292 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!293 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!294 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!295 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!296 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!297 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!298 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!299 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!300 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!301 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!302 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!303 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!304 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!305 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!306 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!307 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!308 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!309 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !311, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !312)
!311 = !DINamespace(name: "panicking", scope: !21)
!312 = !{!313, !314, !315}
!313 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!314 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!316 = !{!0, !317, !44, !212}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "<u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !320, vtableHolder: !34, templateParams: !27, identifier: "5de8e340283ac71c5963465a0463dbdb")
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !319, file: !2, baseType: !6, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !319, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !319, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !319, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!325 = distinct !DISubprogram(name: "type_id<&str>", linkageName: "_ZN36_$LT$T$u20$as$u20$core..any..Any$GT$7type_id17h7692f4a3877cc68bE", scope: !327, file: !326, line: 141, type: !329, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !28, retainedNodes: !339)
!326 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/any.rs", directory: "", checksumkind: CSK_MD5, checksum: "00055574bf7465cae7be22ab5c9966c5")
!327 = !DINamespace(name: "{impl#0}", scope: !328)
!328 = !DINamespace(name: "any", scope: !21)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !338}
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !328, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !332, templateParams: !27, identifier: "1f815785d12164cd5cc5e245629d60e2")
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !331, file: !2, baseType: !334, size: 128, align: 64, flags: DIFlagPrivate)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, u64)", file: !2, size: 128, align: 64, elements: !335, templateParams: !27, identifier: "19e9be5b2400f26b5a124525aae10cbb")
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !334, file: !2, baseType: !41, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !334, file: !2, baseType: !41, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = !{!340}
!340 = !DILocalVariable(name: "self", arg: 1, scope: !325, file: !326, line: 141, type: !338)
!341 = !DILocation(line: 0, scope: !325)
!342 = !DILocation(line: 143, column: 6, scope: !325)
!343 = distinct !DISubprogram(name: "__rust_end_short_backtrace<std::panicking::begin_panic::{closure_env#0}<&str>, !>", linkageName: "_ZN3std10sys_common9backtrace26__rust_end_short_backtrace17h6e7f2ab67aed6ef6E", scope: !345, file: !344, line: 167, type: !347, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !366, retainedNodes: !361)
!344 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "9a938a0945aa66d12453850743d3bf49")
!345 = !DINamespace(name: "backtrace", scope: !346)
!346 = !DINamespace(name: "sys_common", scope: !16)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !349}
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<&str>", scope: !14, file: !2, size: 192, align: 64, elements: !350, templateParams: !27, identifier: "f3822d9e1f5641f0bb85d124a293d87")
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !349, file: !2, baseType: !30, size: 128, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !349, file: !2, baseType: !353, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !355, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !357, templateParams: !27, identifier: "83f60b789274e9dfe5288fdb9ee764d1")
!355 = !DINamespace(name: "location", scope: !356)
!356 = !DINamespace(name: "panic", scope: !21)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !354, file: !2, baseType: !30, size: 128, align: 64, flags: DIFlagPrivate)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !354, file: !2, baseType: !81, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !354, file: !2, baseType: !81, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!361 = !{!362, !363}
!362 = !DILocalVariable(name: "f", arg: 1, scope: !343, file: !344, line: 167, type: !349)
!363 = !DILocalVariable(name: "result", scope: !364, file: !344, line: 171, type: !365, align: 1)
!364 = distinct !DILexicalBlock(scope: !343, file: !344, line: 171, column: 5)
!365 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!366 = !{!367, !368}
!367 = !DITemplateTypeParameter(name: "F", type: !349)
!368 = !DITemplateTypeParameter(name: "T", type: !365)
!369 = !DILocalVariable(name: "dummy", scope: !370, file: !371, line: 337, type: !7, align: 1)
!370 = distinct !DILexicalBlock(scope: !372, file: !371, line: 337, column: 1)
!371 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "36624a7f44e0e372094a9874489ad080")
!372 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h18fc35c02a8add6aE", scope: !373, file: !371, line: 337, type: !374, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !377, retainedNodes: !376)
!373 = !DINamespace(name: "hint", scope: !21)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !7}
!376 = !{!369}
!377 = !{!378}
!378 = !DITemplateTypeParameter(name: "T", type: !7)
!379 = !DILocation(line: 337, column: 27, scope: !370, inlinedAt: !380)
!380 = !DILocation(line: 174, column: 5, scope: !364)
!381 = !DILocation(line: 171, column: 9, scope: !364)
!382 = !DILocation(line: 167, column: 41, scope: !343)
!383 = !DILocation(line: 171, column: 18, scope: !343)
!384 = !DILocation(line: 338, column: 5, scope: !370, inlinedAt: !380)
!385 = distinct !DISubprogram(name: "begin_panic<&str>", linkageName: "_ZN3std9panicking11begin_panic17h54355bcf1f160d65E", scope: !15, file: !386, line: 687, type: !387, scopeLine: 687, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !393, retainedNodes: !389)
!386 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "60082975e1fd1fd79a46cc5d235d7ad0")
!387 = !DISubroutineType(cc: DW_CC_nocall, types: !388)
!388 = !{null, !30, !353}
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "msg", arg: 1, scope: !385, file: !386, line: 687, type: !30)
!391 = !DILocalVariable(name: "loc", scope: !392, file: !386, line: 692, type: !353, align: 8)
!392 = distinct !DILexicalBlock(scope: !385, file: !386, line: 692, column: 5)
!393 = !{!394}
!394 = !DITemplateTypeParameter(name: "M", type: !30)
!395 = !DILocation(line: 0, scope: !385)
!396 = !DILocation(line: 0, scope: !392)
!397 = !DILocation(line: 693, column: 69, scope: !392)
!398 = !DILocation(line: 693, column: 12, scope: !392)
!399 = distinct !DISubprogram(name: "{closure#0}<&str>", linkageName: "_ZN3std9panicking11begin_panic28_$u7b$$u7b$closure$u7d$$u7d$17h058ff2f169486bb8E", scope: !14, file: !386, line: 693, type: !347, scopeLine: 693, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !393, retainedNodes: !400)
!400 = !{!401, !402}
!401 = !DILocalVariable(name: "msg", scope: !399, file: !386, line: 687, type: !30, align: 8)
!402 = !DILocalVariable(name: "loc", scope: !399, file: !386, line: 692, type: !353, align: 8)
!403 = !DILocation(line: 687, column: 41, scope: !399)
!404 = !DILocation(line: 692, column: 9, scope: !399)
!405 = !DILocation(line: 695, column: 18, scope: !399)
!406 = !DILocation(line: 695, column: 31, scope: !399)
!407 = !{i64 1}
!408 = !DILocalVariable(name: "inner", arg: 1, scope: !409, file: !386, line: 708, type: !30)
!409 = distinct !DILexicalBlock(scope: !410, file: !386, line: 708, column: 9)
!410 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN3std9panicking11begin_panic16Payload$LT$A$GT$3new17h969e6c354c5868cfE", scope: !13, file: !386, line: 708, type: !411, scopeLine: 708, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !42, declaration: !413, retainedNodes: !414)
!411 = !DISubroutineType(types: !412)
!412 = !{!13, !30}
!413 = !DISubprogram(name: "new<&str>", linkageName: "_ZN3std9panicking11begin_panic16Payload$LT$A$GT$3new17h969e6c354c5868cfE", scope: !13, file: !386, line: 708, type: !411, scopeLine: 708, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !42)
!414 = !{!408}
!415 = !DILocation(line: 0, scope: !409, inlinedAt: !405)
!416 = !DILocation(line: 709, column: 13, scope: !409, inlinedAt: !405)
!417 = !DILocation(line: 697, column: 13, scope: !399)
!418 = !{i64 8}
!419 = !DILocation(line: 694, column: 9, scope: !399)
!420 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN44_$LT$$RF$T$u20$as$u20$core..fmt..Display$GT$3fmt17h1ed6cd18161a2d73E", scope: !422, file: !421, line: 2354, type: !423, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !94, retainedNodes: !475)
!421 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!422 = !DINamespace(name: "{impl#53}", scope: !237)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !338, !442}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !426, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !427, templateParams: !27, identifier: "d2df09569ea43718984b3f07c77d7786")
!426 = !DINamespace(name: "result", scope: !21)
!427 = !{!428}
!428 = !DICompositeType(tag: DW_TAG_variant_part, scope: !425, file: !2, size: 8, align: 8, elements: !429, templateParams: !27, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !441)
!429 = !{!430, !437}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !428, file: !2, baseType: !431, size: 8, align: 8, extraData: i128 0)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !425, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !432, templateParams: !434, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !431, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!434 = !{!378, !435}
!435 = !DITemplateTypeParameter(name: "E", type: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !237, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !428, file: !2, baseType: !438, size: 8, align: 8, extraData: i128 1)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !425, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !439, templateParams: !434, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !438, file: !2, baseType: !436, align: 8, offset: 8, flags: DIFlagPublic)
!441 = !DIDerivedType(tag: DW_TAG_member, scope: !425, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagArtificial)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !237, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !444, templateParams: !27, identifier: "9d9578b0f9368582a2201563ca126cd4")
!444 = !{!445, !446, !448, !449, !463, !464}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !443, file: !2, baseType: !81, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !443, file: !2, baseType: !447, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!447 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !443, file: !2, baseType: !235, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !443, file: !2, baseType: !450, size: 128, align: 64, flags: DIFlagPrivate)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !451, templateParams: !27, identifier: "3850c4a210aea148b16f79ec227c427")
!451 = !{!452}
!452 = !DICompositeType(tag: DW_TAG_variant_part, scope: !450, file: !2, size: 128, align: 64, elements: !453, templateParams: !27, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !462)
!453 = !{!454, !458}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !452, file: !2, baseType: !455, size: 128, align: 64, extraData: i128 0)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !450, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !456, identifier: "10be3845cc366e59d680126f255dea8b")
!456 = !{!457}
!457 = !DITemplateTypeParameter(name: "T", type: !9)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !452, file: !2, baseType: !459, size: 128, align: 64, extraData: i128 1)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !450, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !460, templateParams: !456, identifier: "d166501012b6febc55685f1b3285acb8")
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !459, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !443, file: !2, baseType: !450, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !443, file: !2, baseType: !465, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !466, templateParams: !27, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!466 = !{!467, !470}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !465, file: !2, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64, dwarfAddressSpace: 0)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !465, file: !2, baseType: !471, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !472, size: 64, align: 64, dwarfAddressSpace: 0)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 6, lowerBound: 0)
!475 = !{!476, !477}
!476 = !DILocalVariable(name: "self", arg: 1, scope: !420, file: !421, line: 2354, type: !338)
!477 = !DILocalVariable(name: "f", arg: 2, scope: !420, file: !421, line: 2354, type: !442)
!478 = !DILocation(line: 0, scope: !420)
!479 = !DILocation(line: 2354, column: 71, scope: !420)
!480 = !DILocation(line: 2354, column: 62, scope: !420)
!481 = !DILocation(line: 2354, column: 84, scope: !420)
!482 = distinct !DISubprogram(name: "drop_in_place<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>", linkageName: "_ZN4core3ptr131drop_in_place$LT$futures_util..stream..futures_unordered..task..Task$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$17h3c65baddf12ccbf8E", scope: !123, file: !483, line: 542, type: !484, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !548, retainedNodes: !625)
!483 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "a85d519116fde26821981e2ebfa0ecba")
!484 = !DISubroutineType(types: !485)
!485 = !{null, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task<futures_task::future_obj::FutureObj<()>>", scope: !488, file: !2, size: 576, align: 64, flags: DIFlagProtected, elements: !492, templateParams: !615, identifier: "fbb2c4073360023f44c83bef6cdc0c35")
!488 = !DINamespace(name: "task", scope: !489)
!489 = !DINamespace(name: "futures_unordered", scope: !490)
!490 = !DINamespace(name: "stream", scope: !491)
!491 = !DINamespace(name: "futures_util", scope: null)
!492 = !{!493, !539, !550, !557, !561, !562, !623, !624}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "future", scope: !487, file: !2, baseType: !494, size: 192, align: 64, offset: 64, flags: DIFlagProtected)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<futures_task::future_obj::FutureObj<()>>>", scope: !78, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !495, templateParams: !537, identifier: "86f802392333af1477123c0e7e01f7ff")
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !494, file: !2, baseType: !497, size: 192, align: 64, flags: DIFlagPrivate)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<futures_task::future_obj::FutureObj<()>>", scope: !20, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !498, templateParams: !27, identifier: "5f8bce122829d48957fd4ee4654b8b97")
!498 = !{!499}
!499 = !DICompositeType(tag: DW_TAG_variant_part, scope: !497, file: !2, size: 192, align: 64, elements: !500, templateParams: !27, identifier: "d9a75a13aa580c8edcd5d6b06d2b87d", discriminator: !536)
!500 = !{!501, !532}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !499, file: !2, baseType: !502, size: 192, align: 64, extraData: i128 0)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !497, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !503, identifier: "3cb129b12f05dc6243036a68061e8612")
!503 = !{!504}
!504 = !DITemplateTypeParameter(name: "T", type: !505)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "FutureObj<()>", scope: !506, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !508, templateParams: !377, identifier: "76780a1a94994bb6ce358e861fc18fac")
!506 = !DINamespace(name: "future_obj", scope: !507)
!507 = !DINamespace(name: "futures_task", scope: null)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !505, file: !2, baseType: !510, size: 192, align: 64, flags: DIFlagPrivate)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "LocalFutureObj<()>", scope: !506, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !511, templateParams: !377, identifier: "6edd5c1cdf10ccb89647d7f58f779f07")
!511 = !{!512, !523, !527}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "future", scope: !510, file: !2, baseType: !513, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut dyn core::future::future::Future<Output=()>", file: !2, size: 128, align: 64, elements: !514, templateParams: !27, identifier: "7253a5ebcb3e2fc6a24b25cc55bf7c7")
!514 = !{!515, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !513, file: !2, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64, dwarfAddressSpace: 0)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::future::future::Future<Output=()>", file: !2, align: 8, elements: !27, identifier: "6ad64d8fc15ede5b92ff1f1e82c805e")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !513, file: !2, baseType: !519, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !520, size: 64, align: 64, dwarfAddressSpace: 0)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 4, lowerBound: 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "drop_fn", scope: !510, file: !2, baseType: !524, size: 64, align: 64, flags: DIFlagPrivate)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*mut dyn core::future::future::Future<Output=()>)", baseType: !525, size: 64, align: 64, dwarfAddressSpace: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !513}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !510, file: !2, baseType: !528, align: 8, offset: 192, flags: DIFlagPrivate)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !185, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !529, identifier: "4fdb56d679460f92e197b3d8f6c8004")
!529 = !{!530}
!530 = !DITemplateTypeParameter(name: "T", type: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !499, file: !2, baseType: !533, size: 192, align: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !497, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !534, templateParams: !503, identifier: "c1d226ca7b90201543b2413dd7be8152")
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !533, file: !2, baseType: !505, size: 192, align: 64, flags: DIFlagPublic)
!536 = !DIDerivedType(tag: DW_TAG_member, scope: !497, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!537 = !{!538}
!538 = !DITemplateTypeParameter(name: "T", type: !497)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "next_all", scope: !487, file: !2, baseType: !540, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>", scope: !73, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !541, templateParams: !548, identifier: "9d5cfa992a6f77a55a89527a4f5b4a56")
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !540, file: !2, baseType: !543, size: 64, align: 64, flags: DIFlagPrivate)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>", scope: !78, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !544, templateParams: !546, identifier: "c5b20883ff5693ea3f0494e4e921f085")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !543, file: !2, baseType: !486, size: 64, align: 64, flags: DIFlagPrivate)
!546 = !{!547}
!547 = !DITemplateTypeParameter(name: "T", type: !486)
!548 = !{!549}
!549 = !DITemplateTypeParameter(name: "T", type: !487)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev_all", scope: !487, file: !2, baseType: !551, size: 64, align: 64, offset: 320, flags: DIFlagProtected)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*const futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>", scope: !78, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !552, templateParams: !555, identifier: "aff13c4df06870224db12884175d8ec7")
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !551, file: !2, baseType: !554, size: 64, align: 64, flags: DIFlagPrivate)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = !{!556}
!556 = !DITemplateTypeParameter(name: "T", type: !554)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "len_all", scope: !487, file: !2, baseType: !558, size: 64, align: 64, offset: 384, flags: DIFlagProtected)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !78, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !559, templateParams: !456, identifier: "739795389d327d6873469e3d89b8c60e")
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !558, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next_ready_to_run", scope: !487, file: !2, baseType: !540, size: 64, align: 64, offset: 448, flags: DIFlagProtected)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ready_to_run_queue", scope: !487, file: !2, baseType: !563, size: 64, align: 64, flags: DIFlagProtected)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "Weak<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", scope: !564, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !565, templateParams: !622, identifier: "3a12c47f3f8683d59e975253f25a45f1")
!564 = !DINamespace(name: "sync", scope: !114)
!565 = !{!566, !621}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !563, file: !2, baseType: !567, size: 64, align: 64, flags: DIFlagPrivate)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>>>", scope: !127, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !568, templateParams: !619, identifier: "4fe72ac55d3f42744ccbf71ec8764a3b")
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !567, file: !2, baseType: !570, size: 64, align: 64, flags: DIFlagPrivate)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>>", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>>", scope: !564, file: !2, size: 512, align: 64, flags: DIFlagPrivate, elements: !572, templateParams: !617, identifier: "dbefa5c6894c1dae756fb6860c21f789")
!572 = !{!573, !577, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !571, file: !2, baseType: !574, size: 64, align: 64, flags: DIFlagPrivate)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !73, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !575, templateParams: !27, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !574, file: !2, baseType: !558, size: 64, align: 64, flags: DIFlagPrivate)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !571, file: !2, baseType: !574, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !571, file: !2, baseType: !579, size: 384, align: 64, offset: 128, flags: DIFlagPrivate)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>", scope: !580, file: !2, size: 384, align: 64, flags: DIFlagProtected, elements: !581, templateParams: !615, identifier: "4a2003bb95e3d9d2b679f017797a5cbd")
!580 = !DINamespace(name: "ready_to_run_queue", scope: !489)
!581 = !{!582, !594, !595, !596}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !579, file: !2, baseType: !583, size: 192, align: 64, offset: 64, flags: DIFlagProtected)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicWaker", scope: !584, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !588, templateParams: !27, identifier: "653693d5260447e0a4b287c4221f6d18")
!584 = !DINamespace(name: "atomic_waker", scope: !585)
!585 = !DINamespace(name: "__internal", scope: !586)
!586 = !DINamespace(name: "task", scope: !587)
!587 = !DINamespace(name: "futures_core", scope: null)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !583, file: !2, baseType: !574, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !583, file: !2, baseType: !591, size: 128, align: 64, flags: DIFlagPrivate)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::task::wake::Waker>>", scope: !78, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !592, templateParams: !139, identifier: "402882feea895d88487f598fd3781d2f")
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !591, file: !2, baseType: !141, size: 128, align: 64, flags: DIFlagPrivate)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !579, file: !2, baseType: !540, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !579, file: !2, baseType: !551, size: 64, align: 64, offset: 320, flags: DIFlagProtected)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stub", scope: !579, file: !2, baseType: !597, size: 64, align: 64, flags: DIFlagProtected)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", scope: !564, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !598, templateParams: !614, identifier: "26e4337dd41eff8728ce572112793e8c")
!598 = !{!599, !611, !613}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !597, file: !2, baseType: !600, size: 64, align: 64, flags: DIFlagPrivate)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>>", scope: !127, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !601, templateParams: !609, identifier: "d5a6b135a565650efa08e41747f27fbe")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !600, file: !2, baseType: !603, size: 64, align: 64, flags: DIFlagPrivate)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>", baseType: !604, size: 64, align: 64, dwarfAddressSpace: 0)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>", scope: !564, file: !2, size: 704, align: 64, flags: DIFlagPrivate, elements: !605, templateParams: !548, identifier: "54a594ffcdf71a91b2cc141b8489a8dc")
!605 = !{!606, !607, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !604, file: !2, baseType: !574, size: 64, align: 64, flags: DIFlagPrivate)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !604, file: !2, baseType: !574, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !604, file: !2, baseType: !487, size: 576, align: 64, offset: 128, flags: DIFlagPrivate)
!609 = !{!610}
!610 = !DITemplateTypeParameter(name: "T", type: !604)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !597, file: !2, baseType: !612, align: 8, offset: 64, flags: DIFlagPrivate)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>>>", scope: !185, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !609, identifier: "782a1a0a6741e7ea650d4643fddde483")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !597, file: !2, baseType: !191, align: 8, offset: 64, flags: DIFlagPrivate)
!614 = !{!549, !194}
!615 = !{!616}
!616 = !DITemplateTypeParameter(name: "Fut", type: !505)
!617 = !{!618}
!618 = !DITemplateTypeParameter(name: "T", type: !579)
!619 = !{!620}
!620 = !DITemplateTypeParameter(name: "T", type: !571)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !563, file: !2, baseType: !191, align: 8, offset: 64, flags: DIFlagPrivate)
!622 = !{!618, !194}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !487, file: !2, baseType: !88, size: 8, align: 8, offset: 512, flags: DIFlagProtected)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "woken", scope: !487, file: !2, baseType: !88, size: 8, align: 8, offset: 520, flags: DIFlagProtected)
!625 = !{!626}
!626 = !DILocalVariable(arg: 1, scope: !482, file: !483, line: 542, type: !486)
!627 = !DILocation(line: 0, scope: !482)
!628 = !DILocation(line: 542, column: 1, scope: !482)
!629 = !DILocalVariable(name: "self", arg: 1, scope: !630, file: !631, line: 110, type: !635)
!630 = distinct !DISubprogram(name: "drop<futures_task::future_obj::FutureObj<()>>", linkageName: "_ZN104_$LT$futures_util..stream..futures_unordered..task..Task$LT$Fut$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h2576dd5848181d0cE", scope: !632, file: !631, line: 110, type: !633, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !615, retainedNodes: !636)
!631 = !DIFile(filename: "src/stream/futures_unordered/task.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/futures-util-0.3.29", checksumkind: CSK_MD5, checksum: "c663735f148946ea950dd2fe2c1aa370")
!632 = !DINamespace(name: "{impl#4}", scope: !488)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::FutureObj<()>>", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !{!629}
!637 = !DILocation(line: 0, scope: !630, inlinedAt: !638)
!638 = distinct !DILocation(line: 542, column: 1, scope: !482)
!639 = !DILocalVariable(name: "self", arg: 1, scope: !640, file: !641, line: 609, type: !648)
!640 = distinct !DILexicalBlock(scope: !642, file: !641, line: 609, column: 5)
!641 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "1839402b3e3d27abc7bbff44f5b669ff")
!642 = distinct !DISubprogram(name: "is_some<futures_task::future_obj::FutureObj<()>>", linkageName: "_ZN4core6option15Option$LT$T$GT$7is_some17h56e41b7bbb9d65a9E", scope: !497, file: !641, line: 609, type: !643, scopeLine: 609, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !503, declaration: !646, retainedNodes: !647)
!643 = !DISubroutineType(types: !644)
!644 = !{!209, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<futures_task::future_obj::FutureObj<()>>", baseType: !497, size: 64, align: 64, dwarfAddressSpace: 0)
!646 = !DISubprogram(name: "is_some<futures_task::future_obj::FutureObj<()>>", linkageName: "_ZN4core6option15Option$LT$T$GT$7is_some17h56e41b7bbb9d65a9E", scope: !497, file: !641, line: 609, type: !643, scopeLine: 609, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !503)
!647 = !{!639}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<futures_task::future_obj::FutureObj<()>>", baseType: !497, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DILocation(line: 0, scope: !640, inlinedAt: !650)
!650 = distinct !DILocation(line: 120, column: 37, scope: !630, inlinedAt: !638)
!651 = !DILocation(line: 610, column: 18, scope: !640, inlinedAt: !650)
!652 = !DILocation(line: 457, column: 9, scope: !653, inlinedAt: !650)
!653 = !DILexicalBlockFile(scope: !640, file: !654, discriminator: 0)
!654 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/macros/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ce7e9e584d23e87cb143e4f77a5b9149")
!655 = !DILocation(line: 121, column: 17, scope: !630, inlinedAt: !638)
!656 = !DILocalVariable(arg: 1, scope: !657, file: !483, line: 542, type: !660)
!657 = distinct !DISubprogram(name: "drop_in_place<core::cell::UnsafeCell<core::option::Option<futures_task::future_obj::FutureObj<()>>>>", linkageName: "_ZN4core3ptr130drop_in_place$LT$core..cell..UnsafeCell$LT$core..option..Option$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$$GT$17h91cde99b78dc4bcaE", scope: !123, file: !483, line: 542, type: !658, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !662, retainedNodes: !661)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::cell::UnsafeCell<core::option::Option<futures_task::future_obj::FutureObj<()>>>", baseType: !494, size: 64, align: 64, dwarfAddressSpace: 0)
!661 = !{!656}
!662 = !{!663}
!663 = !DITemplateTypeParameter(name: "T", type: !494)
!664 = !DILocation(line: 0, scope: !657, inlinedAt: !665)
!665 = distinct !DILocation(line: 542, column: 1, scope: !482)
!666 = !DILocalVariable(arg: 1, scope: !667, file: !483, line: 542, type: !648)
!667 = distinct !DISubprogram(name: "drop_in_place<core::option::Option<futures_task::future_obj::FutureObj<()>>>", linkageName: "_ZN4core3ptr100drop_in_place$LT$core..option..Option$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$17hcf009d9cd62e11e0E", scope: !123, file: !483, line: 542, type: !668, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !537, retainedNodes: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !648}
!670 = !{!666}
!671 = !DILocation(line: 0, scope: !667, inlinedAt: !672)
!672 = distinct !DILocation(line: 542, column: 1, scope: !657, inlinedAt: !665)
!673 = !DILocalVariable(arg: 1, scope: !674, file: !483, line: 542, type: !677)
!674 = distinct !DISubprogram(name: "drop_in_place<futures_task::future_obj::FutureObj<()>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$17hacecf1416a43ea60E", scope: !123, file: !483, line: 542, type: !675, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !503, retainedNodes: !678)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut futures_task::future_obj::FutureObj<()>", baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!678 = !{!673}
!679 = !DILocation(line: 0, scope: !674, inlinedAt: !680)
!680 = distinct !DILocation(line: 542, column: 1, scope: !667, inlinedAt: !672)
!681 = !DILocalVariable(arg: 1, scope: !682, file: !483, line: 542, type: !685)
!682 = distinct !DISubprogram(name: "drop_in_place<futures_task::future_obj::LocalFutureObj<()>>", linkageName: "_ZN4core3ptr77drop_in_place$LT$futures_task..future_obj..LocalFutureObj$LT$$LP$$RP$$GT$$GT$17h60a2182341d2eb86E", scope: !123, file: !483, line: 542, type: !683, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !687, retainedNodes: !686)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut futures_task::future_obj::LocalFutureObj<()>", baseType: !510, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !{!681}
!687 = !{!688}
!688 = !DITemplateTypeParameter(name: "T", type: !510)
!689 = !DILocation(line: 0, scope: !682, inlinedAt: !690)
!690 = distinct !DILocation(line: 542, column: 1, scope: !674, inlinedAt: !680)
!691 = !DILocalVariable(name: "self", arg: 1, scope: !692, file: !693, line: 89, type: !697)
!692 = distinct !DISubprogram(name: "drop<()>", linkageName: "_ZN91_$LT$futures_task..future_obj..LocalFutureObj$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hec20511b650dd2f1E", scope: !694, file: !693, line: 89, type: !695, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !377, retainedNodes: !698)
!693 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/futures-task-0.3.30/src/future_obj.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e5fa29c66ba23c557512ec930a73803")
!694 = !DINamespace(name: "{impl#5}", scope: !506)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut futures_task::future_obj::LocalFutureObj<()>", baseType: !510, size: 64, align: 64, dwarfAddressSpace: 0)
!698 = !{!691}
!699 = !DILocation(line: 0, scope: !692, inlinedAt: !700)
!700 = distinct !DILocation(line: 542, column: 1, scope: !682, inlinedAt: !690)
!701 = !DILocation(line: 90, column: 33, scope: !692, inlinedAt: !700)
!702 = !{!703, !705, !707, !709, !711}
!703 = distinct !{!703, !704, !"_ZN91_$LT$futures_task..future_obj..LocalFutureObj$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hec20511b650dd2f1E: %self"}
!704 = distinct !{!704, !"_ZN91_$LT$futures_task..future_obj..LocalFutureObj$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hec20511b650dd2f1E"}
!705 = distinct !{!705, !706, !"_ZN4core3ptr77drop_in_place$LT$futures_task..future_obj..LocalFutureObj$LT$$LP$$RP$$GT$$GT$17h60a2182341d2eb86E: %_1"}
!706 = distinct !{!706, !"_ZN4core3ptr77drop_in_place$LT$futures_task..future_obj..LocalFutureObj$LT$$LP$$RP$$GT$$GT$17h60a2182341d2eb86E"}
!707 = distinct !{!707, !708, !"_ZN4core3ptr72drop_in_place$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$17hacecf1416a43ea60E: %_1"}
!708 = distinct !{!708, !"_ZN4core3ptr72drop_in_place$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$17hacecf1416a43ea60E"}
!709 = distinct !{!709, !710, !"_ZN4core3ptr100drop_in_place$LT$core..option..Option$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$17hcf009d9cd62e11e0E: %_1"}
!710 = distinct !{!710, !"_ZN4core3ptr100drop_in_place$LT$core..option..Option$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$17hcf009d9cd62e11e0E"}
!711 = distinct !{!711, !712, !"_ZN4core3ptr130drop_in_place$LT$core..cell..UnsafeCell$LT$core..option..Option$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$$GT$17h91cde99b78dc4bcaE: %_1"}
!712 = distinct !{!712, !"_ZN4core3ptr130drop_in_place$LT$core..cell..UnsafeCell$LT$core..option..Option$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$$GT$17h91cde99b78dc4bcaE"}
!713 = !{!"instruction in unsafe Rust fn or block"}
!714 = !DILocation(line: 90, column: 18, scope: !692, inlinedAt: !700)
!715 = !{!716}
!716 = distinct !{!716, !717, !"_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E: %self"}
!717 = distinct !{!717, !"_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E"}
!718 = !DILocalVariable(arg: 1, scope: !719, file: !483, line: 542, type: !722)
!719 = distinct !DISubprogram(name: "drop_in_place<alloc::sync::Weak<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>>", linkageName: "_ZN4core3ptr181drop_in_place$LT$alloc..sync..Weak$LT$futures_util..stream..futures_unordered..ready_to_run_queue..ReadyToRunQueue$LT$futures_task..future_obj..FutureObj$LT$$LP$$RP$$GT$$GT$$GT$$GT$17h14949ac4d8ba5ac5E", scope: !123, file: !483, line: 542, type: !720, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !724, retainedNodes: !723)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::sync::Weak<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", baseType: !563, size: 64, align: 64, dwarfAddressSpace: 0)
!723 = !{!718}
!724 = !{!725}
!725 = !DITemplateTypeParameter(name: "T", type: !563)
!726 = !DILocation(line: 0, scope: !719, inlinedAt: !727)
!727 = distinct !DILocation(line: 542, column: 1, scope: !482)
!728 = !DILocalVariable(name: "val", scope: !729, file: !730, line: 2686, type: !9, align: 8)
!729 = distinct !DILexicalBlock(scope: !731, file: !730, line: 2686, column: 13)
!730 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "3974e4024eb8e2ba36045270da58dc5a")
!731 = distinct !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17h83dbbb1e9ac08f15E", scope: !574, file: !730, line: 2686, type: !732, scopeLine: 2686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !27, declaration: !735, retainedNodes: !736)
!732 = !DISubroutineType(types: !733)
!733 = !{!9, !734, !9, !228}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !574, size: 64, align: 64, dwarfAddressSpace: 0)
!735 = !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17h83dbbb1e9ac08f15E", scope: !574, file: !730, line: 2686, type: !732, scopeLine: 2686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!736 = !{!737, !728, !738}
!737 = !DILocalVariable(name: "self", arg: 1, scope: !729, file: !730, line: 2686, type: !734)
!738 = !DILocalVariable(name: "order", scope: !729, file: !730, line: 2686, type: !228, align: 1)
!739 = !DILocation(line: 0, scope: !729, inlinedAt: !740)
!740 = distinct !DILocation(line: 3133, column: 23, scope: !741, inlinedAt: !757)
!741 = distinct !DILexicalBlock(scope: !743, file: !742, line: 3131, column: 9)
!742 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/sync.rs", directory: "", checksumkind: CSK_MD5, checksum: "d97152ce06873160e4001a6951abf5fd")
!743 = distinct !DISubprogram(name: "drop<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E", scope: !744, file: !742, line: 3122, type: !745, scopeLine: 3122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !622, retainedNodes: !748)
!744 = !DINamespace(name: "{impl#44}", scope: !564)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::sync::Weak<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", baseType: !563, size: 64, align: 64, dwarfAddressSpace: 0)
!748 = !{!749, !750, !750, !755, !755}
!749 = !DILocalVariable(name: "self", arg: 1, scope: !743, file: !742, line: 3122, type: !747)
!750 = !DILocalVariable(name: "inner", scope: !741, file: !742, line: 3131, type: !751, align: 8)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "WeakInner", scope: !564, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !752, templateParams: !27, identifier: "4a9660f4a1aa23cea9319ec4a01f0825")
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !751, file: !2, baseType: !734, size: 64, align: 64, flags: DIFlagPrivate)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !751, file: !2, baseType: !734, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!755 = !DILocalVariable(name: "inner", scope: !756, file: !742, line: 3131, type: !751, align: 8)
!756 = distinct !DILexicalBlock(scope: !743, file: !742, line: 3131, column: 55)
!757 = distinct !DILocation(line: 542, column: 1, scope: !719, inlinedAt: !727)
!758 = !DILocalVariable(name: "val", scope: !759, file: !730, line: 3344, type: !9, align: 8)
!759 = distinct !DILexicalBlock(scope: !760, file: !730, line: 3344, column: 1)
!760 = distinct !DISubprogram(name: "atomic_sub<usize>", linkageName: "_ZN4core4sync6atomic10atomic_sub17hca7fe122ea90ffcfE", scope: !73, file: !730, line: 3344, type: !761, scopeLine: 3344, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !456, retainedNodes: !764)
!761 = !DISubroutineType(types: !762)
!762 = !{!9, !763, !9, !228}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!764 = !{!765, !758, !766}
!765 = !DILocalVariable(name: "dst", arg: 1, scope: !759, file: !730, line: 3344, type: !763)
!766 = !DILocalVariable(name: "order", scope: !759, file: !730, line: 3344, type: !228, align: 1)
!767 = !DILocation(line: 0, scope: !759, inlinedAt: !768)
!768 = distinct !DILocation(line: 2688, column: 26, scope: !729, inlinedAt: !740)
!769 = !DILocalVariable(name: "order", scope: !770, file: !730, line: 3637, type: !228, align: 1)
!770 = distinct !DILexicalBlock(scope: !771, file: !730, line: 3637, column: 1)
!771 = distinct !DISubprogram(name: "fence", linkageName: "_ZN4core4sync6atomic5fence17h8c0e8cfbe12bcb90E", scope: !73, file: !730, line: 3637, type: !772, scopeLine: 3637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !27, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !228}
!774 = !{!769}
!775 = !DILocation(line: 0, scope: !770, inlinedAt: !776)
!776 = distinct !DILocation(line: 64, column: 9, scope: !741, inlinedAt: !757)
!777 = !DILocation(line: 0, scope: !743, inlinedAt: !757)
!778 = !DILocalVariable(name: "self", arg: 1, scope: !779, file: !742, line: 2982, type: !747)
!779 = distinct !DILexicalBlock(scope: !780, file: !742, line: 2982, column: 5)
!780 = distinct !DISubprogram(name: "inner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", linkageName: "_ZN5alloc4sync17Weak$LT$T$C$A$GT$5inner17h3eb8b5fb42519197E", scope: !563, file: !742, line: 2982, type: !781, scopeLine: 2982, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !622, declaration: !797, retainedNodes: !798)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !796}
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::WeakInner>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !784, templateParams: !27, identifier: "4927641db2496eb57810ca0db381e636")
!784 = !{!785}
!785 = !DICompositeType(tag: DW_TAG_variant_part, scope: !783, file: !2, size: 128, align: 64, elements: !786, templateParams: !27, identifier: "33815f7b003ae9cd6e3783bca2c45560", discriminator: !795)
!786 = !{!787, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !785, file: !2, baseType: !788, size: 128, align: 64, extraData: i128 0)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !783, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !789, identifier: "d15b55fb6008d3de154fe3803704c7e2")
!789 = !{!790}
!790 = !DITemplateTypeParameter(name: "T", type: !751)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !785, file: !2, baseType: !792, size: 128, align: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !783, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !793, templateParams: !789, identifier: "54461c7235261262d9db67d02cb645e4")
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !792, file: !2, baseType: !751, size: 128, align: 64, flags: DIFlagPublic)
!795 = !DIDerivedType(tag: DW_TAG_member, scope: !783, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::sync::Weak<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", baseType: !563, size: 64, align: 64, dwarfAddressSpace: 0)
!797 = !DISubprogram(name: "inner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>, alloc::alloc::Global>", linkageName: "_ZN5alloc4sync17Weak$LT$T$C$A$GT$5inner17h3eb8b5fb42519197E", scope: !563, file: !742, line: 2982, type: !781, scopeLine: 2982, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !622)
!798 = !{!778, !799}
!799 = !DILocalVariable(name: "ptr", scope: !800, file: !742, line: 2983, type: !801, align: 8)
!800 = distinct !DILexicalBlock(scope: !779, file: !742, line: 2983, column: 9)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::sync::ArcInner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>>", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!802 = !DILocation(line: 0, scope: !779, inlinedAt: !803)
!803 = distinct !DILocation(line: 3131, column: 47, scope: !756, inlinedAt: !757)
!804 = !DILocalVariable(name: "ptr", arg: 1, scope: !805, file: !806, line: 2913, type: !570)
!805 = distinct !DILexicalBlock(scope: !807, file: !806, line: 2913, column: 1)
!806 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/rc.rs", directory: "", checksumkind: CSK_MD5, checksum: "68e71db250225b207c12fb1a749ea8d0")
!807 = distinct !DISubprogram(name: "is_dangling<alloc::sync::ArcInner<futures_util::stream::futures_unordered::ready_to_run_queue::ReadyToRunQueue<futures_task::future_obj::FutureObj<()>>>>", linkageName: "_ZN5alloc2rc11is_dangling17h8ec67e32d4e50343E", scope: !808, file: !806, line: 2913, type: !809, scopeLine: 2913, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !619, retainedNodes: !811)
!808 = !DINamespace(name: "rc", scope: !114)
!809 = !DISubroutineType(types: !810)
!810 = !{!209, !570}
!811 = !{!804}
!812 = !DILocation(line: 0, scope: !805, inlinedAt: !813)
!813 = distinct !DILocation(line: 2984, column: 12, scope: !800, inlinedAt: !803)
!814 = !DILocation(line: 0, scope: !800, inlinedAt: !803)
!815 = !DILocation(line: 2914, column: 5, scope: !805, inlinedAt: !813)
!816 = !DILocation(line: 2984, column: 12, scope: !800, inlinedAt: !803)
!817 = !DILocation(line: 2990, column: 69, scope: !800, inlinedAt: !803)
!818 = !DILocation(line: 0, scope: !741, inlinedAt: !757)
!819 = !DILocation(line: 0, scope: !756, inlinedAt: !757)
!820 = !DILocation(line: 3350, column: 24, scope: !759, inlinedAt: !768)
!821 = !{!822}
!822 = distinct !{!822, !823, !"_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E: %self"}
!823 = distinct !{!823, !"_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E"}
!824 = !DILocation(line: 3133, column: 12, scope: !741, inlinedAt: !757)
!825 = !DILocation(line: 3641, column: 24, scope: !770, inlinedAt: !776)
!826 = !DILocalVariable(name: "layout", arg: 3, scope: !827, file: !828, line: 252, type: !837)
!827 = distinct !DISubprogram(name: "deallocate", linkageName: "_ZN63_$LT$alloc..alloc..Global$u20$as$u20$core..alloc..Allocator$GT$10deallocate17h0f2d39528d187dc6E", scope: !829, file: !828, line: 252, type: !830, scopeLine: 252, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !27, retainedNodes: !846)
!828 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/alloc.rs", directory: "", checksumkind: CSK_MD5, checksum: "6687e3e140ed9b8c51f77000a3d3a272")
!829 = !DINamespace(name: "{impl#1}", scope: !192)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !832, !833, !837}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::alloc::Global", baseType: !191, size: 64, align: 64, dwarfAddressSpace: 0)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !127, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !834, templateParams: !94, identifier: "a4acf166b74ef43af1db8d6335ca167e")
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !833, file: !2, baseType: !836, size: 64, align: 64, flags: DIFlagPrivate)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !838, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !840, templateParams: !27, identifier: "e53210ff23d6d7b64d0c502d9cf034c2")
!838 = !DINamespace(name: "layout", scope: !839)
!839 = !DINamespace(name: "alloc", scope: !21)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !837, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !837, file: !2, baseType: !843, size: 64, align: 64, flags: DIFlagPrivate)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !244, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !844, templateParams: !27, identifier: "d52b523600ea492069fdcf2d89e5e6af")
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !843, file: !2, baseType: !243, size: 64, align: 64, flags: DIFlagPrivate)
!846 = !{!847, !848, !826}
!847 = !DILocalVariable(name: "self", arg: 1, scope: !827, file: !828, line: 252, type: !832)
!848 = !DILocalVariable(name: "ptr", arg: 2, scope: !827, file: !828, line: 252, type: !833)
!849 = !DILocation(line: 0, scope: !827, inlinedAt: !850)
!850 = distinct !DILocation(line: 3145, column: 17, scope: !741, inlinedAt: !757)
!851 = !DILocalVariable(name: "ptr", arg: 1, scope: !852, file: !828, line: 118, type: !856)
!852 = distinct !DILexicalBlock(scope: !853, file: !828, line: 118, column: 1)
!853 = distinct !DISubprogram(name: "dealloc", linkageName: "_ZN5alloc5alloc7dealloc17h50c1b4509c737c52E", scope: !192, file: !828, line: 118, type: !854, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !27, retainedNodes: !857)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !856, !837}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!857 = !{!851, !858}
!858 = !DILocalVariable(name: "layout", arg: 2, scope: !852, file: !828, line: 118, type: !837)
!859 = !DILocation(line: 0, scope: !852, inlinedAt: !860)
!860 = distinct !DILocation(line: 256, column: 22, scope: !827, inlinedAt: !850)
!861 = !DILocation(line: 119, column: 14, scope: !852, inlinedAt: !860)
!862 = !DILocation(line: 3133, column: 9, scope: !741, inlinedAt: !757)
!863 = !DILocation(line: 0, scope: !657, inlinedAt: !864)
!864 = distinct !DILocation(line: 542, column: 1, scope: !482)
!865 = !DILocation(line: 0, scope: !667, inlinedAt: !866)
!866 = distinct !DILocation(line: 542, column: 1, scope: !657, inlinedAt: !864)
!867 = !DILocation(line: 0, scope: !719, inlinedAt: !868)
!868 = distinct !DILocation(line: 542, column: 1, scope: !482)
!869 = !DILocation(line: 0, scope: !729, inlinedAt: !870)
!870 = distinct !DILocation(line: 3133, column: 23, scope: !741, inlinedAt: !871)
!871 = distinct !DILocation(line: 542, column: 1, scope: !719, inlinedAt: !868)
!872 = !DILocation(line: 0, scope: !759, inlinedAt: !873)
!873 = distinct !DILocation(line: 2688, column: 26, scope: !729, inlinedAt: !870)
!874 = !DILocation(line: 0, scope: !770, inlinedAt: !875)
!875 = distinct !DILocation(line: 64, column: 9, scope: !741, inlinedAt: !871)
!876 = !DILocation(line: 0, scope: !743, inlinedAt: !871)
!877 = !DILocation(line: 0, scope: !779, inlinedAt: !878)
!878 = distinct !DILocation(line: 3131, column: 47, scope: !756, inlinedAt: !871)
!879 = !DILocation(line: 0, scope: !805, inlinedAt: !880)
!880 = distinct !DILocation(line: 2984, column: 12, scope: !800, inlinedAt: !878)
!881 = !DILocation(line: 0, scope: !800, inlinedAt: !878)
!882 = !DILocation(line: 2914, column: 5, scope: !805, inlinedAt: !880)
!883 = !DILocation(line: 2984, column: 12, scope: !800, inlinedAt: !878)
!884 = !DILocation(line: 2990, column: 69, scope: !800, inlinedAt: !878)
!885 = !DILocation(line: 0, scope: !741, inlinedAt: !871)
!886 = !DILocation(line: 0, scope: !756, inlinedAt: !871)
!887 = !DILocation(line: 3350, column: 24, scope: !759, inlinedAt: !873)
!888 = !{!889}
!889 = distinct !{!889, !890, !"_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E: %self"}
!890 = distinct !{!890, !"_ZN72_$LT$alloc..sync..Weak$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf9b740063da89897E"}
!891 = !DILocation(line: 3133, column: 12, scope: !741, inlinedAt: !871)
!892 = !DILocation(line: 3641, column: 24, scope: !770, inlinedAt: !875)
!893 = !DILocation(line: 0, scope: !827, inlinedAt: !894)
!894 = distinct !DILocation(line: 3145, column: 17, scope: !741, inlinedAt: !871)
!895 = !DILocation(line: 0, scope: !852, inlinedAt: !896)
!896 = distinct !DILocation(line: 256, column: 22, scope: !827, inlinedAt: !894)
!897 = !DILocation(line: 119, column: 14, scope: !852, inlinedAt: !896)
!898 = !DILocation(line: 3133, column: 9, scope: !741, inlinedAt: !871)
!899 = distinct !DISubprogram(name: "drop_in_place<futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::LocalFutureObj<()>>>", linkageName: "_ZN4core3ptr136drop_in_place$LT$futures_util..stream..futures_unordered..task..Task$LT$futures_task..future_obj..LocalFutureObj$LT$$LP$$RP$$GT$$GT$$GT$17h36fc798ff47941cfE", scope: !123, file: !483, line: 542, type: !900, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !225, templateParams: !931, retainedNodes: !989)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut futures_util::stream::futures_unordered::task::Task<futures_task::future_obj::LocalFutureObj<()>>", baseType: !903, size: 64, align: 64, dwarfAddressSpace: 0)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "Task<futures_task::future_obj::LocalFutureObj<()>>", scope: !488, file: !2, size: 576, align: 64, flags: DIFlagProtected, elements: !904, templateParams: !979, identifier: "2a3ce35ffed13b6c9f8bb3565e1ea38")
!904 = !{!905, !922, !933, !940, !941, !942, !987, !988}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "future", scope: !903, file: !2, baseType: !906, size: 192, align: 64, offset: 64, flags: DIFlagProtected)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<futures_task::future_obj::LocalFutureObj<()>>>", scope: !78, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !907, templateParams: !920, identifier: "1d510795b5394c6b738f74dbcda6806")
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !906, file: !2, baseType: !909, size: 192, align: 64, flags: DIFlagPrivate)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<futures_task::future_obj::LocalFutureObj<()>>", scope: !20, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !910, templateParams: !27, identifier: "21f827a9d388f65c4ad95f62cc11dfc9")
!910 = !{!911}
!911 = !DICompositeType(tag: DW_TAG_variant_part, scope: !909, file: !2, size: 192, align: 64, elements: !912, templateParams: !27, identifier: "9cc6ee82840388ddf4bb9d5ad96b23c7", discriminator: !919)
!912 = !{!913, !915}
