; ModuleID = 'parking.24b6bc11fb99ad84-cgu.0'
source_filename = "parking.24b6bc11fb99ad84-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }

@_ZN3std9panicking11panic_count18GLOBAL_PANIC_COUNT17h00e7dcd913cdfbe0E = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"
@vtable.0 = private constant <{ [24 x i8], ptr, ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\10\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN91_$LT$std..panicking..begin_panic..Payload$LT$A$GT$$u20$as$u20$core..panic..PanicPayload$GT$8take_box17h21e525f0eb9cdbc7E", ptr @"_ZN91_$LT$std..panicking..begin_panic..Payload$LT$A$GT$$u20$as$u20$core..panic..PanicPayload$GT$3get17hc1e1b1682acbcfc9E" }>, align 8, !dbg !0
@alloc_00ae4b301f7fab8ac9617c03fcbd7274 = private unnamed_addr constant <{ [43 x i8] }> <{ [43 x i8] c"called `Result::unwrap()` on an `Err` value" }>, align 1
@vtable.1 = private constant <{ ptr, [16 x i8], ptr }> <{ ptr @"_ZN4core3ptr103drop_in_place$LT$std..sync..poison..PoisonError$LT$std..sync..mutex..MutexGuard$LT$$LP$$RP$$GT$$GT$$GT$17h465d2841064f4186E", [16 x i8] c"\10\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN76_$LT$std..sync..poison..PoisonError$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17h6abac804f2131a5fE" }>, align 8, !dbg !44

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::panicking::begin_panic::Payload<&str> as core::panic::PanicPayload>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::panicking::begin_panic::Payload<&str> as core::panic::PanicPayload>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !13, templateParams: !27, identifier: "4d8b3c0140605c50495b45d94d6d5a84")
!4 = !{!5, !8, !10, !11, !12}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload<&str>", scope: !14, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !17, templateParams: !42, identifier: "4d4e0a9d220d367280f5a92851d927cf")
!14 = !DINamespace(name: "begin_panic", scope: !15)
!15 = !DINamespace(name: "panicking", scope: !16)
!16 = !DINamespace(name: "std", scope: null)
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !13, file: !2, baseType: !19, size: 128, align: 64, flags: DIFlagProtected)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !22, templateParams: !27, identifier: "c9cc8e2c9bc8d3061e54de437c9b5882")
!20 = !DINamespace(name: "option", scope: !21)
!21 = !DINamespace(name: "core", scope: null)
!22 = !{!23}
!23 = !DICompositeType(tag: DW_TAG_variant_part, scope: !19, file: !2, size: 128, align: 64, elements: !24, templateParams: !27, identifier: "dc91c89dee9d03b772ff0b7d0b60a9cb", discriminator: !40)
!24 = !{!25, !36}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !23, file: !2, baseType: !26, size: 128, align: 64, extraData: i128 0)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !19, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !28, identifier: "20871c480156d021cbbc4b2eec20a35c")
!27 = !{}
!28 = !{!29}
!29 = !DITemplateTypeParameter(name: "T", type: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !31, templateParams: !27, identifier: "9277eecd40495f85161460476aacc992")
!31 = !{!32, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !30, file: !2, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !30, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !23, file: !2, baseType: !37, size: 128, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !19, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !38, templateParams: !28, identifier: "2bd48e68865dce7a72b4a9887ea344e7")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !30, size: 128, align: 64, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, scope: !19, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!41 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!42 = !{!43}
!43 = !DITemplateTypeParameter(name: "A", type: !30)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<()>> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<()>> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !47, vtableHolder: !52, templateParams: !27, identifier: "e3a2c8b379760d74e3498531f669b9ca")
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !46, file: !2, baseType: !6, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !46, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !46, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<std::sync::mutex::MutexGuard<()>>", scope: !53, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !107, identifier: "5cb1ff6b7e53494e402377e13c71a88f")
!53 = !DINamespace(name: "poison", scope: !54)
!54 = !DINamespace(name: "sync", scope: !16)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !52, file: !2, baseType: !57, size: 128, align: 64, flags: DIFlagPrivate)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "MutexGuard<()>", scope: !58, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !100, identifier: "8e688f6ba995f8cc8146cd5ffe4f4d8e")
!58 = !DINamespace(name: "mutex", scope: !54)
!59 = !{!60, !102}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !57, file: !2, baseType: !61, size: 64, align: 64, flags: DIFlagPrivate)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::mutex::Mutex<()>", baseType: !62, size: 64, align: 64, dwarfAddressSpace: 0)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !58, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !63, templateParams: !100, identifier: "d5fd249575a8d955fed7c24d847ce0e7")
!63 = !{!64, !84, !96}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !62, file: !2, baseType: !65, size: 32, align: 32, flags: DIFlagPrivate)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !66, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !70, templateParams: !27, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!66 = !DINamespace(name: "futex", scope: !67)
!67 = !DINamespace(name: "mutex", scope: !68)
!68 = !DINamespace(name: "sync", scope: !69)
!69 = !DINamespace(name: "sys", scope: !16)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !65, file: !2, baseType: !72, size: 32, align: 32, flags: DIFlagPrivate)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !73, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !75, templateParams: !27, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!73 = !DINamespace(name: "atomic", scope: !74)
!74 = !DINamespace(name: "sync", scope: !21)
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !72, file: !2, baseType: !77, size: 32, align: 32, flags: DIFlagPrivate)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !78, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !79, templateParams: !82, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!78 = !DINamespace(name: "cell", scope: !21)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !77, file: !2, baseType: !81, size: 32, align: 32, flags: DIFlagPrivate)
!81 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "T", type: !81)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !62, file: !2, baseType: !85, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !53, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !86, templateParams: !27, identifier: "f02169750979dbd37c1ab4c868f04f71")
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !85, file: !2, baseType: !88, size: 8, align: 8, flags: DIFlagPrivate)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !73, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !89, templateParams: !27, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !88, file: !2, baseType: !91, size: 8, align: 8, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !78, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !92, templateParams: !94, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagPrivate)
!94 = !{!95}
!95 = !DITemplateTypeParameter(name: "T", type: !34)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !2, baseType: !97, align: 8, offset: 40, flags: DIFlagPrivate)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !78, file: !2, align: 8, flags: DIFlagPublic, elements: !98, templateParams: !100, identifier: "df2a04390e4e7561d08d0a5a22c77b4a")
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !97, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!100 = !{!101}
!101 = !DITemplateTypeParameter(name: "T", type: !7)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !57, file: !2, baseType: !103, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Guard", scope: !53, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !104, templateParams: !27, identifier: "d9443e3e6bb8ddba7b9137625ad6dc21")
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "panicking", scope: !103, file: !2, baseType: !106, size: 8, align: 8, flags: DIFlagPrivate)
!106 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!107 = !{!108}
!108 = !DITemplateTypeParameter(name: "T", type: !57)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "<std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !112, vtableHolder: !117, templateParams: !27, identifier: "4623dc9419a72507cffd81e2e148026")
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !111, file: !2, baseType: !6, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !111, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>", scope: !53, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !118, templateParams: !128, identifier: "2e5e9886dc0f12aca2c70d9a26d1319a")
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "guard", scope: !117, file: !2, baseType: !120, size: 192, align: 64, flags: DIFlagPrivate)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)", file: !2, size: 192, align: 64, elements: !121, templateParams: !27, identifier: "a4294ac3818cc6ff5ab1c7c14038288b")
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !57, size: 128, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !120, file: !2, baseType: !124, size: 8, align: 8, offset: 128)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "WaitTimeoutResult", scope: !125, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !126, templateParams: !27, identifier: "52e4c1d5aa834b32d644882c2f3fe365")
!125 = !DINamespace(name: "condvar", scope: !54)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !124, file: !2, baseType: !106, size: 8, align: 8, flags: DIFlagPrivate)
!128 = !{!129}
!129 = !DITemplateTypeParameter(name: "T", type: !120)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !133, vtableHolder: !138, templateParams: !27, identifier: "84b1534180bf746fe7f84d518dd21fd7")
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !132, file: !2, baseType: !6, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !132, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !132, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "<&str as core::any::Any>::{vtable}", scope: null, file: !2, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::any::Any>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !142, vtableHolder: !30, templateParams: !27, identifier: "5adec2b5c980c23f6b7a3d8e04860d6")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !141, file: !2, baseType: !6, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !141, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !141, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !141, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!147 = !{i32 8, !"PIC Level", i32 2}
!148 = !{i32 2, !"RtLibUseGOT", i32 1}
!149 = !{i32 2, !"Dwarf Version", i32 4}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{!"rustc version 1.80.0-dev"}
!152 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !153, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !154, globals: !244, splitDebugInlining: false, nameTableKind: None)
!153 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/parking-2.2.0/src/lib.rs/@/parking.24b6bc11fb99ad84-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/parking-2.2.0")
!154 = !{!155, !162, !170, !238}
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !73, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !156)
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!158 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!159 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!161 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !163, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !165)
!163 = !DINamespace(name: "rt", scope: !164)
!164 = !DINamespace(name: "fmt", scope: !21)
!165 = !{!166, !167, !168, !169}
!166 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!167 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !171, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagEnumClass, elements: !173)
!171 = !DINamespace(name: "alignment", scope: !172)
!172 = !DINamespace(name: "ptr", scope: !21)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!174 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!196 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!197 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!198 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!199 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!200 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!201 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!202 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!203 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!204 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!205 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!206 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!207 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!208 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!209 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!210 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!211 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!212 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!213 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!220 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!221 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!222 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!223 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!224 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!225 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!226 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!227 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!228 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!229 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!230 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!231 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!232 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!233 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!234 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!235 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!236 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!237 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !239, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagEnumClass, elements: !240)
!239 = !DINamespace(name: "panicking", scope: !21)
!240 = !{!241, !242, !243}
!241 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!242 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!243 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!244 = !{!0, !44, !109, !130, !139}
!245 = distinct !DISubprogram(name: "type_id<&str>", linkageName: "_ZN36_$LT$T$u20$as$u20$core..any..Any$GT$7type_id17hdd6fb87170c69891E", scope: !247, file: !246, line: 141, type: !249, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !28, retainedNodes: !259)
!246 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/any.rs", directory: "", checksumkind: CSK_MD5, checksum: "00055574bf7465cae7be22ab5c9966c5")
!247 = !DINamespace(name: "{impl#0}", scope: !248)
!248 = !DINamespace(name: "any", scope: !21)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !258}
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !248, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !252, templateParams: !27, identifier: "1f815785d12164cd5cc5e245629d60e2")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !251, file: !2, baseType: !254, size: 128, align: 64, flags: DIFlagPrivate)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, u64)", file: !2, size: 128, align: 64, elements: !255, templateParams: !27, identifier: "19e9be5b2400f26b5a124525aae10cbb")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !2, baseType: !41, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !254, file: !2, baseType: !41, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!259 = !{!260}
!260 = !DILocalVariable(name: "self", arg: 1, scope: !245, file: !246, line: 141, type: !258)
!261 = !DILocation(line: 0, scope: !245)
!262 = !DILocation(line: 143, column: 6, scope: !245)
!263 = distinct !DISubprogram(name: "__rust_end_short_backtrace<std::panicking::begin_panic::{closure_env#0}<&str>, !>", linkageName: "_ZN3std10sys_common9backtrace26__rust_end_short_backtrace17h75f90317186b0e7fE", scope: !265, file: !264, line: 167, type: !267, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !286, retainedNodes: !281)
!264 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "9a938a0945aa66d12453850743d3bf49")
!265 = !DINamespace(name: "backtrace", scope: !266)
!266 = !DINamespace(name: "sys_common", scope: !16)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !269}
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<&str>", scope: !14, file: !2, size: 192, align: 64, elements: !270, templateParams: !27, identifier: "f3822d9e1f5641f0bb85d124a293d87")
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !269, file: !2, baseType: !30, size: 128, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !269, file: !2, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !275, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !277, templateParams: !27, identifier: "83f60b789274e9dfe5288fdb9ee764d1")
!275 = !DINamespace(name: "location", scope: !276)
!276 = !DINamespace(name: "panic", scope: !21)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !274, file: !2, baseType: !30, size: 128, align: 64, flags: DIFlagPrivate)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !274, file: !2, baseType: !81, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !274, file: !2, baseType: !81, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!281 = !{!282, !283}
!282 = !DILocalVariable(name: "f", arg: 1, scope: !263, file: !264, line: 167, type: !269)
!283 = !DILocalVariable(name: "result", scope: !284, file: !264, line: 171, type: !285, align: 1)
!284 = distinct !DILexicalBlock(scope: !263, file: !264, line: 171, column: 5)
!285 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!286 = !{!287, !288}
!287 = !DITemplateTypeParameter(name: "F", type: !269)
!288 = !DITemplateTypeParameter(name: "T", type: !285)
!289 = !DILocalVariable(name: "dummy", scope: !290, file: !291, line: 337, type: !7, align: 1)
!290 = distinct !DILexicalBlock(scope: !292, file: !291, line: 337, column: 1)
!291 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "36624a7f44e0e372094a9874489ad080")
!292 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h3fe6534cb3c74e55E", scope: !293, file: !291, line: 337, type: !294, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !100, retainedNodes: !296)
!293 = !DINamespace(name: "hint", scope: !21)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !7}
!296 = !{!289}
!297 = !DILocation(line: 337, column: 27, scope: !290, inlinedAt: !298)
!298 = !DILocation(line: 174, column: 5, scope: !284)
!299 = !DILocation(line: 171, column: 9, scope: !284)
!300 = !DILocation(line: 167, column: 41, scope: !263)
!301 = !DILocation(line: 171, column: 18, scope: !263)
!302 = !DILocation(line: 338, column: 5, scope: !290, inlinedAt: !298)
!303 = distinct !DISubprogram(name: "begin_panic<&str>", linkageName: "_ZN3std9panicking11begin_panic17hbd784319a587fc63E", scope: !15, file: !304, line: 687, type: !305, scopeLine: 687, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !311, retainedNodes: !307)
!304 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "60082975e1fd1fd79a46cc5d235d7ad0")
!305 = !DISubroutineType(cc: DW_CC_nocall, types: !306)
!306 = !{null, !30, !273}
!307 = !{!308, !309}
!308 = !DILocalVariable(name: "msg", arg: 1, scope: !303, file: !304, line: 687, type: !30)
!309 = !DILocalVariable(name: "loc", scope: !310, file: !304, line: 692, type: !273, align: 8)
!310 = distinct !DILexicalBlock(scope: !303, file: !304, line: 692, column: 5)
!311 = !{!312}
!312 = !DITemplateTypeParameter(name: "M", type: !30)
!313 = !DILocation(line: 0, scope: !303)
!314 = !DILocation(line: 0, scope: !310)
!315 = !DILocation(line: 693, column: 69, scope: !310)
!316 = !DILocation(line: 693, column: 12, scope: !310)
!317 = distinct !DISubprogram(name: "{closure#0}<&str>", linkageName: "_ZN3std9panicking11begin_panic28_$u7b$$u7b$closure$u7d$$u7d$17h9b31650910108a67E", scope: !14, file: !304, line: 693, type: !267, scopeLine: 693, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !311, retainedNodes: !318)
!318 = !{!319, !320}
!319 = !DILocalVariable(name: "msg", scope: !317, file: !304, line: 687, type: !30, align: 8)
!320 = !DILocalVariable(name: "loc", scope: !317, file: !304, line: 692, type: !273, align: 8)
!321 = !DILocation(line: 687, column: 41, scope: !317)
!322 = !DILocation(line: 692, column: 9, scope: !317)
!323 = !DILocation(line: 695, column: 18, scope: !317)
!324 = !DILocation(line: 695, column: 31, scope: !317)
!325 = !{i64 1}
!326 = !DILocalVariable(name: "inner", arg: 1, scope: !327, file: !304, line: 708, type: !30)
!327 = distinct !DILexicalBlock(scope: !328, file: !304, line: 708, column: 9)
!328 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN3std9panicking11begin_panic16Payload$LT$A$GT$3new17h1161714a5248e95dE", scope: !13, file: !304, line: 708, type: !329, scopeLine: 708, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !42, declaration: !331, retainedNodes: !332)
!329 = !DISubroutineType(types: !330)
!330 = !{!13, !30}
!331 = !DISubprogram(name: "new<&str>", linkageName: "_ZN3std9panicking11begin_panic16Payload$LT$A$GT$3new17h1161714a5248e95dE", scope: !13, file: !304, line: 708, type: !329, scopeLine: 708, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !42)
!332 = !{!326}
!333 = !DILocation(line: 0, scope: !327, inlinedAt: !323)
!334 = !DILocation(line: 709, column: 13, scope: !327, inlinedAt: !323)
!335 = !DILocation(line: 697, column: 13, scope: !317)
!336 = !{i64 8}
!337 = !DILocation(line: 694, column: 9, scope: !317)
!338 = distinct !DISubprogram(name: "fmt<usize>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h0e03cc042f1e9889E", scope: !340, file: !339, line: 2354, type: !341, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !375, retainedNodes: !394)
!339 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!340 = !DINamespace(name: "{impl#51}", scope: !164)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !360, !361}
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !344, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !345, templateParams: !27, identifier: "d2df09569ea43718984b3f07c77d7786")
!344 = !DINamespace(name: "result", scope: !21)
!345 = !{!346}
!346 = !DICompositeType(tag: DW_TAG_variant_part, scope: !343, file: !2, size: 8, align: 8, elements: !347, templateParams: !27, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !359)
!347 = !{!348, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !346, file: !2, baseType: !349, size: 8, align: 8, extraData: i128 0)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !343, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !350, templateParams: !352, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !349, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!352 = !{!101, !353}
!353 = !DITemplateTypeParameter(name: "E", type: !354)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !164, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !346, file: !2, baseType: !356, size: 8, align: 8, extraData: i128 1)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !343, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !357, templateParams: !352, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !356, file: !2, baseType: !354, align: 8, offset: 8, flags: DIFlagPublic)
!359 = !DIDerivedType(tag: DW_TAG_member, scope: !343, file: !2, baseType: !34, size: 8, align: 8, flags: DIFlagArtificial)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&usize", baseType: !138, size: 64, align: 64, dwarfAddressSpace: 0)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !164, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !363, templateParams: !27, identifier: "9d9578b0f9368582a2201563ca126cd4")
!363 = !{!364, !365, !367, !368, !382, !383}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !2, baseType: !81, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !362, file: !2, baseType: !366, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!366 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !362, file: !2, baseType: !162, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !362, file: !2, baseType: !369, size: 128, align: 64, flags: DIFlagPrivate)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !370, templateParams: !27, identifier: "3850c4a210aea148b16f79ec227c427")
!370 = !{!371}
!371 = !DICompositeType(tag: DW_TAG_variant_part, scope: !369, file: !2, size: 128, align: 64, elements: !372, templateParams: !27, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !381)
!372 = !{!373, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !371, file: !2, baseType: !374, size: 128, align: 64, extraData: i128 0)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !369, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !375, identifier: "10be3845cc366e59d680126f255dea8b")
!375 = !{!376}
!376 = !DITemplateTypeParameter(name: "T", type: !9)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !371, file: !2, baseType: !378, size: 128, align: 64, extraData: i128 1)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !369, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !379, templateParams: !375, identifier: "d166501012b6febc55685f1b3285acb8")
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !378, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!381 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !362, file: !2, baseType: !369, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !362, file: !2, baseType: !384, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !385, templateParams: !27, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!385 = !{!386, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !384, file: !2, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !27, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !384, file: !2, baseType: !390, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !391, size: 64, align: 64, dwarfAddressSpace: 0)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 6, lowerBound: 0)
!394 = !{!395, !396}
!395 = !DILocalVariable(name: "self", arg: 1, scope: !338, file: !339, line: 2354, type: !360)
!396 = !DILocalVariable(name: "f", arg: 2, scope: !338, file: !339, line: 2354, type: !361)
!397 = !DILocation(line: 0, scope: !338)
!398 = !DILocation(line: 2354, column: 71, scope: !338)
!399 = !DILocalVariable(name: "self", arg: 1, scope: !400, file: !401, line: 189, type: !138)
!400 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17ha3731fb0f809905cE", scope: !402, file: !401, line: 189, type: !404, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, retainedNodes: !406)
!401 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "5d2b54fa2f493740652965deb7ce1e35")
!402 = !DINamespace(name: "{impl#89}", scope: !403)
!403 = !DINamespace(name: "num", scope: !164)
!404 = !DISubroutineType(types: !405)
!405 = !{!343, !138, !361}
!406 = !{!399, !407}
!407 = !DILocalVariable(name: "f", arg: 2, scope: !400, file: !401, line: 189, type: !361)
!408 = !DILocation(line: 0, scope: !400, inlinedAt: !409)
!409 = distinct !DILocation(line: 2354, column: 62, scope: !338)
!410 = !DILocalVariable(name: "self", arg: 1, scope: !411, file: !339, line: 1907, type: !361)
!411 = distinct !DILexicalBlock(scope: !412, file: !339, line: 1907, column: 5)
!412 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h9aa1604b062df0e6E", scope: !362, file: !339, line: 1907, type: !413, scopeLine: 1907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !416, retainedNodes: !417)
!413 = !DISubroutineType(types: !414)
!414 = !{!106, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Formatter", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!416 = !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h9aa1604b062df0e6E", scope: !362, file: !339, line: 1907, type: !413, scopeLine: 1907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!417 = !{!410}
!418 = !DILocation(line: 0, scope: !411, inlinedAt: !419)
!419 = distinct !DILocation(line: 190, column: 22, scope: !400, inlinedAt: !409)
!420 = !DILocalVariable(name: "self", arg: 1, scope: !421, file: !339, line: 1911, type: !361)
!421 = distinct !DILexicalBlock(scope: !422, file: !339, line: 1911, column: 5)
!422 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h0b52a51434de3210E", scope: !362, file: !339, line: 1911, type: !413, scopeLine: 1911, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !423, retainedNodes: !424)
!423 = !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h0b52a51434de3210E", scope: !362, file: !339, line: 1911, type: !413, scopeLine: 1911, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!424 = !{!420}
!425 = !DILocation(line: 0, scope: !421, inlinedAt: !426)
!426 = distinct !DILocation(line: 192, column: 29, scope: !400, inlinedAt: !409)
!427 = !DILocation(line: 1908, column: 9, scope: !411, inlinedAt: !419)
!428 = !{!429}
!429 = distinct !{!429, !430, !"_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17ha3731fb0f809905cE: %f"}
!430 = distinct !{!430, !"_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17ha3731fb0f809905cE"}
!431 = !{!432}
!432 = distinct !{!432, !430, !"_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17ha3731fb0f809905cE: %self"}
!433 = !DILocation(line: 190, column: 20, scope: !400, inlinedAt: !409)
!434 = !DILocation(line: 1912, column: 9, scope: !421, inlinedAt: !426)
!435 = !DILocation(line: 192, column: 27, scope: !400, inlinedAt: !409)
!436 = !DILocation(line: 191, column: 21, scope: !400, inlinedAt: !409)
!437 = !DILocation(line: 195, column: 21, scope: !400, inlinedAt: !409)
!438 = !DILocation(line: 193, column: 21, scope: !400, inlinedAt: !409)
!439 = !DILocation(line: 2354, column: 84, scope: !338)
!440 = distinct !DISubprogram(name: "drop_in_place<std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<()>>>", linkageName: "_ZN4core3ptr103drop_in_place$LT$std..sync..poison..PoisonError$LT$std..sync..mutex..MutexGuard$LT$$LP$$RP$$GT$$GT$$GT$17h465d2841064f4186E", scope: !172, file: !441, line: 542, type: !442, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !447, retainedNodes: !445)
!441 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "a85d519116fde26821981e2ebfa0ecba")
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sync::poison::PoisonError<std::sync::mutex::MutexGuard<()>>", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!445 = !{!446}
!446 = !DILocalVariable(arg: 1, scope: !440, file: !441, line: 542, type: !444)
!447 = !{!448}
!448 = !DITemplateTypeParameter(name: "T", type: !52)
!449 = !DILocation(line: 0, scope: !440)
!450 = !DILocation(line: 542, column: 1, scope: !440)
!451 = !{!452}
!452 = distinct !{!452, !453, !"_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE: %self"}
!453 = distinct !{!453, !"_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE"}
!454 = !{i64 4}
!455 = !{i8 0, i8 2}
!456 = !DILocalVariable(arg: 1, scope: !457, file: !441, line: 542, type: !460)
!457 = distinct !DISubprogram(name: "drop_in_place<std::sync::mutex::MutexGuard<()>>", linkageName: "_ZN4core3ptr65drop_in_place$LT$std..sync..mutex..MutexGuard$LT$$LP$$RP$$GT$$GT$17hff36ae560a8a270bE", scope: !172, file: !441, line: 542, type: !458, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !107, retainedNodes: !461)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sync::mutex::MutexGuard<()>", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !{!456}
!462 = !DILocation(line: 0, scope: !457, inlinedAt: !463)
!463 = distinct !DILocation(line: 542, column: 1, scope: !440)
!464 = !DILocalVariable(name: "val", scope: !465, file: !466, line: 2459, type: !81, align: 4)
!465 = distinct !DILexicalBlock(scope: !467, file: !466, line: 2459, column: 13)
!466 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "3974e4024eb8e2ba36045270da58dc5a")
!467 = distinct !DISubprogram(name: "swap", linkageName: "_ZN4core4sync6atomic9AtomicU324swap17hd3da0ae859969405E", scope: !72, file: !466, line: 2459, type: !468, scopeLine: 2459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !471, retainedNodes: !472)
!468 = !DISubroutineType(types: !469)
!469 = !{!81, !470, !81, !155}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicU32", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!471 = !DISubprogram(name: "swap", linkageName: "_ZN4core4sync6atomic9AtomicU324swap17hd3da0ae859969405E", scope: !72, file: !466, line: 2459, type: !468, scopeLine: 2459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!472 = !{!473, !464, !474}
!473 = !DILocalVariable(name: "self", arg: 1, scope: !465, file: !466, line: 2459, type: !470)
!474 = !DILocalVariable(name: "order", scope: !465, file: !466, line: 2459, type: !155, align: 1)
!475 = !DILocation(line: 0, scope: !465, inlinedAt: !476)
!476 = distinct !DILocation(line: 95, column: 23, scope: !477, inlinedAt: !486)
!477 = distinct !DILexicalBlock(scope: !479, file: !478, line: 94, column: 5)
!478 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sys/sync/mutex/futex.rs", directory: "", checksumkind: CSK_MD5, checksum: "ad5a5eb25015e02fc7bc95b737378971")
!479 = distinct !DISubprogram(name: "unlock", linkageName: "_ZN3std3sys4sync5mutex5futex5Mutex6unlock17he4bff4528e6eb1deE", scope: !65, file: !478, line: 94, type: !480, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !483, retainedNodes: !484)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::sync::mutex::futex::Mutex", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!483 = !DISubprogram(name: "unlock", linkageName: "_ZN3std3sys4sync5mutex5futex5Mutex6unlock17he4bff4528e6eb1deE", scope: !65, file: !478, line: 94, type: !480, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!484 = !{!485}
!485 = !DILocalVariable(name: "self", arg: 1, scope: !477, file: !478, line: 94, type: !482)
!486 = distinct !DILocation(line: 551, column: 29, scope: !487, inlinedAt: !495)
!487 = distinct !DISubprogram(name: "drop<()>", linkageName: "_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE", scope: !489, file: !488, line: 548, type: !490, scopeLine: 548, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !100, retainedNodes: !493)
!488 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sync/mutex.rs", directory: "", checksumkind: CSK_MD5, checksum: "59c3c45bbe13b393286ad3c4249f4f26")
!489 = !DINamespace(name: "{impl#14}", scope: !58)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sync::mutex::MutexGuard<()>", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!493 = !{!494}
!494 = !DILocalVariable(name: "self", arg: 1, scope: !487, file: !488, line: 548, type: !492)
!495 = distinct !DILocation(line: 542, column: 1, scope: !457, inlinedAt: !463)
!496 = !DILocalVariable(name: "val", scope: !497, file: !466, line: 3310, type: !81, align: 4)
!497 = distinct !DILexicalBlock(scope: !498, file: !466, line: 3310, column: 1)
!498 = distinct !DISubprogram(name: "atomic_swap<u32>", linkageName: "_ZN4core4sync6atomic11atomic_swap17h6299fee29b22f7c4E", scope: !73, file: !466, line: 3310, type: !499, scopeLine: 3310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !82, retainedNodes: !502)
!499 = !DISubroutineType(types: !500)
!500 = !{!81, !501, !81, !155}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u32", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!502 = !{!503, !496, !504}
!503 = !DILocalVariable(name: "dst", arg: 1, scope: !497, file: !466, line: 3310, type: !501)
!504 = !DILocalVariable(name: "order", scope: !497, file: !466, line: 3310, type: !155, align: 1)
!505 = !DILocation(line: 0, scope: !497, inlinedAt: !506)
!506 = distinct !DILocation(line: 2461, column: 26, scope: !465, inlinedAt: !476)
!507 = !DILocation(line: 0, scope: !487, inlinedAt: !495)
!508 = !DILocation(line: 550, column: 13, scope: !487, inlinedAt: !495)
!509 = !DILocalVariable(name: "self", scope: !510, file: !466, line: 2404, type: !520, align: 8)
!510 = distinct !DILexicalBlock(scope: !511, file: !466, line: 2404, column: 13)
!511 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17ha275ef96911d62f2E", scope: !512, file: !466, line: 2404, type: !518, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !521, retainedNodes: !522)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !73, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !513, templateParams: !27, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !512, file: !2, baseType: !515, size: 64, align: 64, flags: DIFlagPrivate)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !78, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !516, templateParams: !375, identifier: "739795389d327d6873469e3d89b8c60e")
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !515, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!518 = !DISubroutineType(types: !519)
!519 = !{!9, !520, !155}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !512, size: 64, align: 64, dwarfAddressSpace: 0)
!521 = !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17ha275ef96911d62f2E", scope: !512, file: !466, line: 2404, type: !518, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!522 = !{!509, !523}
!523 = !DILocalVariable(name: "order", scope: !510, file: !466, line: 2404, type: !155, align: 1)
!524 = !DILocation(line: 0, scope: !510, inlinedAt: !525)
!525 = distinct !DILocation(line: 443, column: 31, scope: !526, inlinedAt: !531)
!526 = distinct !DILexicalBlock(scope: !527, file: !304, line: 442, column: 5)
!527 = distinct !DISubprogram(name: "count_is_zero", linkageName: "_ZN3std9panicking11panic_count13count_is_zero17h59c6d46ac520a0f5E", scope: !528, file: !304, line: 442, type: !529, scopeLine: 442, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27)
!528 = !DINamespace(name: "panic_count", scope: !15)
!529 = !DISubroutineType(types: !530)
!530 = !{!106}
!531 = distinct !DILocation(line: 594, column: 6, scope: !532, inlinedAt: !534)
!532 = distinct !DILexicalBlock(scope: !533, file: !304, line: 593, column: 1)
!533 = distinct !DISubprogram(name: "panicking", linkageName: "_ZN3std9panicking9panicking17hf57fef9d1f898e67E", scope: !15, file: !304, line: 593, type: !529, scopeLine: 593, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27)
!534 = distinct !DILocation(line: 836, column: 5, scope: !535, inlinedAt: !539)
!535 = distinct !DILexicalBlock(scope: !537, file: !536, line: 835, column: 1)
!536 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/thread/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "522747dadecfd96c3bd02fb9f0ba2e5e")
!537 = distinct !DISubprogram(name: "panicking", linkageName: "_ZN3std6thread9panicking17h08af59ef87c9918fE", scope: !538, file: !536, line: 835, type: !529, scopeLine: 835, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27)
!538 = !DINamespace(name: "thread", scope: !16)
!539 = distinct !DILocation(line: 53, column: 32, scope: !540, inlinedAt: !550)
!540 = distinct !DISubprogram(name: "done", linkageName: "_ZN3std4sync6poison4Flag4done17h6b62417d8d60c5ceE", scope: !85, file: !541, line: 52, type: !542, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !546, retainedNodes: !547)
!541 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sync/poison.rs", directory: "", checksumkind: CSK_MD5, checksum: "97ee7ddc448d1dca45948a26b5ab82e1")
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544, !545}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::poison::Flag", baseType: !85, size: 64, align: 64, dwarfAddressSpace: 0)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::poison::Guard", baseType: !103, size: 64, align: 64, dwarfAddressSpace: 0)
!546 = !DISubprogram(name: "done", linkageName: "_ZN3std4sync6poison4Flag4done17h6b62417d8d60c5ceE", scope: !85, file: !541, line: 52, type: !542, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!547 = !{!548, !549}
!548 = !DILocalVariable(name: "self", arg: 1, scope: !540, file: !541, line: 52, type: !544)
!549 = !DILocalVariable(name: "guard", arg: 2, scope: !540, file: !541, line: 52, type: !545)
!550 = distinct !DILocation(line: 550, column: 13, scope: !487, inlinedAt: !495)
!551 = !DILocalVariable(name: "val", scope: !552, file: !466, line: 635, type: !106, align: 1)
!552 = distinct !DILexicalBlock(scope: !553, file: !466, line: 635, column: 5)
!553 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h3e7df157a1ea1ab4E", scope: !88, file: !466, line: 635, type: !554, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, declaration: !557, retainedNodes: !558)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !556, !106, !155}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicBool", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!557 = !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic10AtomicBool5store17h3e7df157a1ea1ab4E", scope: !88, file: !466, line: 635, type: !554, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !27)
!558 = !{!559, !551, !560}
!559 = !DILocalVariable(name: "self", arg: 1, scope: !552, file: !466, line: 635, type: !556)
!560 = !DILocalVariable(name: "order", scope: !552, file: !466, line: 635, type: !155, align: 1)
!561 = !DILocation(line: 0, scope: !552, inlinedAt: !562)
!562 = distinct !DILocation(line: 54, column: 25, scope: !540, inlinedAt: !550)
!563 = !DILocation(line: 0, scope: !540, inlinedAt: !550)
!564 = !DILocation(line: 53, column: 13, scope: !540, inlinedAt: !550)
!565 = !DILocalVariable(name: "order", arg: 2, scope: !566, file: !466, line: 3294, type: !155)
!566 = distinct !DISubprogram(name: "atomic_load<usize>", linkageName: "_ZN4core4sync6atomic11atomic_load17h80cd62952d483ca8E", scope: !73, file: !466, line: 3294, type: !567, scopeLine: 3294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !375, retainedNodes: !570)
!567 = !DISubroutineType(types: !568)
!568 = !{!9, !569, !155}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!570 = !{!571, !565}
!571 = !DILocalVariable(name: "dst", arg: 1, scope: !566, file: !466, line: 3294, type: !569)
!572 = !DILocation(line: 0, scope: !566, inlinedAt: !573)
!573 = distinct !DILocation(line: 2406, column: 26, scope: !510, inlinedAt: !525)
!574 = !DILocation(line: 3298, column: 24, scope: !566, inlinedAt: !573)
!575 = !{!576}
!576 = distinct !{!576, !577, !"_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE: %self"}
!577 = distinct !{!577, !"_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE"}
!578 = !DILocation(line: 443, column: 12, scope: !526, inlinedAt: !531)
!579 = !DILocation(line: 455, column: 13, scope: !526, inlinedAt: !531)
!580 = !DILocation(line: 53, column: 32, scope: !540, inlinedAt: !550)
!581 = !DILocalVariable(name: "order", arg: 3, scope: !582, file: !466, line: 3279, type: !155)
!582 = distinct !DISubprogram(name: "atomic_store<u8>", linkageName: "_ZN4core4sync6atomic12atomic_store17h880e91cf333154c1E", scope: !73, file: !466, line: 3279, type: !583, scopeLine: 3279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !94, retainedNodes: !586)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !585, !34, !155}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!586 = !{!587, !588, !581}
!587 = !DILocalVariable(name: "dst", arg: 1, scope: !582, file: !466, line: 3279, type: !585)
!588 = !DILocalVariable(name: "val", arg: 2, scope: !582, file: !466, line: 3279, type: !34)
!589 = !DILocation(line: 0, scope: !582, inlinedAt: !590)
!590 = distinct !DILocation(line: 639, column: 13, scope: !552, inlinedAt: !562)
!591 = !DILocation(line: 3283, column: 24, scope: !582, inlinedAt: !590)
!592 = !DILocation(line: 53, column: 9, scope: !540, inlinedAt: !550)
!593 = !DILocation(line: 0, scope: !477, inlinedAt: !486)
!594 = !DILocation(line: 3316, column: 24, scope: !497, inlinedAt: !506)
!595 = !DILocation(line: 95, column: 12, scope: !477, inlinedAt: !486)
!596 = !DILocation(line: 100, column: 13, scope: !477, inlinedAt: !486)
!597 = distinct !DISubprogram(name: "drop_in_place<std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>>", linkageName: "_ZN4core3ptr151drop_in_place$LT$std..sync..poison..PoisonError$LT$$LP$std..sync..mutex..MutexGuard$LT$$LP$$RP$$GT$$C$std..sync..condvar..WaitTimeoutResult$RP$$GT$$GT$17h261b2bf6d79e8a0aE", scope: !172, file: !441, line: 542, type: !598, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !603, retainedNodes: !601)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!601 = !{!602}
!602 = !DILocalVariable(arg: 1, scope: !597, file: !441, line: 542, type: !600)
!603 = !{!604}
!604 = !DITemplateTypeParameter(name: "T", type: !117)
!605 = !DILocation(line: 0, scope: !597)
!606 = !DILocation(line: 542, column: 1, scope: !597)
!607 = !DILocalVariable(arg: 1, scope: !608, file: !441, line: 542, type: !611)
!608 = distinct !DISubprogram(name: "drop_in_place<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>", linkageName: "_ZN4core3ptr113drop_in_place$LT$$LP$std..sync..mutex..MutexGuard$LT$$LP$$RP$$GT$$C$std..sync..condvar..WaitTimeoutResult$RP$$GT$17h770f04b102fccbc1E", scope: !172, file: !441, line: 542, type: !609, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !128, retainedNodes: !612)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut (std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!612 = !{!607}
!613 = !DILocation(line: 0, scope: !608, inlinedAt: !614)
!614 = distinct !DILocation(line: 542, column: 1, scope: !597)
!615 = !DILocation(line: 0, scope: !457, inlinedAt: !616)
!616 = distinct !DILocation(line: 542, column: 1, scope: !608, inlinedAt: !614)
!617 = !DILocation(line: 0, scope: !465, inlinedAt: !618)
!618 = distinct !DILocation(line: 95, column: 23, scope: !477, inlinedAt: !619)
!619 = distinct !DILocation(line: 551, column: 29, scope: !487, inlinedAt: !620)
!620 = distinct !DILocation(line: 542, column: 1, scope: !457, inlinedAt: !616)
!621 = !DILocation(line: 0, scope: !497, inlinedAt: !622)
!622 = distinct !DILocation(line: 2461, column: 26, scope: !465, inlinedAt: !618)
!623 = !DILocation(line: 0, scope: !487, inlinedAt: !620)
!624 = !DILocation(line: 550, column: 13, scope: !487, inlinedAt: !620)
!625 = !DILocation(line: 0, scope: !510, inlinedAt: !626)
!626 = distinct !DILocation(line: 443, column: 31, scope: !526, inlinedAt: !627)
!627 = distinct !DILocation(line: 594, column: 6, scope: !532, inlinedAt: !628)
!628 = distinct !DILocation(line: 836, column: 5, scope: !535, inlinedAt: !629)
!629 = distinct !DILocation(line: 53, column: 32, scope: !540, inlinedAt: !630)
!630 = distinct !DILocation(line: 550, column: 13, scope: !487, inlinedAt: !620)
!631 = !DILocation(line: 0, scope: !552, inlinedAt: !632)
!632 = distinct !DILocation(line: 54, column: 25, scope: !540, inlinedAt: !630)
!633 = !DILocation(line: 0, scope: !540, inlinedAt: !630)
!634 = !DILocation(line: 53, column: 13, scope: !540, inlinedAt: !630)
!635 = !DILocation(line: 0, scope: !566, inlinedAt: !636)
!636 = distinct !DILocation(line: 2406, column: 26, scope: !510, inlinedAt: !626)
!637 = !DILocation(line: 3298, column: 24, scope: !566, inlinedAt: !636)
!638 = !{!639}
!639 = distinct !{!639, !640, !"_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE: %self"}
!640 = distinct !{!640, !"_ZN79_$LT$std..sync..mutex..MutexGuard$LT$T$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17hfdbfa198d5f998caE"}
!641 = !DILocation(line: 443, column: 12, scope: !526, inlinedAt: !627)
!642 = !DILocation(line: 455, column: 13, scope: !526, inlinedAt: !627)
!643 = !DILocation(line: 53, column: 32, scope: !540, inlinedAt: !630)
!644 = !DILocation(line: 0, scope: !582, inlinedAt: !645)
!645 = distinct !DILocation(line: 639, column: 13, scope: !552, inlinedAt: !632)
!646 = !DILocation(line: 3283, column: 24, scope: !582, inlinedAt: !645)
!647 = !DILocation(line: 53, column: 9, scope: !540, inlinedAt: !630)
!648 = !DILocation(line: 0, scope: !477, inlinedAt: !619)
!649 = !DILocation(line: 3316, column: 24, scope: !497, inlinedAt: !622)
!650 = !DILocation(line: 95, column: 12, scope: !477, inlinedAt: !619)
!651 = !DILocation(line: 100, column: 13, scope: !477, inlinedAt: !619)
!652 = !DILocation(line: 0, scope: !457)
!653 = !DILocation(line: 0, scope: !465, inlinedAt: !654)
!654 = distinct !DILocation(line: 95, column: 23, scope: !477, inlinedAt: !655)
!655 = distinct !DILocation(line: 551, column: 29, scope: !487, inlinedAt: !656)
!656 = distinct !DILocation(line: 542, column: 1, scope: !457)
!657 = !DILocation(line: 0, scope: !497, inlinedAt: !658)
!658 = distinct !DILocation(line: 2461, column: 26, scope: !465, inlinedAt: !654)
!659 = !DILocation(line: 0, scope: !487, inlinedAt: !656)
!660 = !DILocation(line: 550, column: 13, scope: !487, inlinedAt: !656)
!661 = !DILocation(line: 0, scope: !510, inlinedAt: !662)
!662 = distinct !DILocation(line: 443, column: 31, scope: !526, inlinedAt: !663)
!663 = distinct !DILocation(line: 594, column: 6, scope: !532, inlinedAt: !664)
!664 = distinct !DILocation(line: 836, column: 5, scope: !535, inlinedAt: !665)
!665 = distinct !DILocation(line: 53, column: 32, scope: !540, inlinedAt: !666)
!666 = distinct !DILocation(line: 550, column: 13, scope: !487, inlinedAt: !656)
!667 = !DILocation(line: 0, scope: !552, inlinedAt: !668)
!668 = distinct !DILocation(line: 54, column: 25, scope: !540, inlinedAt: !666)
!669 = !DILocation(line: 0, scope: !540, inlinedAt: !666)
!670 = !DILocation(line: 53, column: 13, scope: !540, inlinedAt: !666)
!671 = !DILocation(line: 0, scope: !566, inlinedAt: !672)
!672 = distinct !DILocation(line: 2406, column: 26, scope: !510, inlinedAt: !662)
!673 = !DILocation(line: 3298, column: 24, scope: !566, inlinedAt: !672)
!674 = !DILocation(line: 443, column: 12, scope: !526, inlinedAt: !663)
!675 = !DILocation(line: 455, column: 13, scope: !526, inlinedAt: !663)
!676 = !DILocation(line: 53, column: 32, scope: !540, inlinedAt: !666)
!677 = !DILocation(line: 0, scope: !582, inlinedAt: !678)
!678 = distinct !DILocation(line: 639, column: 13, scope: !552, inlinedAt: !668)
!679 = !DILocation(line: 3283, column: 24, scope: !582, inlinedAt: !678)
!680 = !DILocation(line: 53, column: 9, scope: !540, inlinedAt: !666)
!681 = !DILocation(line: 0, scope: !477, inlinedAt: !655)
!682 = !DILocation(line: 3316, column: 24, scope: !497, inlinedAt: !658)
!683 = !DILocation(line: 95, column: 12, scope: !477, inlinedAt: !655)
!684 = !DILocation(line: 100, column: 13, scope: !477, inlinedAt: !655)
!685 = !DILocation(line: 542, column: 1, scope: !457)
!686 = distinct !DISubprogram(name: "assert_failed<usize, usize>", linkageName: "_ZN4core9panicking13assert_failed17h9e6b4cfc8b71b252E", scope: !239, file: !687, line: 353, type: !688, scopeLine: 353, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !787, retainedNodes: !782)
!687 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "959aa4becc7ec74aacc75d29ec6aaeee")
!688 = !DISubroutineType(cc: DW_CC_nocall, types: !689)
!689 = !{null, !238, !138, !138, !690, !273}
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Arguments>", scope: !20, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !691, templateParams: !27, identifier: "58fcb1300708b0436a04955d94330b0a")
!691 = !{!692}
!692 = !DICompositeType(tag: DW_TAG_variant_part, scope: !690, file: !2, size: 384, align: 64, elements: !693, templateParams: !27, identifier: "2e56c54c6fc7457610d9a65a7473736f", discriminator: !781)
!693 = !{!694, !777}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !692, file: !2, baseType: !695, size: 384, align: 64, extraData: i128 0)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !690, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !696, identifier: "39469f7bbb66d0bbfe2a93bd664ccf0")
!696 = !{!697}
!697 = !DITemplateTypeParameter(name: "T", type: !698)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !164, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !699, templateParams: !27, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!699 = !{!700, !706, !748}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !698, file: !2, baseType: !701, size: 128, align: 64, flags: DIFlagPrivate)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !702, templateParams: !27, identifier: "4e66b00a376d6af5b8765440fb2839f")
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !701, file: !2, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !701, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !698, file: !2, baseType: !707, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !20, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !708, templateParams: !27, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!708 = !{!709}
!709 = !DICompositeType(tag: DW_TAG_variant_part, scope: !707, file: !2, size: 128, align: 64, elements: !710, templateParams: !27, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !747)
!710 = !{!711, !743}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !709, file: !2, baseType: !712, size: 128, align: 64, extraData: i128 0)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !707, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !713, identifier: "c062391546990b9ae716e587a9c44107")
!713 = !{!714}
!714 = !DITemplateTypeParameter(name: "T", type: !715)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !716, templateParams: !27, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!716 = !{!717, !742}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !715, file: !2, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64, dwarfAddressSpace: 0)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !163, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !720, templateParams: !27, identifier: "402846c0893391618e34a15e0598c24e")
!720 = !{!721, !722, !723, !724, !725, !741}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !719, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !719, file: !2, baseType: !366, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !719, file: !2, baseType: !162, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !719, file: !2, baseType: !81, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !719, file: !2, baseType: !726, size: 128, align: 64, flags: DIFlagPublic)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !163, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !727, templateParams: !27, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!727 = !{!728}
!728 = !DICompositeType(tag: DW_TAG_variant_part, scope: !726, file: !2, size: 128, align: 64, elements: !729, templateParams: !27, identifier: "96fecae849037968fdad1729d3166571", discriminator: !740)
!729 = !{!730, !734, !738}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !728, file: !2, baseType: !731, size: 128, align: 64, extraData: i128 0)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !726, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !732, templateParams: !27, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !731, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !728, file: !2, baseType: !735, size: 128, align: 64, extraData: i128 1)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !726, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !736, templateParams: !27, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !735, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !728, file: !2, baseType: !739, size: 128, align: 64, extraData: i128 2)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !726, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, identifier: "844235131be8a6898de5150ba908049f")
!740 = !DIDerivedType(tag: DW_TAG_member, scope: !726, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !719, file: !2, baseType: !726, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !715, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !709, file: !2, baseType: !744, size: 128, align: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !707, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !745, templateParams: !713, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !744, file: !2, baseType: !715, size: 128, align: 64, flags: DIFlagPublic)
!747 = !DIDerivedType(tag: DW_TAG_member, scope: !707, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !698, file: !2, baseType: !749, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !750, templateParams: !27, identifier: "baf028fc654408299b6dd770f089fd48")
!750 = !{!751, !776}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !749, file: !2, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64, dwarfAddressSpace: 0)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !163, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !754, templateParams: !27, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !753, file: !2, baseType: !756, size: 128, align: 64, flags: DIFlagPrivate)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !163, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !757, templateParams: !27, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!757 = !{!758}
!758 = !DICompositeType(tag: DW_TAG_variant_part, scope: !756, file: !2, size: 128, align: 64, elements: !759, templateParams: !27, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !775)
!759 = !{!760, !771}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !758, file: !2, baseType: !761, size: 128, align: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !756, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !762, templateParams: !27, identifier: "7c7df21330d573ca4eefe40395fd691")
!762 = !{!763, !767}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !761, file: !2, baseType: !764, size: 64, align: 64, flags: DIFlagPrivate)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !765, size: 64, align: 64, dwarfAddressSpace: 0)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !766, file: !2, align: 8, elements: !27, identifier: "728a64207294457ae982b2390ae8a902")
!766 = !DINamespace(name: "{extern#0}", scope: !163)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !761, file: !2, baseType: !768, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !769, size: 64, align: 64, dwarfAddressSpace: 0)
!769 = !DISubroutineType(types: !770)
!770 = !{!343, !764, !361}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !758, file: !2, baseType: !772, size: 128, align: 64, extraData: i128 0)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !756, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !773, templateParams: !27, identifier: "fb37c399e04d1117cfdf49fc8e0ef2cd")
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !772, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!775 = !DIDerivedType(tag: DW_TAG_member, scope: !756, file: !2, baseType: !41, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !749, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !692, file: !2, baseType: !778, size: 384, align: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !690, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !779, templateParams: !696, identifier: "6272467ba836f25d76a4aeb6cb743ffa")
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !778, file: !2, baseType: !698, size: 384, align: 64, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_member, scope: !690, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!782 = !{!783, !784, !785, !786}
!783 = !DILocalVariable(name: "kind", arg: 1, scope: !686, file: !687, line: 354, type: !238)
!784 = !DILocalVariable(name: "left", arg: 2, scope: !686, file: !687, line: 355, type: !138)
!785 = !DILocalVariable(name: "right", arg: 3, scope: !686, file: !687, line: 356, type: !138)
!786 = !DILocalVariable(name: "args", arg: 4, scope: !686, file: !687, line: 357, type: !690)
!787 = !{!376, !788}
!788 = !DITemplateTypeParameter(name: "U", type: !9)
!789 = !DILocation(line: 0, scope: !686)
!790 = !DILocation(line: 355, column: 5, scope: !686)
!791 = !DILocation(line: 356, column: 5, scope: !686)
!792 = !DILocation(line: 357, column: 5, scope: !686)
!793 = !DILocation(line: 363, column: 5, scope: !686)
!794 = distinct !DISubprogram(name: "fmt<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>", linkageName: "_ZN76_$LT$std..sync..poison..PoisonError$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17h6abac804f2131a5fE", scope: !795, file: !541, line: 170, type: !796, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !128, retainedNodes: !799)
!795 = !DINamespace(name: "{impl#1}", scope: !53)
!796 = !DISubroutineType(types: !797)
!797 = !{!343, !798, !361}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sync::poison::PoisonError<(std::sync::mutex::MutexGuard<()>, std::sync::condvar::WaitTimeoutResult)>", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !{!800, !801}
!800 = !DILocalVariable(name: "self", arg: 1, scope: !794, file: !541, line: 170, type: !798)
!801 = !DILocalVariable(name: "f", arg: 2, scope: !794, file: !541, line: 170, type: !361)
!802 = !DILocation(line: 0, scope: !794)
!803 = !DILocation(line: 171, column: 9, scope: !794)
!804 = !DILocation(line: 172, column: 5, scope: !794)
!805 = !DILocation(line: 172, column: 6, scope: !794)
!806 = distinct !DISubprogram(name: "get<&str>", linkageName: "_ZN91_$LT$std..panicking..begin_panic..Payload$LT$A$GT$$u20$as$u20$core..panic..PanicPayload$GT$3get17hc1e1b1682acbcfc9E", scope: !807, file: !304, line: 727, type: !808, scopeLine: 727, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !42, retainedNodes: !821)
!807 = !DINamespace(name: "{impl#1}", scope: !14)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !820}
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !811, templateParams: !27, identifier: "41b4d56f228b99e79ff0b712ba82a6ef")
!811 = !{!812, !815}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !810, file: !2, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64, dwarfAddressSpace: 0)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !27, identifier: "d9d0340af71c3931acd562336146ce60")
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !810, file: !2, baseType: !816, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !817, size: 64, align: 64, dwarfAddressSpace: 0)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 4, lowerBound: 0)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::panicking::begin_panic::Payload<&str>", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!821 = !{!822, !823}
!822 = !DILocalVariable(name: "self", arg: 1, scope: !806, file: !304, line: 727, type: !820)
!823 = !DILocalVariable(name: "a", scope: !824, file: !304, line: 729, type: !258, align: 8)
!824 = distinct !DILexicalBlock(scope: !806, file: !304, line: 729, column: 17)
!825 = !DILocation(line: 0, scope: !806)
!826 = !DILocation(line: 728, column: 19, scope: !806)
!827 = !DILocation(line: 728, column: 13, scope: !806)
!828 = !DILocation(line: 730, column: 25, scope: !806)
!829 = !DILocation(line: 732, column: 10, scope: !806)
!830 = distinct !DISubprogram(name: "take_box<&str>", linkageName: "_ZN91_$LT$std..panicking..begin_panic..Payload$LT$A$GT$$u20$as$u20$core..panic..PanicPayload$GT$8take_box17h21e525f0eb9cdbc7E", scope: !807, file: !304, line: 714, type: !831, scopeLine: 714, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !42, retainedNodes: !837)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !820}
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut (dyn core::any::Any + core::marker::Send)", file: !2, size: 128, align: 64, elements: !834, templateParams: !27, identifier: "2c44980449ee96917e8f447919f05522")
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !833, file: !2, baseType: !813, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !833, file: !2, baseType: !816, size: 64, align: 64, offset: 64)
!837 = !{!838, !839, !845}
!838 = !DILocalVariable(name: "self", arg: 1, scope: !830, file: !304, line: 714, type: !820)
!839 = !DILocalVariable(name: "data", scope: !840, file: !304, line: 720, type: !841, align: 8)
!840 = distinct !DILexicalBlock(scope: !830, file: !304, line: 720, column: 13)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !842, templateParams: !27, identifier: "69efc71d62726b9d235d74b72706b922")
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !841, file: !2, baseType: !813, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !841, file: !2, baseType: !816, size: 64, align: 64, offset: 64)
!845 = !DILocalVariable(name: "a", scope: !846, file: !304, line: 721, type: !30, align: 8)
!846 = distinct !DILexicalBlock(scope: !830, file: !304, line: 721, column: 17)
!847 = !DILocation(line: 0, scope: !830)
!848 = !DILocalVariable(name: "self", arg: 1, scope: !849, file: !850, line: 1697, type: !854)
!849 = distinct !DILexicalBlock(scope: !851, file: !850, line: 1697, column: 5)
!850 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "1839402b3e3d27abc7bbff44f5b669ff")
!851 = distinct !DISubprogram(name: "take<&str>", linkageName: "_ZN4core6option15Option$LT$T$GT$4take17h5737b61e537a1852E", scope: !19, file: !850, line: 1697, type: !852, scopeLine: 1697, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !28, declaration: !855, retainedNodes: !856)
!852 = !DISubroutineType(types: !853)
!853 = !{!19, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<&str>", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!855 = !DISubprogram(name: "take<&str>", linkageName: "_ZN4core6option15Option$LT$T$GT$4take17h5737b61e537a1852E", scope: !19, file: !850, line: 1697, type: !852, scopeLine: 1697, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !28)
!856 = !{!848}
!857 = !DILocation(line: 0, scope: !849, inlinedAt: !858)
!858 = !DILocation(line: 720, column: 41, scope: !830)
!859 = !DILocalVariable(name: "dest", arg: 1, scope: !860, file: !861, line: 858, type: !854)
!860 = distinct !DILexicalBlock(scope: !862, file: !861, line: 858, column: 1)
!861 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ab6d66e759286ff434b3e279bd7267d7")
!862 = distinct !DISubprogram(name: "replace<core::option::Option<&str>>", linkageName: "_ZN4core3mem7replace17hd4c69e5ec24abf98E", scope: !863, file: !861, line: 858, type: !864, scopeLine: 858, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !870, retainedNodes: !866)
!863 = !DINamespace(name: "mem", scope: !21)
!864 = !DISubroutineType(types: !865)
!865 = !{!19, !854, !19}
!866 = !{!859, !867, !868}
!867 = !DILocalVariable(name: "src", arg: 2, scope: !860, file: !861, line: 858, type: !19)
!868 = !DILocalVariable(name: "result", scope: !869, file: !861, line: 867, type: !19, align: 8)
!869 = distinct !DILexicalBlock(scope: !860, file: !861, line: 867, column: 9)
!870 = !{!871}
!871 = !DITemplateTypeParameter(name: "T", type: !19)
!872 = !DILocation(line: 0, scope: !860, inlinedAt: !873)
!873 = !DILocation(line: 1699, column: 9, scope: !849, inlinedAt: !858)
!874 = !DILocalVariable(name: "src", arg: 1, scope: !875, file: !441, line: 1287, type: !854)
!875 = distinct !DILexicalBlock(scope: !876, file: !441, line: 1287, column: 1)
!876 = distinct !DISubprogram(name: "read<core::option::Option<&str>>", linkageName: "_ZN4core3ptr4read17ha03239329abedf65E", scope: !172, file: !441, line: 1287, type: !877, scopeLine: 1287, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !870, retainedNodes: !880)
!877 = !DISubroutineType(types: !878)
!878 = !{!19, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::option::Option<&str>", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!880 = !{!874}
!881 = !DILocation(line: 0, scope: !875, inlinedAt: !882)
!882 = !DILocation(line: 867, column: 22, scope: !860, inlinedAt: !873)
!883 = !DILocalVariable(name: "dst", arg: 1, scope: !884, file: !441, line: 1512, type: !854)
!884 = distinct !DILexicalBlock(scope: !885, file: !441, line: 1512, column: 1)
!885 = distinct !DISubprogram(name: "write<core::option::Option<&str>>", linkageName: "_ZN4core3ptr5write17h1dfe7bd5665f5366E", scope: !172, file: !441, line: 1512, type: !886, scopeLine: 1512, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !870, retainedNodes: !889)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !888, !19}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<&str>", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !{!883, !890}
!890 = !DILocalVariable(name: "src", arg: 2, scope: !884, file: !441, line: 1512, type: !19)
!891 = !DILocation(line: 0, scope: !884, inlinedAt: !892)
!892 = !DILocation(line: 868, column: 9, scope: !869, inlinedAt: !873)
!893 = !DILocation(line: 1325, column: 9, scope: !875, inlinedAt: !882)
!894 = !DILocation(line: 0, scope: !869, inlinedAt: !873)
!895 = !DILocation(line: 1534, column: 9, scope: !884, inlinedAt: !892)
!896 = !DILocation(line: 720, column: 30, scope: !830)
!897 = !DILocation(line: 720, column: 24, scope: !830)
!898 = !DILocation(line: 722, column: 25, scope: !830)
!899 = !DILocation(line: 0, scope: !846)
!900 = !DILocalVariable(name: "x", arg: 1, scope: !901, file: !902, line: 257, type: !30)
!901 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN5alloc5boxed12Box$LT$T$GT$3new17h9dba12eee9ff60b8E", scope: !903, file: !902, line: 257, type: !906, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !28, retainedNodes: !909)
!902 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/boxed.rs", directory: "", checksumkind: CSK_MD5, checksum: "53b6f893b0085318f84474b67c508827")
!903 = !DINamespace(name: "{impl#0}", scope: !904)
!904 = !DINamespace(name: "boxed", scope: !905)
!905 = !DINamespace(name: "alloc", scope: null)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !30}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<&str, alloc::alloc::Global>", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!909 = !{!900}
!910 = !DILocation(line: 0, scope: !901, inlinedAt: !911)
!911 = distinct !DILocation(line: 721, column: 28, scope: !846)
!912 = !DILocalVariable(name: "self", scope: !913, file: !914, line: 242, type: !946, align: 8)
!913 = distinct !DILexicalBlock(scope: !915, file: !914, line: 242, column: 5)
!914 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/alloc.rs", directory: "", checksumkind: CSK_MD5, checksum: "6687e3e140ed9b8c51f77000a3d3a272")
!915 = distinct !DISubprogram(name: "allocate", linkageName: "_ZN63_$LT$alloc..alloc..Global$u20$as$u20$core..alloc..Allocator$GT$8allocate17h118bca52f4ff3c94E", scope: !916, file: !914, line: 242, type: !918, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, retainedNodes: !956)
!916 = !DINamespace(name: "{impl#1}", scope: !917)
!917 = !DINamespace(name: "alloc", scope: !905)
!918 = !DISubroutineType(types: !919)
!919 = !{!920, !946, !948}
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::ptr::non_null::NonNull<[u8]>, core::alloc::AllocError>", scope: !344, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !921, templateParams: !27, identifier: "69476ecdc68b549e255d58e805d418e1")
!921 = !{!922}
!922 = !DICompositeType(tag: DW_TAG_variant_part, scope: !920, file: !2, size: 128, align: 64, elements: !923, templateParams: !27, identifier: "58148ccf6cdf93e5c99fea0eb3a42241", discriminator: !945)
!923 = !{!924, !941}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !922, file: !2, baseType: !925, size: 128, align: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !920, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !926, templateParams: !936, identifier: "e66dc4b4b49f1926a26d416561eb60dc")
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !925, file: !2, baseType: !928, size: 128, align: 64, flags: DIFlagPublic)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[u8]>", scope: !929, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !930, templateParams: !94, identifier: "321a1c9a13424b52ae24b00919f47782")
!929 = !DINamespace(name: "non_null", scope: !172)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !928, file: !2, baseType: !932, size: 128, align: 64, flags: DIFlagPrivate)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !933, templateParams: !27, identifier: "a10360edaf335c418dbc95bccd0cb05d")
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !932, file: !2, baseType: !33, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !932, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!936 = !{!937, !938}
!937 = !DITemplateTypeParameter(name: "T", type: !928)
!938 = !DITemplateTypeParameter(name: "E", type: !939)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !940, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "d03678c8e223272325250dce3c09a8c1")
!940 = !DINamespace(name: "alloc", scope: !21)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !922, file: !2, baseType: !942, size: 128, align: 64, extraData: i128 0)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !920, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !943, templateParams: !936, identifier: "d5f21a4859e1af391c90fd1aa5fecc78")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !942, file: !2, baseType: !939, align: 8, flags: DIFlagPublic)
!945 = !DIDerivedType(tag: DW_TAG_member, scope: !920, file: !2, baseType: !41, size: 64, align: 64, flags: DIFlagArtificial)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::alloc::Global", baseType: !947, size: 64, align: 64, dwarfAddressSpace: 0)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !917, file: !2, align: 8, flags: DIFlagPublic, elements: !27, identifier: "14de19725ec4b1fd38fae074afd4da08")
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !949, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !950, templateParams: !27, identifier: "e53210ff23d6d7b64d0c502d9cf034c2")
!949 = !DINamespace(name: "layout", scope: !940)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !948, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !948, file: !2, baseType: !953, size: 64, align: 64, flags: DIFlagPrivate)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !171, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !954, templateParams: !27, identifier: "d52b523600ea492069fdcf2d89e5e6af")
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !953, file: !2, baseType: !170, size: 64, align: 64, flags: DIFlagPrivate)
!956 = !{!912, !957}
!957 = !DILocalVariable(name: "layout", arg: 2, scope: !913, file: !914, line: 242, type: !948)
!958 = !DILocation(line: 0, scope: !913, inlinedAt: !959)
!959 = distinct !DILocation(line: 332, column: 18, scope: !960, inlinedAt: !970)
!960 = distinct !DILexicalBlock(scope: !961, file: !914, line: 331, column: 5)
!961 = distinct !DISubprogram(name: "exchange_malloc", linkageName: "_ZN5alloc5alloc15exchange_malloc17h354862c5666a0a2aE", scope: !917, file: !914, line: 330, type: !962, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, templateParams: !27, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{!585, !9, !9}
!964 = !{!965, !966, !967, !968}
!965 = !DILocalVariable(name: "size", arg: 1, scope: !961, file: !914, line: 330, type: !9)
!966 = !DILocalVariable(name: "align", arg: 2, scope: !961, file: !914, line: 330, type: !9)
!967 = !DILocalVariable(name: "layout", scope: !960, file: !914, line: 331, type: !948, align: 8)
