; ModuleID = 'polling.a101f00402e4d7f3-cgu.0'
source_filename = "polling.a101f00402e4d7f3-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"core::option::Option<&dyn tracing_core::field::Value>" = type { ptr, [1 x i64] }
%"rustix::backend::event::epoll::Event" = type <{ i32, %"rustix::backend::event::epoll::EventData" }>
%"rustix::backend::event::epoll::EventData" = type { [1 x i64] }

@_ZN12tracing_core8metadata9MAX_LEVEL17h2def28f3c9fb9790E = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"
@_ZN3std9panicking11panic_count18GLOBAL_PANIC_COUNT17h00e7dcd913cdfbe0E = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"
@vtable.0 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h121b9f8992263bf2E" }>, align 8, !dbg !0
@__rust_no_alloc_shim_is_unstable = external global i8
@alloc_37d2e53432a03a1f90b3e7253015eaf9 = private unnamed_addr constant <{ [4 x i8] }> <{ [4 x i8] c"None" }>, align 1
@alloc_9535bf4c204f3eb9b19ec2c83e446e52 = private unnamed_addr constant <{ [4 x i8] }> <{ [4 x i8] c"Some" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !14, identifier: "f5a64a36fe3a6033883a66552c073de0")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!14 = !{}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "<&core::time::Duration as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::time::Duration as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !18, vtableHolder: !23, templateParams: !14, identifier: "f8b6c279e7587fac77a068d26550a5f0")
!18 = !{!19, !20, !21, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !17, file: !2, baseType: !6, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !17, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !17, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::time::Duration", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Duration", scope: !25, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !27, templateParams: !14, identifier: "e6e9d820da14977b115222421f695430")
!25 = !DINamespace(name: "time", scope: !26)
!26 = !DINamespace(name: "core", scope: null)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "secs", scope: !24, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagPrivate)
!29 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nanos", scope: !24, file: !2, baseType: !31, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !25, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !32, templateParams: !14, identifier: "18ac0ffc1bb3876b843131ad5ec34da7")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !31, file: !2, baseType: !34, size: 32, align: 32, flags: DIFlagPrivate)
!34 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "<&std::os::fd::owned::OwnedFd as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&std::os::fd::owned::OwnedFd as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !38, vtableHolder: !43, templateParams: !14, identifier: "569e22d48798f9ac731e53a16ce4a59a")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !37, file: !2, baseType: !6, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !37, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::os::fd::owned::OwnedFd", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedFd", scope: !45, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !49, templateParams: !14, identifier: "66924ffd015b2a9919159be22d7979f7")
!45 = !DINamespace(name: "owned", scope: !46)
!46 = !DINamespace(name: "fd", scope: !47)
!47 = !DINamespace(name: "os", scope: !48)
!48 = !DINamespace(name: "std", scope: null)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !44, file: !2, baseType: !13, size: 32, align: 32, flags: DIFlagPrivate)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "<&rustix::backend::event::epoll::_::InternalBitFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&rustix::backend::event::epoll::_::InternalBitFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !54, vtableHolder: !59, templateParams: !14, identifier: "92a268f735254166cfc0c575ba4cdf02")
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !53, file: !2, baseType: !6, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !53, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&rustix::backend::event::epoll::_::InternalBitFlags", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "InternalBitFlags", scope: !61, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !66, templateParams: !14, identifier: "1a77dfdf9095baa41e7ae2540c035b9")
!61 = !DINamespace(name: "_", scope: !62)
!62 = !DINamespace(name: "epoll", scope: !63)
!63 = !DINamespace(name: "event", scope: !64)
!64 = !DINamespace(name: "backend", scope: !65)
!65 = !DINamespace(name: "rustix", scope: null)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !60, file: !2, baseType: !34, size: 32, align: 32, flags: DIFlagProtected)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "<&polling::epoll::Notifier as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&polling::epoll::Notifier as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !71, vtableHolder: !76, templateParams: !14, identifier: "b52681c6ff23e24c14e005073c2b15f1")
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !70, file: !2, baseType: !6, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !70, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&polling::epoll::Notifier", baseType: !77, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "Notifier", scope: !78, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !80, templateParams: !14, identifier: "bc0e521d979ed4794679413e5801362f")
!78 = !DINamespace(name: "epoll", scope: !79)
!79 = !DINamespace(name: "polling", scope: null)
!80 = !{!81}
!81 = !DICompositeType(tag: DW_TAG_variant_part, scope: !77, file: !2, size: 64, align: 32, elements: !82, templateParams: !14, identifier: "aedb538f35120b397677b24c738846a0", discriminator: !92)
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "EventFd", scope: !81, file: !2, baseType: !84, size: 64, align: 32, extraData: i128 4294967295)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventFd", scope: !77, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !85, templateParams: !14, identifier: "2416df5f198816d75ab79eb96d2e121a")
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !84, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPrivate)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Pipe", scope: !81, file: !2, baseType: !88, size: 64, align: 32)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pipe", scope: !77, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !89, templateParams: !14, identifier: "a9170f23865e4e82370601858aeb86d9")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "read_pipe", scope: !88, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPrivate)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "write_pipe", scope: !88, file: !2, baseType: !44, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!92 = !DIDerivedType(tag: DW_TAG_member, scope: !77, file: !2, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagArtificial)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "<&core::option::Option<core::time::Duration> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<core::time::Duration> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !96, vtableHolder: !101, templateParams: !14, identifier: "8f0a0d97628b3fa9bb2ea443e1de5946")
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !95, file: !2, baseType: !6, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !95, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !95, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<core::time::Duration>", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::time::Duration>", scope: !103, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !104, templateParams: !14, identifier: "2f5efc9b7741e6cc64eddb3c11d26bd0")
!103 = !DINamespace(name: "option", scope: !26)
!104 = !{!105}
!105 = !DICompositeType(tag: DW_TAG_variant_part, scope: !102, file: !2, size: 128, align: 64, elements: !106, templateParams: !14, identifier: "1751be3d3a3dc2ec1600f0c000c9ba31", discriminator: !115)
!106 = !{!107, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !105, file: !2, baseType: !108, size: 128, align: 64, extraData: i128 1000000000)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !102, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !14, templateParams: !109, identifier: "130d1c209109b8d59bce9dabfec61711")
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "T", type: !24)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !105, file: !2, baseType: !112, size: 128, align: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !102, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !113, templateParams: !109, identifier: "d01d1302511e161497995383d38955c3")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !112, file: !2, baseType: !24, size: 128, align: 64, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !2, baseType: !34, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "<&polling::Event as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&polling::Event as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !119, vtableHolder: !124, templateParams: !14, identifier: "706ddabfe72cd0bcd60fe63a50b60eee")
!119 = !{!120, !121, !122, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !118, file: !2, baseType: !6, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !118, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !118, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&polling::Event", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "Event", scope: !79, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !126, templateParams: !14, identifier: "d9ba4b8401b06be029d770c408f4ef91")
!126 = !{!127, !128, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !125, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !125, file: !2, baseType: !129, size: 8, align: 8, offset: 96, flags: DIFlagPublic)
!129 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !125, file: !2, baseType: !129, size: 8, align: 8, offset: 104, flags: DIFlagPublic)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !125, file: !2, baseType: !132, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventExtra", scope: !78, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !133, templateParams: !14, identifier: "8d7870bd73b9cf6358aba973d96b4c34")
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !2, baseType: !135, size: 32, align: 32, flags: DIFlagPrivate)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventFlags", scope: !62, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !136, templateParams: !14, identifier: "a2240cfeb36fb06eabf78273669a4c1a")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !135, file: !2, baseType: !60, size: 32, align: 32, flags: DIFlagPrivate)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "<&std::os::fd::owned::BorrowedFd as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&std::os::fd::owned::BorrowedFd as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !141, vtableHolder: !146, templateParams: !14, identifier: "8ed62529c63f81e34332718a150bb156")
!141 = !{!142, !143, !144, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !140, file: !2, baseType: !6, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !140, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !140, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !140, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::os::fd::owned::BorrowedFd", baseType: !147, size: 64, align: 64, dwarfAddressSpace: 0)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "BorrowedFd", scope: !45, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !148, templateParams: !14, identifier: "93bf5bdef36404855ccc428c9f3454d")
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !147, file: !2, baseType: !13, size: 32, align: 32, flags: DIFlagPrivate)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_phantom", scope: !147, file: !2, baseType: !151, align: 8, offset: 32, flags: DIFlagPrivate)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&std::os::fd::owned::OwnedFd>", scope: !152, file: !2, align: 8, flags: DIFlagPublic, elements: !14, templateParams: !153, identifier: "107cb602cc9bbe59cdbcae44b89b46bf")
!152 = !DINamespace(name: "marker", scope: !26)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "T", type: !43)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "<&core::option::Option<std::os::fd::owned::OwnedFd> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<std::os::fd::owned::OwnedFd> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !158, vtableHolder: !163, templateParams: !14, identifier: "bbb0cb905a37a519fec3b39fe790c92e")
!158 = !{!159, !160, !161, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !157, file: !2, baseType: !6, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !157, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !157, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<std::os::fd::owned::OwnedFd>", baseType: !164, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::os::fd::owned::OwnedFd>", scope: !103, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !165, templateParams: !14, identifier: "e64dcd2d1417ac55b150bdb77a869b")
!165 = !{!166}
!166 = !DICompositeType(tag: DW_TAG_variant_part, scope: !164, file: !2, size: 32, align: 32, elements: !167, templateParams: !14, identifier: "1627bdeac55092a551ee4806c54e8353", discriminator: !176)
!167 = !{!168, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !166, file: !2, baseType: !169, size: 32, align: 32, extraData: i128 4294967295)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !164, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !14, templateParams: !170, identifier: "5598d023656fad943c1f856d601e9a6f")
!170 = !{!171}
!171 = !DITemplateTypeParameter(name: "T", type: !44)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !166, file: !2, baseType: !173, size: 32, align: 32)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !164, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !174, templateParams: !170, identifier: "fb959fdf6c51b7094f10e1ee9e40af7c")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !173, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPublic)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !164, file: !2, baseType: !34, size: 32, align: 32, flags: DIFlagArtificial)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !180, vtableHolder: !185, templateParams: !14, identifier: "84b1534180bf746fe7f84d518dd21fd7")
!180 = !{!181, !182, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !179, file: !2, baseType: !6, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !179, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !179, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !179, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&core::option::Option<core::time::Duration>> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&core::option::Option<core::time::Duration>> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !189, vtableHolder: !194, templateParams: !14, identifier: "64d293fa99dce4cafe65ce4327534d15")
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !188, file: !2, baseType: !6, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !188, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&core::option::Option<core::time::Duration>>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !197, templateParams: !199, identifier: "16adb1d4cd772c4be54098c2ab81ec19")
!195 = !DINamespace(name: "field", scope: !196)
!196 = !DINamespace(name: "tracing_core", scope: null)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !194, file: !2, baseType: !101, size: 64, align: 64, flags: DIFlagPrivate)
!199 = !{!200}
!200 = !DITemplateTypeParameter(name: "T", type: !101)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !204, vtableHolder: !209, templateParams: !14, identifier: "3222f88cd7a2489c9a4324e4820d07cf")
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !203, file: !2, baseType: !6, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !203, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !203, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !210, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !211, templateParams: !14, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!210 = !DINamespace(name: "fmt", scope: !26)
!211 = !{!212, !224, !274}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !209, file: !2, baseType: !213, size: 128, align: 64, flags: DIFlagPrivate)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !214, templateParams: !14, identifier: "4e66b00a376d6af5b8765440fb2839f")
!214 = !{!215, !223}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !213, file: !2, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64, dwarfAddressSpace: 0)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !218, templateParams: !14, identifier: "9277eecd40495f85161460476aacc992")
!218 = !{!219, !222}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !217, file: !2, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64, dwarfAddressSpace: 0)
!221 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !217, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !213, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !209, file: !2, baseType: !225, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !103, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !226, templateParams: !14, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!226 = !{!227}
!227 = !DICompositeType(tag: DW_TAG_variant_part, scope: !225, file: !2, size: 128, align: 64, elements: !228, templateParams: !14, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !273)
!228 = !{!229, !269}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !227, file: !2, baseType: !230, size: 128, align: 64, extraData: i128 0)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !225, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !14, templateParams: !231, identifier: "c062391546990b9ae716e587a9c44107")
!231 = !{!232}
!232 = !DITemplateTypeParameter(name: "T", type: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !234, templateParams: !14, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!234 = !{!235, !268}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !233, file: !2, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64, dwarfAddressSpace: 0)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !238, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !239, templateParams: !14, identifier: "402846c0893391618e34a15e0598c24e")
!238 = !DINamespace(name: "rt", scope: !210)
!239 = !{!240, !241, !243, !250, !251, !267}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !237, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !237, file: !2, baseType: !242, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!242 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !237, file: !2, baseType: !244, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !238, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !245)
!245 = !{!246, !247, !248, !249}
!246 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!247 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!248 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!249 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !237, file: !2, baseType: !34, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !237, file: !2, baseType: !252, size: 128, align: 64, flags: DIFlagPublic)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !238, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !253, templateParams: !14, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!253 = !{!254}
!254 = !DICompositeType(tag: DW_TAG_variant_part, scope: !252, file: !2, size: 128, align: 64, elements: !255, templateParams: !14, identifier: "96fecae849037968fdad1729d3166571", discriminator: !266)
!255 = !{!256, !260, !264}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !254, file: !2, baseType: !257, size: 128, align: 64, extraData: i128 0)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !252, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !258, templateParams: !14, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !257, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !254, file: !2, baseType: !261, size: 128, align: 64, extraData: i128 1)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !252, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !262, templateParams: !14, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !261, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !254, file: !2, baseType: !265, size: 128, align: 64, extraData: i128 2)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !252, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !14, identifier: "844235131be8a6898de5150ba908049f")
!266 = !DIDerivedType(tag: DW_TAG_member, scope: !252, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !237, file: !2, baseType: !252, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !233, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !227, file: !2, baseType: !270, size: 128, align: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !225, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !271, templateParams: !231, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !270, file: !2, baseType: !233, size: 128, align: 64, flags: DIFlagPublic)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !209, file: !2, baseType: !275, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !276, templateParams: !14, identifier: "baf028fc654408299b6dd770f089fd48")
!276 = !{!277, !352}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !275, file: !2, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64, dwarfAddressSpace: 0)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !238, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !280, templateParams: !14, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !279, file: !2, baseType: !282, size: 128, align: 64, flags: DIFlagPrivate)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !238, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !283, templateParams: !14, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!283 = !{!284}
!284 = !DICompositeType(tag: DW_TAG_variant_part, scope: !282, file: !2, size: 128, align: 64, elements: !285, templateParams: !14, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !351)
!285 = !{!286, !347}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !284, file: !2, baseType: !287, size: 128, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !282, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !288, templateParams: !14, identifier: "7c7df21330d573ca4eefe40395fd691")
!288 = !{!289, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !2, baseType: !290, size: 64, align: 64, flags: DIFlagPrivate)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !292, file: !2, align: 8, elements: !14, identifier: "728a64207294457ae982b2390ae8a902")
!292 = !DINamespace(name: "{extern#0}", scope: !238)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !287, file: !2, baseType: !294, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !295, size: 64, align: 64, dwarfAddressSpace: 0)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !290, !315}
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !298, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !299, templateParams: !14, identifier: "d2df09569ea43718984b3f07c77d7786")
!298 = !DINamespace(name: "result", scope: !26)
!299 = !{!300}
!300 = !DICompositeType(tag: DW_TAG_variant_part, scope: !297, file: !2, size: 8, align: 8, elements: !301, templateParams: !14, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !314)
!301 = !{!302, !310}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !300, file: !2, baseType: !303, size: 8, align: 8, extraData: i128 0)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !297, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !304, templateParams: !306, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !303, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!306 = !{!307, !308}
!307 = !DITemplateTypeParameter(name: "T", type: !7)
!308 = !DITemplateTypeParameter(name: "E", type: !309)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !210, file: !2, align: 8, flags: DIFlagPublic, elements: !14, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !300, file: !2, baseType: !311, size: 8, align: 8, extraData: i128 1)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !297, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !312, templateParams: !306, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !311, file: !2, baseType: !309, align: 8, offset: 8, flags: DIFlagPublic)
!314 = !DIDerivedType(tag: DW_TAG_member, scope: !297, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagArtificial)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !316, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !210, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !317, templateParams: !14, identifier: "9d9578b0f9368582a2201563ca126cd4")
!317 = !{!318, !319, !320, !321, !335, !336}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !2, baseType: !34, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !316, file: !2, baseType: !242, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !316, file: !2, baseType: !244, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !316, file: !2, baseType: !322, size: 128, align: 64, flags: DIFlagPrivate)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !103, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !323, templateParams: !14, identifier: "3850c4a210aea148b16f79ec227c427")
!323 = !{!324}
!324 = !DICompositeType(tag: DW_TAG_variant_part, scope: !322, file: !2, size: 128, align: 64, elements: !325, templateParams: !14, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !334)
!325 = !{!326, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !324, file: !2, baseType: !327, size: 128, align: 64, extraData: i128 0)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !322, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !14, templateParams: !328, identifier: "10be3845cc366e59d680126f255dea8b")
!328 = !{!329}
!329 = !DITemplateTypeParameter(name: "T", type: !9)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !324, file: !2, baseType: !331, size: 128, align: 64, extraData: i128 1)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !322, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !332, templateParams: !328, identifier: "d166501012b6febc55685f1b3285acb8")
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !331, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!334 = !DIDerivedType(tag: DW_TAG_member, scope: !322, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !316, file: !2, baseType: !322, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !316, file: !2, baseType: !337, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !338, templateParams: !14, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!338 = !{!339, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !337, file: !2, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64, dwarfAddressSpace: 0)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !14, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !337, file: !2, baseType: !343, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !344, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 6, lowerBound: 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !284, file: !2, baseType: !348, size: 128, align: 64, extraData: i128 0)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !282, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !349, templateParams: !14, identifier: "fb37c399e04d1117cfdf49fc8e0ef2cd")
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !348, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!351 = !DIDerivedType(tag: DW_TAG_member, scope: !282, file: !2, baseType: !29, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !275, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "<std::os::fd::owned::OwnedFd as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::os::fd::owned::OwnedFd as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !356, vtableHolder: !44, templateParams: !14, identifier: "74cc41ba880f7d293c9e2ae4df3b79b6")
!356 = !{!357, !358, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !355, file: !2, baseType: !6, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !355, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !355, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !355, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "<polling::epoll::Notifier as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "<polling::epoll::Notifier as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !364, vtableHolder: !77, templateParams: !14, identifier: "45d6949846804b285624d302d0fae1bd")
!364 = !{!365, !366, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !363, file: !2, baseType: !6, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !363, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !363, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !363, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&i32> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&i32> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !372, vtableHolder: !377, templateParams: !14, identifier: "4eb5b66aa69f16c8f16e08fa0f1e3655")
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !371, file: !2, baseType: !6, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !371, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !371, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&i32>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !378, templateParams: !380, identifier: "a60da24c2f5c7cb87b189d36a406c589")
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !377, file: !2, baseType: !12, size: 64, align: 64, flags: DIFlagPrivate)
!380 = !{!381}
!381 = !DITemplateTypeParameter(name: "T", type: !12)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&polling::epoll::Notifier> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&polling::epoll::Notifier> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !385, vtableHolder: !390, templateParams: !14, identifier: "2da915902db3e60085f5ad622ea07c97")
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !384, file: !2, baseType: !6, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !384, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !384, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !384, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&polling::epoll::Notifier>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !391, templateParams: !393, identifier: "f64199aefe4ac538fe80baf9f60bb5d0")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !76, size: 64, align: 64, flags: DIFlagPrivate)
!393 = !{!394}
!394 = !DITemplateTypeParameter(name: "T", type: !76)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&core::option::Option<std::os::fd::owned::OwnedFd>> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&core::option::Option<std::os::fd::owned::OwnedFd>> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !398, vtableHolder: !403, templateParams: !14, identifier: "5367882623cfb4826ecac9cf5945c493")
!398 = !{!399, !400, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !397, file: !2, baseType: !6, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !397, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !397, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !397, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&core::option::Option<std::os::fd::owned::OwnedFd>>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !404, templateParams: !406, identifier: "3283fdb110f877456584549bc123bada")
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !403, file: !2, baseType: !163, size: 64, align: 64, flags: DIFlagPrivate)
!406 = !{!407}
!407 = !DITemplateTypeParameter(name: "T", type: !163)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&polling::Event> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&polling::Event> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !411, vtableHolder: !416, templateParams: !14, identifier: "63e6d117726f1d43479248081a5146be")
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !410, file: !2, baseType: !6, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !410, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !410, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !410, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&polling::Event>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !417, templateParams: !419, identifier: "b71532ae36c600d81c1df0029ef6f17a")
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !416, file: !2, baseType: !124, size: 64, align: 64, flags: DIFlagPrivate)
!419 = !{!420}
!420 = !DITemplateTypeParameter(name: "T", type: !124)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&std::os::fd::owned::BorrowedFd> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&std::os::fd::owned::BorrowedFd> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !424, vtableHolder: !429, templateParams: !14, identifier: "732349d457f8d451ab80c4b855837170")
!424 = !{!425, !426, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !423, file: !2, baseType: !6, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !423, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !423, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&std::os::fd::owned::BorrowedFd>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !430, templateParams: !432, identifier: "6b01f0e189756f2e518fbdfa1c482e7c")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !429, file: !2, baseType: !146, size: 64, align: 64, flags: DIFlagPrivate)
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !146)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "<tracing_core::field::DebugValue<&usize> as tracing_core::field::Value>::{vtable}", scope: null, file: !2, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DebugValue<&usize> as tracing_core::field::Value>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !437, vtableHolder: !442, templateParams: !14, identifier: "7545a2e0d510f26649caf7f21e46ffc9")
!437 = !{!438, !439, !440, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !436, file: !2, baseType: !6, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !436, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !436, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !436, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugValue<&usize>", scope: !195, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !443, templateParams: !445, identifier: "db5b3f08571ec7d6ca6ce2ba6dd66c68")
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !442, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagPrivate)
!445 = !{!446}
!446 = !DITemplateTypeParameter(name: "T", type: !185)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller3new10__CALLSITE17hec36334e3b9ca9dbE", scope: !449, file: !451, line: 855, type: !452, isLocal: true, isDefinition: true, align: 64)
!449 = !DINamespace(name: "new", scope: !450)
!450 = !DINamespace(name: "{impl#0}", scope: !78)
!451 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-0.1.40/src/macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "34a718c8ff82fa3bebcb757ba2727a5d")
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "DefaultCallsite", scope: !453, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !454, templateParams: !14, identifier: "773cae9b69570b4df1b9f369e670ea0b")
!453 = !DINamespace(name: "callsite", scope: !196)
!454 = !{!455, !467, !468, !533}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "interest", scope: !452, file: !2, baseType: !456, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU8", scope: !457, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !459, templateParams: !14, identifier: "ffd090b159fd8fe6731cd1b8f498bbda")
!457 = !DINamespace(name: "atomic", scope: !458)
!458 = !DINamespace(name: "sync", scope: !26)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !456, file: !2, baseType: !461, size: 8, align: 8, flags: DIFlagPrivate)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !462, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !463, templateParams: !465, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!462 = !DINamespace(name: "cell", scope: !26)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !461, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagPrivate)
!465 = !{!466}
!466 = !DITemplateTypeParameter(name: "T", type: !221)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "registration", scope: !452, file: !2, baseType: !456, size: 8, align: 8, offset: 136, flags: DIFlagPrivate)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "meta", scope: !452, file: !2, baseType: !469, size: 64, align: 64, flags: DIFlagPrivate)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::metadata::Metadata", baseType: !470, size: 64, align: 64, dwarfAddressSpace: 0)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Metadata", scope: !471, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !472, templateParams: !14, identifier: "3b84479356cedceecb2a6e9a052a0bb")
!471 = !DINamespace(name: "metadata", scope: !196)
!472 = !{!473, !474, !475, !486, !500, !501, !515, !529}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !470, file: !2, baseType: !217, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !470, file: !2, baseType: !217, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !470, file: !2, baseType: !476, size: 64, align: 64, flags: DIFlagPrivate)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Level", scope: !471, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !477, templateParams: !14, identifier: "3d305f8aa09ff344e25a3e8e657c6f0")
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !476, file: !2, baseType: !479, size: 64, align: 64, flags: DIFlagPrivate)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LevelInner", scope: !471, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagEnumClass, elements: !480)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIEnumerator(name: "Trace", value: 0, isUnsigned: true)
!482 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!483 = !DIEnumerator(name: "Info", value: 2, isUnsigned: true)
!484 = !DIEnumerator(name: "Warn", value: 3, isUnsigned: true)
!485 = !DIEnumerator(name: "Error", value: 4, isUnsigned: true)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "module_path", scope: !470, file: !2, baseType: !487, size: 128, align: 64, offset: 640, flags: DIFlagPrivate)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !103, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !488, templateParams: !14, identifier: "c9cc8e2c9bc8d3061e54de437c9b5882")
!488 = !{!489}
!489 = !DICompositeType(tag: DW_TAG_variant_part, scope: !487, file: !2, size: 128, align: 64, elements: !490, templateParams: !14, identifier: "dc91c89dee9d03b772ff0b7d0b60a9cb", discriminator: !499)
!490 = !{!491, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !489, file: !2, baseType: !492, size: 128, align: 64, extraData: i128 0)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !487, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !14, templateParams: !493, identifier: "20871c480156d021cbbc4b2eec20a35c")
!493 = !{!494}
!494 = !DITemplateTypeParameter(name: "T", type: !217)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !489, file: !2, baseType: !496, size: 128, align: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !487, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !497, templateParams: !493, identifier: "2bd48e68865dce7a72b4a9887ea344e7")
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !496, file: !2, baseType: !217, size: 128, align: 64, flags: DIFlagPublic)
!499 = !DIDerivedType(tag: DW_TAG_member, scope: !487, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagArtificial)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !470, file: !2, baseType: !487, size: 128, align: 64, offset: 768, flags: DIFlagPrivate)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !470, file: !2, baseType: !502, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u32>", scope: !103, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !503, templateParams: !14, identifier: "ebe2cffeee76dada7a14f25e4750045b")
!503 = !{!504}
!504 = !DICompositeType(tag: DW_TAG_variant_part, scope: !502, file: !2, size: 64, align: 32, elements: !505, templateParams: !14, identifier: "3a58987d801709f0f7fa9f7e54d1fd1d", discriminator: !514)
!505 = !{!506, !510}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !504, file: !2, baseType: !507, size: 64, align: 32, extraData: i128 0)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !502, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !14, templateParams: !508, identifier: "e28adf562df1b32c687fa9358c66829a")
!508 = !{!509}
!509 = !DITemplateTypeParameter(name: "T", type: !34)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !504, file: !2, baseType: !511, size: 64, align: 32, extraData: i128 1)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !502, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !512, templateParams: !508, identifier: "f83975a5848a2c13d4de936bd3cabeef")
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !511, file: !2, baseType: !34, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!514 = !DIDerivedType(tag: DW_TAG_member, scope: !502, file: !2, baseType: !34, size: 32, align: 32, flags: DIFlagArtificial)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !470, file: !2, baseType: !516, size: 256, align: 64, offset: 384, flags: DIFlagPrivate)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldSet", scope: !195, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !517, templateParams: !14, identifier: "642257ca0ce4840b22f807882fb913e5")
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !516, file: !2, baseType: !213, size: 128, align: 64, flags: DIFlagPrivate)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "callsite", scope: !516, file: !2, baseType: !520, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Identifier", scope: !453, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !521, templateParams: !14, identifier: "694a2c46ec2152c644a6ea782ce3d0c9")
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !520, file: !2, baseType: !523, size: 128, align: 64, flags: DIFlagPublic)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "&dyn tracing_core::callsite::Callsite", file: !2, size: 128, align: 64, elements: !524, templateParams: !14, identifier: "df1a176f56d6ca7c28bcf92f700ee32a")
!524 = !{!525, !528}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !523, file: !2, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64, dwarfAddressSpace: 0)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn tracing_core::callsite::Callsite", file: !2, align: 8, elements: !14, identifier: "5c748cc422d45a5e574d89abc4ee022")
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !523, file: !2, baseType: !343, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !470, file: !2, baseType: !530, size: 8, align: 8, offset: 896, flags: DIFlagPrivate)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "Kind", scope: !471, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !531, templateParams: !14, identifier: "4cc597743dd29f5ff357f7fb040d40ab")
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !530, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagPrivate)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !452, file: !2, baseType: !534, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<tracing_core::callsite::DefaultCallsite>", scope: !457, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !535, templateParams: !543, identifier: "29cbd457f15c06cbe7bfd5420cac594")
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !534, file: !2, baseType: !537, size: 64, align: 64, flags: DIFlagPrivate)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut tracing_core::callsite::DefaultCallsite>", scope: !462, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !538, templateParams: !541, identifier: "c3dde6f4f12246fb30cb569cd65cfeca")
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !537, file: !2, baseType: !540, size: 64, align: 64, flags: DIFlagPrivate)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut tracing_core::callsite::DefaultCallsite", baseType: !452, size: 64, align: 64, dwarfAddressSpace: 0)
!541 = !{!542}
!542 = !DITemplateTypeParameter(name: "T", type: !540)
!543 = !{!544}
!544 = !DITemplateTypeParameter(name: "T", type: !452)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller3new10__CALLSITE4META17h08de216c26f3d795E", scope: !547, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!547 = !DINamespace(name: "__CALLSITE", scope: !449)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller3add10__CALLSITE17h37b8384db6931546E", scope: !550, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!550 = !DINamespace(name: "add", scope: !450)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller3add10__CALLSITE4META17hebb619e5dd9d641eE", scope: !553, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!553 = !DINamespace(name: "__CALLSITE", scope: !550)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller6modify10__CALLSITE17hc86c8170a05943afE", scope: !556, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!556 = !DINamespace(name: "modify", scope: !450)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller6modify10__CALLSITE4META17hff28d8b06f6b3e4fE", scope: !559, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!559 = !DINamespace(name: "__CALLSITE", scope: !556)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller6delete10__CALLSITE17h0f0feff83fb1a812E", scope: !562, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!562 = !DINamespace(name: "delete", scope: !450)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller6delete10__CALLSITE4META17h476a1aff59261d2eE", scope: !565, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!565 = !DINamespace(name: "__CALLSITE", scope: !562)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller4wait10__CALLSITE17h47f04eb2909634b5E", scope: !568, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!568 = !DINamespace(name: "wait", scope: !450)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller4wait10__CALLSITE4META17h7c7b56eeaf624c9bE", scope: !571, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!571 = !DINamespace(name: "__CALLSITE", scope: !568)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller4wait10__CALLSITE17h7453f744fe2b907bE", scope: !568, file: !451, line: 855, type: !452, isLocal: true, isDefinition: true, align: 64)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller4wait10__CALLSITE4META17h06f28c7bf42b67f5E", scope: !571, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll6Poller6notify10__CALLSITE17h522be93396b29ed0E", scope: !578, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!578 = !DINamespace(name: "notify", scope: !450)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll6Poller6notify10__CALLSITE4META17h039b9d0d49887895E", scope: !581, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!581 = !DINamespace(name: "__CALLSITE", scope: !578)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN64_$LT$polling..epoll..Poller$u20$as$u20$core..ops..drop..Drop$GT$4drop10__CALLSITE17h97c28092cdbf48b9E", scope: !584, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!584 = !DINamespace(name: "drop", scope: !585)
!585 = !DINamespace(name: "{impl#3}", scope: !78)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN64_$LT$polling..epoll..Poller$u20$as$u20$core..ops..drop..Drop$GT$4drop10__CALLSITE4META17hb6538cadac2b1853E", scope: !588, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!588 = !DINamespace(name: "__CALLSITE", scope: !584)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "<&rustix::backend::event::epoll::EventFlags as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&rustix::backend::event::epoll::EventFlags as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !592, vtableHolder: !597, templateParams: !14, identifier: "29bf2a90f3c57a5acd67313fd12151ce")
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !591, file: !2, baseType: !6, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !591, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !591, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !591, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&rustix::backend::event::epoll::EventFlags", baseType: !135, size: 64, align: 64, dwarfAddressSpace: 0)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll8Notifier3new10__CALLSITE17h4b92554da2d095ebE", scope: !600, file: !451, line: 855, type: !452, isLocal: true, isDefinition: true, align: 64)
!600 = !DINamespace(name: "new", scope: !601)
!601 = !DINamespace(name: "{impl#7}", scope: !78)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll8Notifier3new10__CALLSITE4META17h666d9223853b8bc3E", scope: !604, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!604 = !DINamespace(name: "__CALLSITE", scope: !600)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling5epoll8Notifier3new10__CALLSITE17h264b12b1c2376d77E", scope: !600, file: !451, line: 855, type: !452, isLocal: true, isDefinition: true, align: 64)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling5epoll8Notifier3new10__CALLSITE4META17h83bf2172330e6193E", scope: !604, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !612, vtableHolder: !9, templateParams: !14, identifier: "3ce104670d23cbc41299f657a9cf1bea")
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !611, file: !2, baseType: !6, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !611, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !611, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !611, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !620, vtableHolder: !129, templateParams: !14, identifier: "cff74116dd1b0531eb9ac650399ff52a")
!620 = !{!621, !622, !623, !624}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !619, file: !2, baseType: !6, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !619, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !619, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "<&polling::epoll::EventExtra as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&polling::epoll::EventExtra as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !628, vtableHolder: !633, templateParams: !14, identifier: "9a78933f1c9c9b248b400072688675af")
!628 = !{!629, !630, !631, !632}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !627, file: !2, baseType: !6, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !627, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !627, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !627, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&polling::epoll::EventExtra", baseType: !132, size: 64, align: 64, dwarfAddressSpace: 0)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling6Poller4wait10__CALLSITE17hfff4fb7d3cc58575E", scope: !636, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!636 = !DINamespace(name: "wait", scope: !637)
!637 = !DINamespace(name: "{impl#1}", scope: !79)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling6Poller4wait10__CALLSITE4META17h55cdb23235fb2250E", scope: !640, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!640 = !DINamespace(name: "__CALLSITE", scope: !636)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling6Poller4wait10__CALLSITE17h8b9b028e75e7462aE", scope: !636, file: !451, line: 855, type: !452, isLocal: true, isDefinition: true, align: 64)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling6Poller4wait10__CALLSITE4META17h6bd8b1026a32c8bdE", scope: !640, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "__CALLSITE", linkageName: "_ZN7polling6Poller6notify10__CALLSITE17h20222309140bd817E", scope: !647, file: !451, line: 58, type: !452, isLocal: true, isDefinition: true, align: 64)
!647 = !DINamespace(name: "notify", scope: !637)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "META", linkageName: "_ZN7polling6Poller6notify10__CALLSITE4META17h9d41877697a67af8E", scope: !650, file: !451, line: 2763, type: !470, isLocal: true, isDefinition: true, align: 64)
!650 = !DINamespace(name: "__CALLSITE", scope: !647)
!651 = !{i32 8, !"PIC Level", i32 2}
!652 = !{i32 2, !"RtLibUseGOT", i32 1}
!653 = !{i32 2, !"Dwarf Version", i32 4}
!654 = !{i32 2, !"Debug Info Version", i32 3}
!655 = !{!"rustc version 1.80.0-dev"}
!656 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !657, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !658, globals: !824, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/polling-3.3.1/src/lib.rs/@/polling.a101f00402e4d7f3-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/polling-3.3.1")
!658 = !{!659, !479, !664, !670, !677, !244, !722, !790, !796, !802, !811, !817}
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !660, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !661)
!660 = !DINamespace(name: "ffi", scope: !26)
!661 = !{!662, !663}
!662 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!663 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InterestKind", scope: !665, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !666)
!665 = !DINamespace(name: "subscriber", scope: !196)
!666 = !{!667, !668, !669}
!667 = !DIEnumerator(name: "Never", value: 0, isUnsigned: true)
!668 = !DIEnumerator(name: "Sometimes", value: 1, isUnsigned: true)
!669 = !DIEnumerator(name: "Always", value: 2, isUnsigned: true)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !457, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !671)
!671 = !{!672, !673, !674, !675, !676}
!672 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!673 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!674 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!675 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!676 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !678, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !680)
!678 = !DINamespace(name: "error", scope: !679)
!679 = !DINamespace(name: "io", scope: !48)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!681 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!682 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!683 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!684 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!685 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!686 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!687 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!688 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!689 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!690 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!691 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!692 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!693 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!694 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!695 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!696 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!697 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!698 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!699 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!700 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!701 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!702 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!703 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!704 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!705 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!706 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!707 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!708 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!709 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!710 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!711 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!712 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!713 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!714 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!715 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!716 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!717 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!718 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!719 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!720 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!721 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !723, file: !2, baseType: !29, size: 64, align: 64, flags: DIFlagEnumClass, elements: !725)
!723 = !DINamespace(name: "alignment", scope: !724)
!724 = !DINamespace(name: "ptr", scope: !26)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!726 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!727 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!728 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!729 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!730 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!731 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!732 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!733 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!734 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!735 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!736 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!737 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!738 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!739 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!740 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!741 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!742 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!743 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!744 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!745 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!746 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!747 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!748 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!749 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!750 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!751 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!752 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!753 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!754 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!755 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!756 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!757 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!758 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!759 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!760 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!761 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!762 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!763 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!764 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!765 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!766 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!767 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!768 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!769 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!770 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!771 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!772 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!773 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!774 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!775 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!776 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!777 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!778 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!779 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!780 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!781 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!782 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!783 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!784 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!785 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!786 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!787 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!788 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!789 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !791, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !792)
!791 = !DINamespace(name: "panicking", scope: !26)
!792 = !{!793, !794, !795}
!793 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!794 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!795 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !797, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !799)
!797 = !DINamespace(name: "raw_vec", scope: !798)
!798 = !DINamespace(name: "alloc", scope: null)
!799 = !{!800, !801}
!800 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!801 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimerfdClockId", scope: !803, file: !2, baseType: !34, size: 32, align: 32, flags: DIFlagEnumClass, elements: !805)
!803 = !DINamespace(name: "types", scope: !804)
!804 = !DINamespace(name: "time", scope: !64)
!805 = !{!806, !807, !808, !809, !810}
!806 = !DIEnumerator(name: "Realtime", value: 0, isUnsigned: true)
!807 = !DIEnumerator(name: "Monotonic", value: 1, isUnsigned: true)
!808 = !DIEnumerator(name: "Boottime", value: 7, isUnsigned: true)
!809 = !DIEnumerator(name: "RealtimeAlarm", value: 8, isUnsigned: true)
!810 = !DIEnumerator(name: "BoottimeAlarm", value: 9, isUnsigned: true)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PollMode", scope: !79, file: !2, baseType: !221, size: 8, align: 8, flags: DIFlagEnumClass, elements: !812)
!812 = !{!813, !814, !815, !816}
!813 = !DIEnumerator(name: "Oneshot", value: 0, isUnsigned: true)
!814 = !DIEnumerator(name: "Level", value: 1, isUnsigned: true)
!815 = !DIEnumerator(name: "Edge", value: 2, isUnsigned: true)
!816 = !DIEnumerator(name: "EdgeOneshot", value: 3, isUnsigned: true)
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !818, file: !2, baseType: !819, size: 8, align: 8, flags: DIFlagEnumClass, elements: !820)
!818 = !DINamespace(name: "cmp", scope: !26)
!819 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!820 = !{!821, !822, !823}
!821 = !DIEnumerator(name: "Less", value: -1)
!822 = !DIEnumerator(name: "Equal", value: 0)
!823 = !DIEnumerator(name: "Greater", value: 1)
!824 = !{!0, !15, !35, !51, !68, !93, !116, !138, !155, !177, !186, !201, !353, !361, !369, !382, !395, !408, !421, !434, !447, !545, !548, !551, !554, !557, !560, !563, !566, !569, !572, !574, !576, !579, !582, !586, !589, !598, !602, !605, !607, !609, !617, !625, !634, !638, !641, !643, !645, !648}
!825 = distinct !DISubprogram(name: "private_type_id<tracing_core::callsite::DefaultCallsite>", linkageName: "_ZN12tracing_core8callsite8Callsite15private_type_id17he95e1da1da6afd5bE", scope: !827, file: !826, line: 165, type: !828, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !656, templateParams: !852, retainedNodes: !849)
!826 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32/src/callsite.rs", directory: "", checksumkind: CSK_MD5, checksum: "86f95afea5a472a4bec30b265a2b36ee")
!827 = !DINamespace(name: "Callsite", scope: !453)
!828 = !DISubroutineType(types: !829)
!829 = !{!830, !844, !845}
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "Private<core::any::TypeId>", scope: !831, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !832, templateParams: !842, identifier: "46ca186d36d6da88b9714a4fe624463")
!831 = !DINamespace(name: "private", scope: !453)
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !830, file: !2, baseType: !834, size: 128, align: 64, flags: DIFlagProtected)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !835, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !836, templateParams: !14, identifier: "1f815785d12164cd5cc5e245629d60e2")
!835 = !DINamespace(name: "any", scope: !26)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !834, file: !2, baseType: !838, size: 128, align: 64, flags: DIFlagPrivate)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, u64)", file: !2, size: 128, align: 64, elements: !839, templateParams: !14, identifier: "19e9be5b2400f26b5a124525aae10cbb")
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !838, file: !2, baseType: !29, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !838, file: !2, baseType: !29, size: 64, align: 64, offset: 64)
!842 = !{!843}
!843 = !DITemplateTypeParameter(name: "T", type: !834)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::callsite::DefaultCallsite", baseType: !452, size: 64, align: 64, dwarfAddressSpace: 0)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "Private<()>", scope: !831, file: !2, align: 8, flags: DIFlagPublic, elements: !846, templateParams: !848, identifier: "83fe298c1dd6d21672fbaea45d698d51")
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !845, file: !2, baseType: !7, align: 8, flags: DIFlagProtected)
!848 = !{!307}
!849 = !{!850, !851}
!850 = !DILocalVariable(name: "self", arg: 1, scope: !825, file: !826, line: 165, type: !844)
!851 = !DILocalVariable(arg: 2, scope: !825, file: !826, line: 165, type: !845)
!852 = !{!853}
!853 = !DITemplateTypeParameter(name: "Self", type: !452)
!854 = !DILocation(line: 0, scope: !825)
!855 = !DILocation(line: 165, column: 31, scope: !825)
!856 = !DILocation(line: 170, column: 6, scope: !825)
!857 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h40eba7a03f944241E", scope: !859, file: !858, line: 2385, type: !860, scopeLine: 2385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !656, templateParams: !14, retainedNodes: !863)
!858 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!859 = !DINamespace(name: "{impl#12}", scope: !210)
!860 = !DISubroutineType(types: !861)
!861 = !{!297, !862, !315}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!863 = !{!864, !865}
!864 = !DILocalVariable(name: "self", arg: 1, scope: !857, file: !858, line: 2385, type: !862)
!865 = !DILocalVariable(name: "f", arg: 2, scope: !857, file: !858, line: 2385, type: !315)
!866 = !DILocation(line: 0, scope: !857)
!867 = !DILocation(line: 2386, column: 9, scope: !857)
!868 = !DILocation(line: 2387, column: 6, scope: !857)
!869 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h121b9f8992263bf2E", scope: !870, file: !858, line: 2354, type: !871, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !656, templateParams: !877, retainedNodes: !874)
!870 = !DINamespace(name: "{impl#51}", scope: !210)
!871 = !DISubroutineType(types: !872)
!872 = !{!297, !873, !315}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&i32", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!874 = !{!875, !876}
!875 = !DILocalVariable(name: "self", arg: 1, scope: !869, file: !858, line: 2354, type: !873)
!876 = !DILocalVariable(name: "f", arg: 2, scope: !869, file: !858, line: 2354, type: !315)
!877 = !{!878}
!878 = !DITemplateTypeParameter(name: "T", type: !13)
!879 = !DILocation(line: 0, scope: !869)
!880 = !DILocation(line: 2354, column: 71, scope: !869)
!881 = !{i64 4}
!882 = !DILocalVariable(name: "self", arg: 1, scope: !883, file: !884, line: 189, type: !12)
!883 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hc803126657500a98E", scope: !885, file: !884, line: 189, type: !887, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !656, templateParams: !14, retainedNodes: !889)
!884 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "5d2b54fa2f493740652965deb7ce1e35")
!885 = !DINamespace(name: "{impl#80}", scope: !886)
!886 = !DINamespace(name: "num", scope: !210)
!887 = !DISubroutineType(types: !888)
!888 = !{!297, !12, !315}
!889 = !{!882, !890}
!890 = !DILocalVariable(name: "f", arg: 2, scope: !883, file: !884, line: 189, type: !315)
!891 = !DILocation(line: 0, scope: !883, inlinedAt: !892)
!892 = distinct !DILocation(line: 2354, column: 62, scope: !869)
!893 = !DILocalVariable(name: "self", arg: 1, scope: !894, file: !858, line: 1907, type: !315)
!894 = distinct !DILexicalBlock(scope: !895, file: !858, line: 1907, column: 5)
