; ModuleID = 'signal_hook_registry.f2f239908bdd14e2-cgu.0'
source_filename = "signal_hook_registry.f2f239908bdd14e2-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::sys::thread_local::fast_local::lazy::Storage<core::cell::Cell<(u64, u64)>, !>" = type { %"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::Cell<(u64, u64)>, !>>" }
%"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::Cell<(u64, u64)>, !>>" = type { %"std::sys::thread_local::fast_local::lazy::State<core::cell::Cell<(u64, u64)>, !>" }
%"std::sys::thread_local::fast_local::lazy::State<core::cell::Cell<(u64, u64)>, !>" = type { i64, [2 x i64] }
%"core::sync::atomic::AtomicUsize" = type { i64 }
%Slot = type { %Prev, %"alloc::collections::btree::map::BTreeMap<ActionId, alloc::sync::Arc<dyn for<'a> core::ops::function::Fn(&'a libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t) + core::marker::Send + core::marker::Sync>>" }
%Prev = type { %"libc::unix::linux_like::linux::gnu::b64::x86_64::sigaction", i32, [1 x i32] }
%"libc::unix::linux_like::linux::gnu::b64::x86_64::sigaction" = type { i64, %"libc::unix::linux_like::linux::gnu::b64::sigset_t", i32, [1 x i32], ptr }
%"libc::unix::linux_like::linux::gnu::b64::sigset_t" = type { [16 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_DATA", linkageName: "_ZN20signal_hook_registry11GLOBAL_DATA17h75b5ce311239b443E", scope: !2, file: !3, line: 281, type: !4, isLocal: true, isDefinition: true, align: 64)
!2 = !DINamespace(name: "signal_hook_registry", scope: null)
!3 = !DIFile(filename: "src/lib.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/signal-hook-registry-1.4.1", checksumkind: CSK_MD5, checksum: "60b7c268bf4684ba3d84e64c0115e491")
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<signal_hook_registry::GlobalData>", scope: !6, file: !5, size: 704, align: 64, flags: DIFlagPublic, elements: !8, templateParams: !13, identifier: "fc50a1e2171fd6d0d2659d4cb4ac1c08")
!5 = !DIFile(filename: "<unknown>", directory: "")
!6 = !DINamespace(name: "option", scope: !7)
!7 = !DINamespace(name: "core", scope: null)
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_variant_part, scope: !4, file: !5, size: 704, align: 64, elements: !10, templateParams: !13, identifier: "63b872be7ac7c5f44f54e3761f36312", discriminator: !416)
!10 = !{!11, !412}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !9, file: !5, baseType: !12, size: 704, align: 64, extraData: i128 0)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !4, file: !5, size: 704, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !14, identifier: "9d964f9fa4470cbdc3d5dd9fc14c3e69")
!13 = !{}
!14 = !{!15}
!15 = !DITemplateTypeParameter(name: "T", type: !16)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlobalData", scope: !2, file: !5, size: 640, align: 64, flags: DIFlagPrivate, elements: !17, templateParams: !13, identifier: "7177781d4006e282311155aeacc9a868")
!17 = !{!18, !379}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !16, file: !5, baseType: !19, size: 320, align: 64, flags: DIFlagPrivate)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "HalfLock<signal_hook_registry::SignalData>", scope: !20, file: !5, size: 320, align: 64, flags: DIFlagProtected, elements: !21, templateParams: !25, identifier: "fe702f78921985b0a0e6bc98db8f701d")
!20 = !DINamespace(name: "half_lock", scope: !2)
!21 = !{!22, !325, !335, !336, !340}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_t", scope: !19, file: !5, baseType: !23, align: 8, offset: 320, flags: DIFlagPrivate)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<signal_hook_registry::SignalData>", scope: !24, file: !5, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !25, identifier: "69951793843b3a829fbfb2620d01c3c1")
!24 = !DINamespace(name: "marker", scope: !7)
!25 = !{!26}
!26 = !DITemplateTypeParameter(name: "T", type: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "SignalData", scope: !2, file: !5, size: 512, align: 128, flags: DIFlagPrivate, elements: !28, templateParams: !13, identifier: "c1d7c7469e2cf4eacbf375ba0a69aa22")
!28 = !{!29, !324}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "signals", scope: !27, file: !5, baseType: !30, size: 384, align: 64, flags: DIFlagPrivate)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<i32, signal_hook_registry::Slot, std::hash::random::RandomState>", scope: !31, file: !5, size: 384, align: 64, flags: DIFlagPublic, elements: !35, templateParams: !323, identifier: "df89106ece3bb9ceaf92879eac9caa58")
!31 = !DINamespace(name: "map", scope: !32)
!32 = !DINamespace(name: "hash", scope: !33)
!33 = !DINamespace(name: "collections", scope: !34)
!34 = !DINamespace(name: "std", scope: null)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !30, file: !5, baseType: !37, size: 384, align: 64, flags: DIFlagPrivate)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<i32, signal_hook_registry::Slot, std::hash::random::RandomState, alloc::alloc::Global>", scope: !38, file: !5, size: 384, align: 64, flags: DIFlagPublic, elements: !40, templateParams: !319, identifier: "b594f74dcf74f3342c96f96321ecfcb0")
!38 = !DINamespace(name: "map", scope: !39)
!39 = !DINamespace(name: "hashbrown", scope: null)
!40 = !{!41, !49}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !37, file: !5, baseType: !42, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !43, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !13, identifier: "3de5c15f3baf62b2f84c9b0bb0c2fdd")
!43 = !DINamespace(name: "random", scope: !44)
!44 = !DINamespace(name: "hash", scope: !34)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !42, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagPrivate)
!47 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !42, file: !5, baseType: !47, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !37, file: !5, baseType: !50, size: 256, align: 64, flags: DIFlagProtected)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(i32, signal_hook_registry::Slot), alloc::alloc::Global>", scope: !51, file: !5, size: 256, align: 64, flags: DIFlagPublic, elements: !52, templateParams: !318, identifier: "920745d244278122299920d9aefa29bd")
!51 = !DINamespace(name: "raw", scope: !39)
!52 = !{!53, !70, !74}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !50, file: !5, baseType: !54, size: 256, align: 64, flags: DIFlagPrivate)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTableInner", scope: !51, file: !5, size: 256, align: 64, flags: DIFlagPrivate, elements: !55, templateParams: !13, identifier: "3e56e1ccbdf318246ae2e5a04f9c862c")
!55 = !{!56, !58, !68, !69}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !54, file: !5, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!57 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !54, file: !5, baseType: !59, size: 64, align: 64, flags: DIFlagPrivate)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !60, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !62, templateParams: !66, identifier: "a4acf166b74ef43af1db8d6335ca167e")
!60 = !DINamespace(name: "non_null", scope: !61)
!61 = !DINamespace(name: "ptr", scope: !7)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !59, file: !5, baseType: !64, size: 64, align: 64, flags: DIFlagPrivate)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "T", type: !65)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !54, file: !5, baseType: !57, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !54, file: !5, baseType: !57, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !50, file: !5, baseType: !71, align: 8, offset: 256, flags: DIFlagPrivate)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !72, file: !5, align: 8, flags: DIFlagPublic, elements: !13, identifier: "14de19725ec4b1fd38fae074afd4da08")
!72 = !DINamespace(name: "alloc", scope: !73)
!73 = !DINamespace(name: "alloc", scope: null)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !50, file: !5, baseType: !75, align: 8, offset: 256, flags: DIFlagPrivate)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(i32, signal_hook_registry::Slot)>", scope: !24, file: !5, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !76, identifier: "c43bd0f01990e696f2119ee8476024ea")
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "(i32, signal_hook_registry::Slot)", file: !5, size: 1536, align: 64, elements: !79, templateParams: !13, identifier: "ef836a3e74fa4f5d30eb5031580609c0")
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !78, file: !5, baseType: !81, size: 32, align: 32)
!81 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !78, file: !5, baseType: !83, size: 1472, align: 64, offset: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Slot", scope: !2, file: !5, size: 1472, align: 64, flags: DIFlagPrivate, elements: !84, templateParams: !13, identifier: "31830620a5752ef8cab97eb29c29ec25")
!84 = !{!85, !125}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !5, baseType: !86, size: 1280, align: 64, flags: DIFlagPrivate)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prev", scope: !2, file: !5, size: 1280, align: 64, flags: DIFlagPrivate, elements: !87, templateParams: !13, identifier: "a175784ababd0eb8baeaf299af2e442c")
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !86, file: !5, baseType: !81, size: 32, align: 32, offset: 1216, flags: DIFlagPrivate)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !86, file: !5, baseType: !90, size: 1216, align: 64, flags: DIFlagPrivate)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", scope: !91, file: !5, size: 1216, align: 64, flags: DIFlagPublic, elements: !98, templateParams: !13, identifier: "45781959a3a539cca279891f7ebe84c2")
!91 = !DINamespace(name: "x86_64", scope: !92)
!92 = !DINamespace(name: "b64", scope: !93)
!93 = !DINamespace(name: "gnu", scope: !94)
!94 = !DINamespace(name: "linux", scope: !95)
!95 = !DINamespace(name: "linux_like", scope: !96)
!96 = !DINamespace(name: "unix", scope: !97)
!97 = !DINamespace(name: "libc", scope: null)
!98 = !{!99, !100, !107, !108}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !90, file: !5, baseType: !57, size: 64, align: 64, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !90, file: !5, baseType: !101, size: 1024, align: 64, offset: 64, flags: DIFlagPublic)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigset_t", scope: !92, file: !5, size: 1024, align: 64, flags: DIFlagPublic, elements: !102, templateParams: !13, identifier: "c73d37e9767fae858496a9a3a23663f9")
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !101, file: !5, baseType: !104, size: 1024, align: 64, flags: DIFlagPrivate)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, align: 64, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16, lowerBound: 0)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !90, file: !5, baseType: !81, size: 32, align: 32, offset: 1088, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !90, file: !5, baseType: !109, size: 64, align: 64, offset: 1152, flags: DIFlagPublic)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<extern \22C\22 fn()>", scope: !6, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !110, templateParams: !13, identifier: "bc2888a47219a339021d2c2d993257e")
!110 = !{!111}
!111 = !DICompositeType(tag: DW_TAG_variant_part, scope: !109, file: !5, size: 64, align: 64, elements: !112, templateParams: !13, identifier: "7aa6c2e7440ae7f9ba926aa4de29cbc6", discriminator: !124)
!112 = !{!113, !120}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !111, file: !5, baseType: !114, size: 64, align: 64, extraData: i128 0)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !109, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !115, identifier: "b3764d0000d54ad868c01be76f6e6ff7")
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "T", type: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "extern \22C\22 fn()", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DISubroutineType(types: !119)
!119 = !{null}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !111, file: !5, baseType: !121, size: 64, align: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !109, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !122, templateParams: !115, identifier: "5988c64cb318c824c0dbe543ffa79ce")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !121, file: !5, baseType: !117, size: 64, align: 64, flags: DIFlagPublic)
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !109, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "actions", scope: !83, file: !5, baseType: !126, size: 192, align: 64, offset: 1280, flags: DIFlagPrivate)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "BTreeMap<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>, alloc::alloc::Global>", scope: !127, file: !5, size: 192, align: 64, flags: DIFlagPublic, elements: !130, templateParams: !317, identifier: "fc6fbd79d3e2abbb9fe6ea6d6232a880")
!127 = !DINamespace(name: "map", scope: !128)
!128 = !DINamespace(name: "btree", scope: !129)
!129 = !DINamespace(name: "collections", scope: !73)
!130 = !{!131, !301, !302, !308}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !126, file: !5, baseType: !132, size: 128, align: 64, flags: DIFlagPrivate)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::collections::btree::node::NodeRef<alloc::collections::btree::node::marker::Owned, signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>, alloc::collections::btree::node::marker::LeafOrInternal>>", scope: !6, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !133, templateParams: !13, identifier: "ade816c0007f83d5e6bd330e329605ac")
!133 = !{!134}
!134 = !DICompositeType(tag: DW_TAG_variant_part, scope: !132, file: !5, size: 128, align: 64, elements: !135, templateParams: !13, identifier: "9ba56c5c2683a466c8ef8595ff925afa", discriminator: !300)
!135 = !{!136, !296}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !134, file: !5, baseType: !137, size: 128, align: 64, extraData: i128 0)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !132, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !138, identifier: "dfebbc7a9fe1ce8ea7db90ec1a2b6446")
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "T", type: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "NodeRef<alloc::collections::btree::node::marker::Owned, signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>, alloc::collections::btree::node::marker::LeafOrInternal>", scope: !141, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !142, templateParams: !293, identifier: "4ad5ebf7a91ea4547b7e6a7f29ce1a74")
!141 = !DINamespace(name: "node", scope: !128)
!142 = !{!143, !144, !278}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !140, file: !5, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !5, baseType: !145, size: 64, align: 64, flags: DIFlagPrivate)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::collections::btree::node::LeafNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>>", scope: !60, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !146, templateParams: !276, identifier: "36ca57936ca630a3a8a0e7c87ea2c052")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !145, file: !5, baseType: !148, size: 64, align: 64, flags: DIFlagPrivate)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::btree::node::LeafNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "LeafNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !141, file: !5, size: 2944, align: 128, flags: DIFlagPrivate, elements: !150, templateParams: !184, identifier: "9a9dad4b766438ad5934fc6780c68b25")
!150 = !{!151, !240, !251, !252, !265}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !149, file: !5, baseType: !152, size: 64, align: 64, offset: 2816, flags: DIFlagPrivate)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::ptr::non_null::NonNull<alloc::collections::btree::node::InternalNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>>>", scope: !6, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !153, templateParams: !13, identifier: "8eacc7296f1a15f0a8fef7e23169a3ab")
!153 = !{!154}
!154 = !DICompositeType(tag: DW_TAG_variant_part, scope: !152, file: !5, size: 64, align: 64, elements: !155, templateParams: !13, identifier: "3b11500669dca25e19405d2053e9bbf3", discriminator: !239)
!155 = !{!156, !235}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !154, file: !5, baseType: !157, size: 64, align: 64, extraData: i128 0)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !152, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !158, identifier: "1471c28f48aa0ca47010f6faee28e0db")
!158 = !{!159}
!159 = !DITemplateTypeParameter(name: "T", type: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::collections::btree::node::InternalNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>>", scope: !60, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !161, templateParams: !233, identifier: "5fc5cfa64d99ed9fc3a448042021da80")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !160, file: !5, baseType: !163, size: 64, align: 64, flags: DIFlagPrivate)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::collections::btree::node::InternalNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", baseType: !164, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "InternalNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !141, file: !5, size: 3712, align: 128, flags: DIFlagPrivate, elements: !165, templateParams: !184, identifier: "3fd810e7a2a36021cbf200902c3479c2")
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !5, baseType: !149, size: 2944, align: 128, flags: DIFlagPrivate)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "edges", scope: !164, file: !5, baseType: !168, size: 768, align: 64, offset: 2944, flags: DIFlagPrivate)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 768, align: 64, elements: !182)
!169 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<core::ptr::non_null::NonNull<alloc::collections::btree::node::LeafNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>>>", scope: !170, file: !5, size: 64, align: 64, elements: !172, templateParams: !180, identifier: "49ad6108d227fdb11513f27d4a9d476c")
!170 = !DINamespace(name: "maybe_uninit", scope: !171)
!171 = !DINamespace(name: "mem", scope: !7)
!172 = !{!173, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !169, file: !5, baseType: !174, align: 8)
!174 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !169, file: !5, baseType: !176, size: 64, align: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<core::ptr::non_null::NonNull<alloc::collections::btree::node::LeafNode<signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>>>", scope: !177, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !178, templateParams: !180, identifier: "2633ea3dbfb1410a962401d8188f4b75")
!177 = !DINamespace(name: "manually_drop", scope: !171)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !176, file: !5, baseType: !145, size: 64, align: 64, flags: DIFlagPrivate)
!180 = !{!181}
!181 = !DITemplateTypeParameter(name: "T", type: !145)
!182 = !{!183}
!183 = !DISubrange(count: 12, lowerBound: 0)
!184 = !{!185, !190}
!185 = !DITemplateTypeParameter(name: "K", type: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "ActionId", scope: !2, file: !5, size: 128, align: 128, flags: DIFlagPrivate, elements: !187, templateParams: !13, identifier: "68b417b1e02df7fdd037a8fa6fa2ecba")
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !186, file: !5, baseType: !189, size: 128, align: 128, flags: DIFlagPrivate)
!189 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!190 = !DITemplateTypeParameter(name: "V", type: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !192, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !193, templateParams: !231, identifier: "5ba73c6f26774f8fb6860746a0d15e11")
!192 = !DINamespace(name: "sync", scope: !73)
!193 = !{!194, !228, !230}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !191, file: !5, baseType: !195, size: 128, align: 64, flags: DIFlagPrivate)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync)>>", scope: !60, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !196, templateParams: !226, identifier: "216ca860a78e8f763bcc7124ce8c6a9")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !195, file: !5, baseType: !198, size: 128, align: 64, flags: DIFlagPrivate)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync)>", file: !5, size: 128, align: 64, elements: !199, templateParams: !13, identifier: "aced3b6eb20d2441c4e56cc190d03ff9")
!199 = !{!200, !221}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !5, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync)>", scope: !192, file: !5, size: 128, align: 64, flags: DIFlagPrivate, elements: !203, templateParams: !219, identifier: "70241f0937eac3f6a15f8b777d3d8558")
!203 = !{!204, !216, !217}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !202, file: !5, baseType: !205, size: 64, align: 64, flags: DIFlagPrivate)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !206, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !208, templateParams: !13, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!206 = !DINamespace(name: "atomic", scope: !207)
!207 = !DINamespace(name: "sync", scope: !7)
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !205, file: !5, baseType: !210, size: 64, align: 64, flags: DIFlagPrivate)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !211, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !212, templateParams: !214, identifier: "739795389d327d6873469e3d89b8c60e")
!211 = !DINamespace(name: "cell", scope: !7)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !210, file: !5, baseType: !57, size: 64, align: 64, flags: DIFlagPrivate)
!214 = !{!215}
!215 = !DITemplateTypeParameter(name: "T", type: !57)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !202, file: !5, baseType: !205, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !5, baseType: !218, align: 8, offset: 128, flags: DIFlagPrivate)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync)", file: !5, align: 8, elements: !13, identifier: "ec6705d0b27c78431f5188e1cc323971")
!219 = !{!220}
!220 = !DITemplateTypeParameter(name: "T", type: !218)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !198, file: !5, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !223, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 384, align: 64, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 6, lowerBound: 0)
!226 = !{!227}
!227 = !DITemplateTypeParameter(name: "T", type: !202)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !191, file: !5, baseType: !229, align: 8, offset: 128, flags: DIFlagPrivate)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync)>>", scope: !24, file: !5, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !226, identifier: "6ef977bd8c263a0446c8533fecc1c89")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !191, file: !5, baseType: !71, align: 8, offset: 128, flags: DIFlagPrivate)
!231 = !{!220, !232}
!232 = !DITemplateTypeParameter(name: "A", type: !71)
!233 = !{!234}
!234 = !DITemplateTypeParameter(name: "T", type: !164)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !154, file: !5, baseType: !236, size: 64, align: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !152, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !237, templateParams: !158, identifier: "e6bb83e744905202cf7fd13f3a3d1255")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !236, file: !5, baseType: !160, size: 64, align: 64, flags: DIFlagPublic)
!239 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent_idx", scope: !149, file: !5, baseType: !241, size: 16, align: 16, offset: 2880, flags: DIFlagPrivate)
!241 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u16>", scope: !170, file: !5, size: 16, align: 16, elements: !242, templateParams: !249, identifier: "cd42505604c6ced669a1f16bd76d9514")
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !241, file: !5, baseType: !174, align: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !5, baseType: !245, size: 16, align: 16)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u16>", scope: !177, file: !5, size: 16, align: 16, flags: DIFlagPublic, elements: !246, templateParams: !249, identifier: "797c925721c3bab2f1b0d666e234197d")
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !245, file: !5, baseType: !248, size: 16, align: 16, flags: DIFlagPrivate)
!248 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!249 = !{!250}
!250 = !DITemplateTypeParameter(name: "T", type: !248)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !149, file: !5, baseType: !248, size: 16, align: 16, offset: 2896, flags: DIFlagPrivate)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !149, file: !5, baseType: !253, size: 1408, align: 128, flags: DIFlagPrivate)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 1408, align: 128, elements: !263)
!254 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<signal_hook_registry::ActionId>", scope: !170, file: !5, size: 128, align: 128, elements: !255, templateParams: !261, identifier: "bd5c184daa2b8e48747dba2c76a5ebbd")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !254, file: !5, baseType: !174, align: 8)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !254, file: !5, baseType: !258, size: 128, align: 128)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<signal_hook_registry::ActionId>", scope: !177, file: !5, size: 128, align: 128, flags: DIFlagPublic, elements: !259, templateParams: !261, identifier: "80852a676d781b34a09a0915d10b09d")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !258, file: !5, baseType: !186, size: 128, align: 128, flags: DIFlagPrivate)
!261 = !{!262}
!262 = !DITemplateTypeParameter(name: "T", type: !186)
!263 = !{!264}
!264 = !DISubrange(count: 11, lowerBound: 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vals", scope: !149, file: !5, baseType: !266, size: 1408, align: 64, offset: 1408, flags: DIFlagPrivate)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1408, align: 64, elements: !263)
!267 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !170, file: !5, size: 128, align: 64, elements: !268, templateParams: !274, identifier: "357460f77abecb327c5c6ccc338b864d")
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !267, file: !5, baseType: !174, align: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !267, file: !5, baseType: !271, size: 128, align: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !177, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !272, templateParams: !274, identifier: "dd0bd8f85baa49c6ff8fbfcfd453b509")
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !271, file: !5, baseType: !191, size: 128, align: 64, flags: DIFlagPrivate)
!274 = !{!275}
!275 = !DITemplateTypeParameter(name: "T", type: !191)
!276 = !{!277}
!277 = !DITemplateTypeParameter(name: "T", type: !149)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !140, file: !5, baseType: !279, align: 8, offset: 128, flags: DIFlagPrivate)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::collections::btree::node::marker::Owned, alloc::collections::btree::node::marker::LeafOrInternal)>", scope: !24, file: !5, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !280, identifier: "8ad432ad1d8519b878ced0a1abf634c8")
!280 = !{!281}
!281 = !DITemplateTypeParameter(name: "T", type: !282)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::collections::btree::node::marker::Owned, alloc::collections::btree::node::marker::LeafOrInternal)", file: !5, align: 8, elements: !283, templateParams: !13, identifier: "9fd2852c03e71457dd907f23dc3b06f8")
!283 = !{!284, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !282, file: !5, baseType: !285, align: 8)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "Owned", scope: !286, file: !5, align: 8, flags: DIFlagPublic, elements: !287, templateParams: !13, identifier: "ade9aa84a58da7e7b1c074670fd17cef")
!286 = !DINamespace(name: "marker", scope: !141)
!287 = !{!288}
!288 = !DICompositeType(tag: DW_TAG_variant_part, scope: !285, file: !5, align: 8, elements: !13, identifier: "fbe77f41cd30ea6ccbb0107b75d6f42f")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !282, file: !5, baseType: !290, align: 8)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "LeafOrInternal", scope: !286, file: !5, align: 8, flags: DIFlagPublic, elements: !291, templateParams: !13, identifier: "5ed01982872a7003b3b68c76929ea573")
!291 = !{!292}
!292 = !DICompositeType(tag: DW_TAG_variant_part, scope: !290, file: !5, align: 8, elements: !13, identifier: "61b7a1bbea7995737578f719b8d3ea26")
!293 = !{!294, !185, !190, !295}
!294 = !DITemplateTypeParameter(name: "BorrowType", type: !285)
!295 = !DITemplateTypeParameter(name: "Type", type: !290)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !134, file: !5, baseType: !297, size: 128, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !132, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !298, templateParams: !138, identifier: "dd45f38e0b35585a8cd641df5180c90")
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !297, file: !5, baseType: !140, size: 128, align: 64, flags: DIFlagPublic)
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !132, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !126, file: !5, baseType: !57, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !126, file: !5, baseType: !303, align: 8, offset: 192, flags: DIFlagProtected)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::alloc::Global>", scope: !177, file: !5, align: 8, flags: DIFlagPublic, elements: !304, templateParams: !306, identifier: "df9649e49b3fe9739dc2c209b9992e68")
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !303, file: !5, baseType: !71, align: 8, flags: DIFlagPrivate)
!306 = !{!307}
!307 = !DITemplateTypeParameter(name: "T", type: !71)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !126, file: !5, baseType: !309, align: 8, offset: 192, flags: DIFlagPrivate)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::boxed::Box<(signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>), alloc::alloc::Global>>", scope: !24, file: !5, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !310, identifier: "6cb606783fb677f1c61dc7fca7118a13")
!310 = !{!311}
!311 = !DITemplateTypeParameter(name: "T", type: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<(signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>), alloc::alloc::Global>", baseType: !313, size: 64, align: 64, dwarfAddressSpace: 0)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "(signal_hook_registry::ActionId, alloc::sync::Arc<(dyn core::ops::function::Fn<(&libc::unix::linux_like::linux::gnu::b64::x86_64::siginfo_t), Output=()> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>)", file: !5, size: 256, align: 128, elements: !314, templateParams: !13, identifier: "49a405f76015ebbb1b65a6f75fd5fae7")
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !313, file: !5, baseType: !186, size: 128, align: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !313, file: !5, baseType: !191, size: 128, align: 64, offset: 128)
!317 = !{!185, !190, !232}
!318 = !{!77, !232}
!319 = !{!320, !321, !322, !232}
!320 = !DITemplateTypeParameter(name: "K", type: !81)
!321 = !DITemplateTypeParameter(name: "V", type: !83)
!322 = !DITemplateTypeParameter(name: "S", type: !42)
!323 = !{!320, !321, !322}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next_id", scope: !27, file: !5, baseType: !189, size: 128, align: 128, offset: 384, flags: DIFlagPrivate)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !5, baseType: !326, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<signal_hook_registry::SignalData>", scope: !206, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !327, templateParams: !25, identifier: "76ba44a07b0dd8ad1d9dd19713feb431")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !326, file: !5, baseType: !329, size: 64, align: 64, flags: DIFlagPrivate)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut signal_hook_registry::SignalData>", scope: !211, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !330, templateParams: !333, identifier: "e52de1a9e34dbbbc45aeb65aa61f5ee9")
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !329, file: !5, baseType: !332, size: 64, align: 64, flags: DIFlagPrivate)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut signal_hook_registry::SignalData", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!333 = !{!334}
!334 = !DITemplateTypeParameter(name: "T", type: !332)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !19, file: !5, baseType: !205, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !19, file: !5, baseType: !337, size: 128, align: 64, flags: DIFlagPrivate)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, align: 64, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 2, lowerBound: 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "write_mutex", scope: !19, file: !5, baseType: !341, size: 64, align: 32, offset: 256, flags: DIFlagPrivate)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<()>", scope: !342, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !344, templateParams: !377, identifier: "d5fd249575a8d955fed7c24d847ce0e7")
!342 = !DINamespace(name: "mutex", scope: !343)
!343 = !DINamespace(name: "sync", scope: !34)
!344 = !{!345, !362, !373}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !341, file: !5, baseType: !346, size: 32, align: 32, flags: DIFlagPrivate)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !347, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !351, templateParams: !13, identifier: "d3cc6cb8dfa2f1c5acff260507e3a423")
!347 = !DINamespace(name: "futex", scope: !348)
!348 = !DINamespace(name: "mutex", scope: !349)
!349 = !DINamespace(name: "sync", scope: !350)
!350 = !DINamespace(name: "sys", scope: !34)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !346, file: !5, baseType: !353, size: 32, align: 32, flags: DIFlagPrivate)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !206, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !354, templateParams: !13, identifier: "ee8380a54dbd8a3323fad416b629cb4c")
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !353, file: !5, baseType: !356, size: 32, align: 32, flags: DIFlagPrivate)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !211, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !357, templateParams: !360, identifier: "96b01ddd9a02ff76f2ea3ae35bb7e982")
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !356, file: !5, baseType: !359, size: 32, align: 32, flags: DIFlagPrivate)
!359 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!360 = !{!361}
!361 = !DITemplateTypeParameter(name: "T", type: !359)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !341, file: !5, baseType: !363, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !364, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !365, templateParams: !13, identifier: "f02169750979dbd37c1ab4c868f04f71")
!364 = !DINamespace(name: "poison", scope: !343)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !363, file: !5, baseType: !367, size: 8, align: 8, flags: DIFlagPrivate)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !206, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !368, templateParams: !13, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !367, file: !5, baseType: !370, size: 8, align: 8, flags: DIFlagPrivate)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !211, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !371, templateParams: !66, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !370, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagPrivate)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !5, baseType: !374, align: 8, offset: 40, flags: DIFlagPrivate)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<()>", scope: !211, file: !5, align: 8, flags: DIFlagPublic, elements: !375, templateParams: !377, identifier: "df2a04390e4e7561d08d0a5a22c77b4a")
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !374, file: !5, baseType: !174, align: 8, flags: DIFlagPrivate)
!377 = !{!378}
!378 = !DITemplateTypeParameter(name: "T", type: !174)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "race_fallback", scope: !16, file: !5, baseType: !380, size: 320, align: 64, offset: 320, flags: DIFlagPrivate)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "HalfLock<core::option::Option<signal_hook_registry::Prev>>", scope: !20, file: !5, size: 320, align: 64, flags: DIFlagProtected, elements: !381, templateParams: !384, identifier: "1696d3de4534b7b113d556e2e60b749")
!381 = !{!382, !399, !409, !410, !411}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_t", scope: !380, file: !5, baseType: !383, align: 8, offset: 320, flags: DIFlagPrivate)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<signal_hook_registry::Prev>>", scope: !24, file: !5, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !384, identifier: "7cd0af681a173e7c3b5144c0331e60e7")
!384 = !{!385}
!385 = !DITemplateTypeParameter(name: "T", type: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<signal_hook_registry::Prev>", scope: !6, file: !5, size: 1344, align: 64, flags: DIFlagPublic, elements: !387, templateParams: !13, identifier: "c0b33d341a5996c2df76676771e5ab85")
!387 = !{!388}
!388 = !DICompositeType(tag: DW_TAG_variant_part, scope: !386, file: !5, size: 1344, align: 64, elements: !389, templateParams: !13, identifier: "cbaa48c57b6ecaf4447ed5c7e9e768f", discriminator: !398)
!389 = !{!390, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !388, file: !5, baseType: !391, size: 1344, align: 64, extraData: i128 0)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !386, file: !5, size: 1344, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !392, identifier: "cfb5e3d3dee324e12511c427aa116e33")
!392 = !{!393}
!393 = !DITemplateTypeParameter(name: "T", type: !86)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !388, file: !5, baseType: !395, size: 1344, align: 64, extraData: i128 1)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !386, file: !5, size: 1344, align: 64, flags: DIFlagPublic, elements: !396, templateParams: !392, identifier: "c973f2093116fa933ff12db8c78c7b0f")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !395, file: !5, baseType: !86, size: 1280, align: 64, offset: 64, flags: DIFlagPublic)
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !380, file: !5, baseType: !400, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<core::option::Option<signal_hook_registry::Prev>>", scope: !206, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !401, templateParams: !384, identifier: "8d3d4c100bc4ac21ea4ec019d81f4b53")
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !400, file: !5, baseType: !403, size: 64, align: 64, flags: DIFlagPrivate)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut core::option::Option<signal_hook_registry::Prev>>", scope: !211, file: !5, size: 64, align: 64, flags: DIFlagPublic, elements: !404, templateParams: !407, identifier: "7a1b03d82acd48c6452a9d7d3a4be21")
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !403, file: !5, baseType: !406, size: 64, align: 64, flags: DIFlagPrivate)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<signal_hook_registry::Prev>", baseType: !386, size: 64, align: 64, dwarfAddressSpace: 0)
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "T", type: !406)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "generation", scope: !380, file: !5, baseType: !205, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !380, file: !5, baseType: !337, size: 128, align: 64, flags: DIFlagPrivate)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "write_mutex", scope: !380, file: !5, baseType: !341, size: 64, align: 32, offset: 256, flags: DIFlagPrivate)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !9, file: !5, baseType: !413, size: 704, align: 64, extraData: i128 1)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !4, file: !5, size: 704, align: 64, flags: DIFlagPublic, elements: !414, templateParams: !14, identifier: "bffd8d18d4f2b2e0c22118d07d746110")
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !413, file: !5, baseType: !16, size: 640, align: 64, offset: 64, flags: DIFlagPublic)
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !4, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "GLOBAL_INIT", linkageName: "_ZN20signal_hook_registry11GLOBAL_INIT17h8645eff341b36640E", scope: !2, file: !3, line: 283, type: !419, isLocal: true, isDefinition: true, align: 32)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !420, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !421, templateParams: !13, identifier: "4c93050429633c21aa7f3eb66ea0504")
!420 = !DINamespace(name: "once", scope: !343)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !419, file: !5, baseType: !423, size: 32, align: 32, flags: DIFlagPrivate)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !424, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !426, templateParams: !13, identifier: "722d278c2b94cd51ddb990600870b854")
!424 = !DINamespace(name: "futex", scope: !425)
!425 = !DINamespace(name: "once", scope: !349)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !423, file: !5, baseType: !353, size: 32, align: 32, flags: DIFlagPrivate)
!428 = !{i32 8, !"PIC Level", i32 2}
!429 = !{i32 2, !"RtLibUseGOT", i32 1}
!430 = !{i32 2, !"Dwarf Version", i32 4}
!431 = !{i32 2, !"Debug Info Version", i32 3}
!432 = !{!"rustc version 1.80.0-dev"}
!433 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !434, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, globals: !585, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/signal-hook-registry-1.4.1/src/lib.rs/@/signal_hook_registry.f2f239908bdd14e2-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/signal-hook-registry-1.4.1")
!435 = !{!436, !481, !489, !496, !563, !570, !574, !580}
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !437, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !439)
!437 = !DINamespace(name: "error", scope: !438)
!438 = !DINamespace(name: "io", scope: !34)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!440 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!441 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!442 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!443 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!444 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!445 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!446 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!447 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!448 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!449 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!450 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!451 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!452 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!453 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!454 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!455 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!456 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!457 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!458 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!459 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!460 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!461 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!462 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!463 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!464 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!465 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!466 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!467 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!468 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!469 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!470 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!471 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!472 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!473 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!474 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!475 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!476 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!477 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!478 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!479 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!480 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !482, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !484)
!482 = !DINamespace(name: "rt", scope: !483)
!483 = !DINamespace(name: "fmt", scope: !7)
!484 = !{!485, !486, !487, !488}
!485 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!486 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!487 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!488 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !206, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !490)
!490 = !{!491, !492, !493, !494, !495}
!491 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!492 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!493 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!494 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!495 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!496 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !497, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagEnumClass, elements: !498)
!497 = !DINamespace(name: "alignment", scope: !61)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!499 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!500 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!501 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!502 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!503 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!504 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!505 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!506 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!507 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!508 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!509 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!510 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!511 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!512 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!513 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!514 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!515 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!516 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!517 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!518 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!519 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!520 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!521 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!522 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!523 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!524 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!525 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!526 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!527 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!528 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!529 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!530 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!531 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!532 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!533 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!534 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!535 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!536 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!537 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!538 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!539 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!540 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!541 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!542 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!543 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!544 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!545 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!546 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!547 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!548 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!549 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!550 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!551 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!552 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!553 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!554 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!555 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!556 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!557 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!558 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!559 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!560 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!561 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!562 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !564, file: !5, baseType: !565, size: 8, align: 8, flags: DIFlagEnumClass, elements: !566)
!564 = !DINamespace(name: "cmp", scope: !7)
!565 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!566 = !{!567, !568, !569}
!567 = !DIEnumerator(name: "Less", value: -1)
!568 = !DIEnumerator(name: "Equal", value: 0)
!569 = !DIEnumerator(name: "Greater", value: 1)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fallibility", scope: !51, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !571)
!571 = !{!572, !573}
!572 = !DIEnumerator(name: "Fallible", value: 0, isUnsigned: true)
!573 = !DIEnumerator(name: "Infallible", value: 1, isUnsigned: true)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !575, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !576)
!575 = !DINamespace(name: "panicking", scope: !7)
!576 = !{!577, !578, !579}
!577 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!578 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!579 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !581, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagEnumClass, elements: !582)
!581 = !DINamespace(name: "ffi", scope: !7)
!582 = !{!583, !584}
!583 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!584 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!585 = !{!586, !598, !0, !417}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable}", scope: null, file: !5, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable_type}", file: !5, size: 256, align: 64, flags: DIFlagArtificial, elements: !589, vtableHolder: !595, templateParams: !13, identifier: "d1e6113bad2ee842366668e053677b38")
!589 = !{!590, !592, !593, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !588, file: !5, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !174, size: 64, align: 64, dwarfAddressSpace: 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !5, baseType: !57, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !588, file: !5, baseType: !57, size: 64, align: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !588, file: !5, baseType: !591, size: 64, align: 64, offset: 192)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !596, file: !5, align: 8, flags: DIFlagPublic, elements: !13, identifier: "ce4dd4a4d8c5e4af26addbcd50190a55")
!596 = !DINamespace(name: "local", scope: !597)
!597 = !DINamespace(name: "thread", scope: !34)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "<hashbrown::raw::{impl#8}::find::{closure_env#0}<(i32, signal_hook_registry::Slot), alloc::alloc::Global, hashbrown::map::equivalent_key::{closure_env#0}<i32, i32, signal_hook_registry::Slot>> as core::ops::function::FnMut<(usize)>>::{vtable}", scope: null, file: !5, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "<hashbrown::raw::{impl#8}::find::{closure_env#0}<(i32, signal_hook_registry::Slot), alloc::alloc::Global, hashbrown::map::equivalent_key::{closure_env#0}<i32, i32, signal_hook_registry::Slot>> as core::ops::function::FnMut<(usize)>>::{vtable_type}", file: !5, size: 320, align: 64, flags: DIFlagArtificial, elements: !601, vtableHolder: !607, templateParams: !13, identifier: "5bd2ed2843c93c9ab0e29ea0845fdaa1")
!601 = !{!602, !603, !604, !605, !606}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !600, file: !5, baseType: !591, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !600, file: !5, baseType: !57, size: 64, align: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !600, file: !5, baseType: !57, size: 64, align: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !600, file: !5, baseType: !591, size: 64, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !600, file: !5, baseType: !591, size: 64, align: 64, offset: 256)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<(i32, signal_hook_registry::Slot), alloc::alloc::Global, hashbrown::map::equivalent_key::{closure_env#0}<i32, i32, signal_hook_registry::Slot>>", scope: !608, file: !5, size: 128, align: 64, elements: !610, templateParams: !13, identifier: "a5214ec48b209b53a4b1de236a97fc96")
!608 = !DINamespace(name: "find", scope: !609)
!609 = !DINamespace(name: "{impl#8}", scope: !51)
!610 = !{!611, !618}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__eq", scope: !607, file: !5, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut hashbrown::map::equivalent_key::{closure_env#0}<i32, i32, signal_hook_registry::Slot>", baseType: !613, size: 64, align: 64, dwarfAddressSpace: 0)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<i32, i32, signal_hook_registry::Slot>", scope: !614, file: !5, size: 64, align: 64, elements: !615, templateParams: !13, identifier: "6df77c44457a492665843b732daac09c")
!614 = !DINamespace(name: "equivalent_key", scope: !38)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !613, file: !5, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !607, file: !5, baseType: !619, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&hashbrown::raw::RawTable<(i32, signal_hook_registry::Slot), alloc::alloc::Global>", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = distinct !DISubprogram(name: "call<std::sync::once::{impl#2}::call_once::{closure_env#0}<signal_hook_registry::{impl#2}::ensure::{closure_env#0}>>", linkageName: "_ZN3std3sys4sync4once5futex4Once4call17h204c47ecf6056759E", scope: !423, file: !621, line: 97, type: !622, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !433, templateParams: !664, declaration: !662, retainedNodes: !666)
!621 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sys/sync/once/futex.rs", directory: "", checksumkind: CSK_MD5, checksum: "52b845e5ab67af06120954feca307828")
!622 = !DISubroutineType(cc: DW_CC_nocall, types: !623)
!623 = !{null, !624, !625, !626, !649}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::sync::once::futex::Once", baseType: !423, size: 64, align: 64, dwarfAddressSpace: 0)
!625 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sync::once::{impl#2}::call_once::{closure_env#0}<signal_hook_registry::{impl#2}::ensure::{closure_env#0}>", baseType: !627, size: 64, align: 64, dwarfAddressSpace: 0)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<signal_hook_registry::{impl#2}::ensure::{closure_env#0}>", scope: !628, file: !5, size: 64, align: 64, elements: !630, templateParams: !13, identifier: "beeb34ffec1c47c9537c5320b3aeb27d")
!628 = !DINamespace(name: "call_once", scope: !629)
!629 = !DINamespace(name: "{impl#2}", scope: !420)
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !627, file: !5, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<signal_hook_registry::{impl#2}::ensure::{closure_env#0}>", baseType: !633, size: 64, align: 64, dwarfAddressSpace: 0)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<signal_hook_registry::{impl#2}::ensure::{closure_env#0}>", scope: !6, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !634, templateParams: !13, identifier: "891ff80660e4fded7c96ed5cb4c878ff")
!634 = !{!635}
!635 = !DICompositeType(tag: DW_TAG_variant_part, scope: !633, file: !5, size: 8, align: 8, elements: !636, templateParams: !13, identifier: "4c8f2b9dcef38a60b93c2fa52a43a68b", discriminator: !648)
!636 = !{!637, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !635, file: !5, baseType: !638, size: 8, align: 8, extraData: i128 0)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !633, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !639, identifier: "a81c71d2b20dee21193031377d8e586")
!639 = !{!640}
!640 = !DITemplateTypeParameter(name: "T", type: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !642, file: !5, align: 8, elements: !13, identifier: "100c3aab839adb4810ca6093facf8fbf")
!642 = !DINamespace(name: "ensure", scope: !643)
!643 = !DINamespace(name: "{impl#2}", scope: !2)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !635, file: !5, baseType: !645, size: 8, align: 8, extraData: i128 1)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !633, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !646, templateParams: !639, identifier: "e516131fb2732c2b890b290ea1501ee4")
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !645, file: !5, baseType: !641, align: 8, offset: 8, flags: DIFlagPublic)
!648 = !DIDerivedType(tag: DW_TAG_member, scope: !633, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagArtificial)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !650, size: 64, align: 64, dwarfAddressSpace: 0)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !651, file: !5, size: 192, align: 64, flags: DIFlagPublic, elements: !653, templateParams: !13, identifier: "83f60b789274e9dfe5288fdb9ee764d1")
!651 = !DINamespace(name: "location", scope: !652)
!652 = !DINamespace(name: "panic", scope: !7)
!653 = !{!654, !660, !661}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !650, file: !5, baseType: !655, size: 128, align: 64, flags: DIFlagPrivate)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !5, size: 128, align: 64, elements: !656, templateParams: !13, identifier: "9277eecd40495f85161460476aacc992")
!656 = !{!657, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !655, file: !5, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !655, file: !5, baseType: !57, size: 64, align: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !650, file: !5, baseType: !359, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !650, file: !5, baseType: !359, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!662 = !DISubprogram(name: "call<std::sync::once::{impl#2}::call_once::{closure_env#0}<signal_hook_registry::{impl#2}::ensure::{closure_env#0}>>", linkageName: "_ZN3std3sys4sync4once5futex4Once4call17h204c47ecf6056759E", scope: !423, file: !621, line: 97, type: !663, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !664)
!663 = !DISubroutineType(types: !623)
!664 = !{!665}
!665 = !DITemplateTypeParameter(name: "impl FnMut(&public::OnceState)", type: !627)
!666 = !{!667, !668, !669, !670, !672, !674, !681, !693}
!667 = !DILocalVariable(name: "self", arg: 1, scope: !620, file: !621, line: 97, type: !624)
!668 = !DILocalVariable(name: "ignore_poisoning", arg: 2, scope: !620, file: !621, line: 97, type: !625)
!669 = !DILocalVariable(name: "f", arg: 3, scope: !620, file: !621, line: 97, type: !626)
!670 = !DILocalVariable(name: "state", scope: !671, file: !621, line: 98, type: !359, align: 4)
!671 = distinct !DILexicalBlock(scope: !620, file: !621, line: 98, column: 9)
!672 = !DILocalVariable(name: "new", scope: !673, file: !621, line: 107, type: !359, align: 4)
!673 = distinct !DILexicalBlock(scope: !671, file: !621, line: 109, column: 21)
!674 = !DILocalVariable(name: "waiter_queue", scope: !675, file: !621, line: 115, type: !676, align: 8)
!675 = distinct !DILexicalBlock(scope: !671, file: !621, line: 115, column: 21)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "CompletionGuard", scope: !424, file: !5, size: 128, align: 64, flags: DIFlagPrivate, elements: !677, templateParams: !13, identifier: "221394aaa1658f2fa8c3b475b777fa83")
!677 = !{!678, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !676, file: !5, baseType: !679, size: 64, align: 64, flags: DIFlagPrivate)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicU32", baseType: !353, size: 64, align: 64, dwarfAddressSpace: 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_on_drop_to", scope: !676, file: !5, baseType: !359, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!681 = !DILocalVariable(name: "f_state", scope: !682, file: !621, line: 118, type: !683, align: 4)
!682 = distinct !DILexicalBlock(scope: !675, file: !621, line: 118, column: 21)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnceState", scope: !420, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !684, templateParams: !13, identifier: "1bac216ba4522be09632246148a8d951")
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !683, file: !5, baseType: !686, size: 64, align: 32, flags: DIFlagProtected)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnceState", scope: !424, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !687, templateParams: !13, identifier: "f9c837203d5e053157c031bb852e7246")
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned", scope: !686, file: !5, baseType: !625, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_to", scope: !686, file: !5, baseType: !690, size: 32, align: 32, flags: DIFlagPrivate)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<u32>", scope: !211, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !691, templateParams: !360, identifier: "4358857cc54edc179d9be40eec321c40")
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !690, file: !5, baseType: !356, size: 32, align: 32, flags: DIFlagPrivate)
!693 = !DILocalVariable(name: "new", scope: !671, file: !621, line: 131, type: !359, align: 4)
!694 = !DILocation(line: 118, column: 25, scope: !682)
!695 = !DILocalVariable(name: "order", scope: !696, file: !697, line: 2404, type: !489, align: 1)
!696 = distinct !DILexicalBlock(scope: !698, file: !697, line: 2404, column: 13)
!697 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "3974e4024eb8e2ba36045270da58dc5a")
!698 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic9AtomicU324load17hb95c9131b01c3d4eE", scope: !353, file: !697, line: 2404, type: !699, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !433, templateParams: !13, declaration: !701, retainedNodes: !702)
!699 = !DISubroutineType(types: !700)
!700 = !{!359, !679, !489}
!701 = !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic9AtomicU324load17hb95c9131b01c3d4eE", scope: !353, file: !697, line: 2404, type: !699, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !13)
!702 = !{!703, !695, !704, !706}
!703 = !DILocalVariable(name: "self", arg: 1, scope: !696, file: !697, line: 2404, type: !679)
!704 = !DILocalVariable(name: "self", arg: 1, scope: !705, file: !697, line: 2404, type: !679)
!705 = distinct !DILexicalBlock(scope: !698, file: !697, line: 2404, column: 13)
!706 = !DILocalVariable(name: "order", scope: !705, file: !697, line: 2404, type: !489, align: 1)
!707 = !DILocation(line: 0, scope: !696, inlinedAt: !708)
!708 = !DILocation(line: 98, column: 36, scope: !620)
!709 = !DILocalVariable(name: "pieces", scope: !710, file: !711, line: 341, type: !838, align: 8)
!710 = distinct !DILexicalBlock(scope: !712, file: !711, line: 341, column: 5)
!711 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!712 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17h22e53193a69459daE", scope: !713, file: !711, line: 341, type: !836, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !433, templateParams: !13, declaration: !842, retainedNodes: !843)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !483, file: !5, size: 384, align: 64, flags: DIFlagPublic, elements: !714, templateParams: !13, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!714 = !{!715, !721, !764}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !713, file: !5, baseType: !716, size: 128, align: 64, flags: DIFlagPrivate)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !5, size: 128, align: 64, elements: !717, templateParams: !13, identifier: "4e66b00a376d6af5b8765440fb2839f")
!717 = !{!718, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !716, file: !5, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64, dwarfAddressSpace: 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !716, file: !5, baseType: !57, size: 64, align: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !713, file: !5, baseType: !722, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !6, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !723, templateParams: !13, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!723 = !{!724}
!724 = !DICompositeType(tag: DW_TAG_variant_part, scope: !722, file: !5, size: 128, align: 64, elements: !725, templateParams: !13, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !763)
!725 = !{!726, !759}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !724, file: !5, baseType: !727, size: 128, align: 64, extraData: i128 0)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !722, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !728, identifier: "c062391546990b9ae716e587a9c44107")
!728 = !{!729}
!729 = !DITemplateTypeParameter(name: "T", type: !730)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !5, size: 128, align: 64, elements: !731, templateParams: !13, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!731 = !{!732, !758}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !730, file: !5, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64, dwarfAddressSpace: 0)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !482, file: !5, size: 448, align: 64, flags: DIFlagPublic, elements: !735, templateParams: !13, identifier: "402846c0893391618e34a15e0598c24e")
!735 = !{!736, !737, !739, !740, !741, !757}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !734, file: !5, baseType: !57, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !734, file: !5, baseType: !738, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!738 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !734, file: !5, baseType: !481, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !5, baseType: !359, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !734, file: !5, baseType: !742, size: 128, align: 64, flags: DIFlagPublic)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !482, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !743, templateParams: !13, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!743 = !{!744}
!744 = !DICompositeType(tag: DW_TAG_variant_part, scope: !742, file: !5, size: 128, align: 64, elements: !745, templateParams: !13, identifier: "96fecae849037968fdad1729d3166571", discriminator: !756)
!745 = !{!746, !750, !754}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !744, file: !5, baseType: !747, size: 128, align: 64, extraData: i128 0)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !742, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !748, templateParams: !13, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !747, file: !5, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !744, file: !5, baseType: !751, size: 128, align: 64, extraData: i128 1)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !742, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !752, templateParams: !13, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !751, file: !5, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !744, file: !5, baseType: !755, size: 128, align: 64, extraData: i128 2)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !742, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !13, identifier: "844235131be8a6898de5150ba908049f")
!756 = !DIDerivedType(tag: DW_TAG_member, scope: !742, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !734, file: !5, baseType: !742, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !730, file: !5, baseType: !57, size: 64, align: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !724, file: !5, baseType: !760, size: 128, align: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !722, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !761, templateParams: !728, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !760, file: !5, baseType: !730, size: 128, align: 64, flags: DIFlagPublic)
!763 = !DIDerivedType(tag: DW_TAG_member, scope: !722, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !713, file: !5, baseType: !765, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !5, size: 128, align: 64, elements: !766, templateParams: !13, identifier: "baf028fc654408299b6dd770f089fd48")
!766 = !{!767, !835}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !765, file: !5, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64, dwarfAddressSpace: 0)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !482, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !770, templateParams: !13, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !769, file: !5, baseType: !772, size: 128, align: 64, flags: DIFlagPrivate)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !482, file: !5, size: 128, align: 64, flags: DIFlagPrivate, elements: !773, templateParams: !13, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_variant_part, scope: !772, file: !5, size: 128, align: 64, elements: !775, templateParams: !13, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !834)
!775 = !{!776, !830}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !774, file: !5, baseType: !777, size: 128, align: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !772, file: !5, size: 128, align: 64, flags: DIFlagPrivate, elements: !778, templateParams: !13, identifier: "7c7df21330d573ca4eefe40395fd691")
!778 = !{!779, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !777, file: !5, baseType: !780, size: 64, align: 64, flags: DIFlagPrivate)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !781, size: 64, align: 64, dwarfAddressSpace: 0)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !782, file: !5, align: 8, elements: !13, identifier: "728a64207294457ae982b2390ae8a902")
!782 = !DINamespace(name: "{extern#0}", scope: !482)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !777, file: !5, baseType: !784, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !785, size: 64, align: 64, dwarfAddressSpace: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !780, !804}
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !788, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !789, templateParams: !13, identifier: "d2df09569ea43718984b3f07c77d7786")
!788 = !DINamespace(name: "result", scope: !7)
!789 = !{!790}
!790 = !DICompositeType(tag: DW_TAG_variant_part, scope: !787, file: !5, size: 8, align: 8, elements: !791, templateParams: !13, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !803)
!791 = !{!792, !799}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !790, file: !5, baseType: !793, size: 8, align: 8, extraData: i128 0)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !787, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !794, templateParams: !796, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !793, file: !5, baseType: !174, align: 8, offset: 8, flags: DIFlagPublic)
!796 = !{!378, !797}
!797 = !DITemplateTypeParameter(name: "E", type: !798)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !483, file: !5, align: 8, flags: DIFlagPublic, elements: !13, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !790, file: !5, baseType: !800, size: 8, align: 8, extraData: i128 1)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !787, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !801, templateParams: !796, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !800, file: !5, baseType: !798, align: 8, offset: 8, flags: DIFlagPublic)
!803 = !DIDerivedType(tag: DW_TAG_member, scope: !787, file: !5, baseType: !65, size: 8, align: 8, flags: DIFlagArtificial)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !805, size: 64, align: 64, dwarfAddressSpace: 0)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !483, file: !5, size: 512, align: 64, flags: DIFlagPublic, elements: !806, templateParams: !13, identifier: "9d9578b0f9368582a2201563ca126cd4")
!806 = !{!807, !808, !809, !810, !822, !823}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !805, file: !5, baseType: !359, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !805, file: !5, baseType: !738, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !805, file: !5, baseType: !481, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !805, file: !5, baseType: !811, size: 128, align: 64, flags: DIFlagPrivate)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !6, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !812, templateParams: !13, identifier: "3850c4a210aea148b16f79ec227c427")
!812 = !{!813}
!813 = !DICompositeType(tag: DW_TAG_variant_part, scope: !811, file: !5, size: 128, align: 64, elements: !814, templateParams: !13, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !821)
!814 = !{!815, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !813, file: !5, baseType: !816, size: 128, align: 64, extraData: i128 0)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !811, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !13, templateParams: !214, identifier: "10be3845cc366e59d680126f255dea8b")
!817 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !813, file: !5, baseType: !818, size: 128, align: 64, extraData: i128 1)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !811, file: !5, size: 128, align: 64, flags: DIFlagPublic, elements: !819, templateParams: !214, identifier: "d166501012b6febc55685f1b3285acb8")
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !818, file: !5, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!821 = !DIDerivedType(tag: DW_TAG_member, scope: !811, file: !5, baseType: !47, size: 64, align: 64, flags: DIFlagArtificial)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !805, file: !5, baseType: !811, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !805, file: !5, baseType: !824, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !5, size: 128, align: 64, elements: !825, templateParams: !13, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!825 = !{!826, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !824, file: !5, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64, dwarfAddressSpace: 0)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !5, align: 8, elements: !13, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !824, file: !5, baseType: !222, size: 64, align: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !774, file: !5, baseType: !831, size: 128, align: 64, extraData: i128 0)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !772, file: !5, size: 128, align: 64, flags: DIFlagPrivate, elements: !832, templateParams: !13, identifier: "fb37c399e04d1117cfdf49fc8e0ef2cd")
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !831, file: !5, baseType: !57, size: 64, align: 64, flags: DIFlagPrivate)
!834 = !DIDerivedType(tag: DW_TAG_member, scope: !772, file: !5, baseType: !47, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !765, file: !5, baseType: !57, size: 64, align: 64, offset: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!713, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[&str; 1]", baseType: !839, size: 64, align: 64, dwarfAddressSpace: 0)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 128, align: 64, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 1, lowerBound: 0)
!842 = !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17h22e53193a69459daE", scope: !713, file: !711, line: 341, type: !836, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !13)
!843 = !{!709}
!844 = !DILocation(line: 0, scope: !710, inlinedAt: !845)
!845 = !DILocation(line: 106, column: 38, scope: !846)
!846 = !DILexicalBlockFile(scope: !671, file: !847, discriminator: 0)
!847 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "6585507958cf42cd7ac7ae9875a25d92")
!848 = !DILocalVariable(name: "new", scope: !849, file: !697, line: 2622, type: !359, align: 4)
!849 = distinct !DILexicalBlock(scope: !850, file: !697, line: 2620, column: 13)
!850 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic9AtomicU3221compare_exchange_weak17he01fd983030b40cdE", scope: !353, file: !697, line: 2620, type: !851, scopeLine: 2620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !433, templateParams: !13, declaration: !868, retainedNodes: !869)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !679, !359, !359, !489, !489}
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, u32>", scope: !788, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !854, templateParams: !13, identifier: "358dd129e07a31a2b22feb3417878f54")
!854 = !{!855}
!855 = !DICompositeType(tag: DW_TAG_variant_part, scope: !853, file: !5, size: 64, align: 32, elements: !856, templateParams: !13, identifier: "3243f9c3953b04604c3f38a5de769d5e", discriminator: !867)
!856 = !{!857, !863}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !855, file: !5, baseType: !858, size: 64, align: 32, extraData: i128 0)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !853, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !859, templateParams: !861, identifier: "eb58d1e2574c5e91d209523af88dd067")
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !858, file: !5, baseType: !359, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!861 = !{!361, !862}
!862 = !DITemplateTypeParameter(name: "E", type: !359)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !855, file: !5, baseType: !864, size: 64, align: 32, extraData: i128 1)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !853, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !865, templateParams: !861, identifier: "825b6e2a549733ff66671c05d6b5d465")
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !864, file: !5, baseType: !359, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!867 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !5, baseType: !359, size: 32, align: 32, flags: DIFlagArtificial)
!868 = !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic9AtomicU3221compare_exchange_weak17he01fd983030b40cdE", scope: !353, file: !697, line: 2620, type: !851, scopeLine: 2620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !13)
!869 = !{!870, !871, !848, !872, !873, !874, !876, !877, !878, !879}
!870 = !DILocalVariable(name: "self", arg: 1, scope: !849, file: !697, line: 2620, type: !679)
!871 = !DILocalVariable(name: "current", arg: 2, scope: !849, file: !697, line: 2621, type: !359)
!872 = !DILocalVariable(name: "success", scope: !849, file: !697, line: 2623, type: !489, align: 1)
!873 = !DILocalVariable(name: "failure", scope: !849, file: !697, line: 2624, type: !489, align: 1)
!874 = !DILocalVariable(name: "self", arg: 1, scope: !875, file: !697, line: 2620, type: !679)
!875 = distinct !DILexicalBlock(scope: !850, file: !697, line: 2620, column: 13)
