; ModuleID = 'spawn.286bc830a0e37119-cgu.0'
source_filename = "spawn.286bc830a0e37119-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"std::sys::thread_local::fast_local::lazy::Storage<core::cell::RefCell<(parking::Parker, core::task::wake::Waker)>, ()>" = type { %"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<(parking::Parker, core::task::wake::Waker)>, ()>>" }
%"core::cell::UnsafeCell<std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<(parking::Parker, core::task::wake::Waker)>, ()>>" = type { %"std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<(parking::Parker, core::task::wake::Waker)>, ()>" }
%"std::sys::thread_local::fast_local::lazy::State<core::cell::RefCell<(parking::Parker, core::task::wake::Waker)>, ()>" = type { i64, [4 x i64] }

@alloc_1ccfc410ce4ba7704b8709f0d6e60294 = private unnamed_addr constant <{ [51 x i8] }> <{ [51 x i8] c"fatal runtime error: thread local panicked on drop\0A" }>, align 1
@alloc_f7c18d5ab6a04e64e435b4d6f64423e3 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_1ccfc410ce4ba7704b8709f0d6e60294, [8 x i8] c"3\00\00\00\00\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::Write::write_fmt::Adapter<std::sys::pal::unix::stdio::Stderr> as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !29, identifier: "3b9dc1cd24e5f6261916f3a71a8e93ed")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adapter<std::sys::pal::unix::stdio::Stderr>", scope: !15, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !19, templateParams: !162, identifier: "5cc60cf3bc5ca3351bc45c96fb2576d0")
!15 = !DINamespace(name: "write_fmt", scope: !16)
!16 = !DINamespace(name: "Write", scope: !17)
!17 = !DINamespace(name: "io", scope: !18)
!18 = !DINamespace(name: "std", scope: null)
!19 = !{!20, !30}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !14, file: !2, baseType: !21, size: 64, align: 64, flags: DIFlagProtected)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sys::pal::unix::stdio::Stderr", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stderr", scope: !23, file: !2, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !29, identifier: "93c379795faa0383c896fabe3f393c")
!23 = !DINamespace(name: "stdio", scope: !24)
!24 = !DINamespace(name: "unix", scope: !25)
!25 = !DINamespace(name: "pal", scope: !26)
!26 = !DINamespace(name: "sys", scope: !18)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !22, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!29 = !{}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !14, file: !2, baseType: !31, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !32, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !34, templateParams: !29, identifier: "f6fab78402c7921c81b48f94ff59f12a")
!32 = !DINamespace(name: "result", scope: !33)
!33 = !DINamespace(name: "core", scope: null)
!34 = !{!35}
!35 = !DICompositeType(tag: DW_TAG_variant_part, scope: !31, file: !2, size: 64, align: 64, elements: !36, templateParams: !29, identifier: "f20382f78447208541d43a2eb7c7b177", discriminator: !160)
!36 = !{!37, !156}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !35, file: !2, baseType: !38, size: 64, align: 64, extraData: i128 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !39, templateParams: !41, identifier: "7fff08edb161cdb6f65adbe333abb587")
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !38, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!41 = !{!42, !43}
!42 = !DITemplateTypeParameter(name: "T", type: !7)
!43 = !DITemplateTypeParameter(name: "E", type: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !29, identifier: "9481a9f9dd3a514fccbd1ee45fe835c0")
!45 = !DINamespace(name: "error", scope: !17)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !44, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !50, templateParams: !29, identifier: "d19e764dc7d400364cac938e600e6e8e")
!49 = !DINamespace(name: "repr_bitpacked", scope: !45)
!50 = !{!51, !58}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !48, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagPrivate)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !53, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !57, identifier: "219b4814660fc803ec7ad9770695a")
!53 = !DINamespace(name: "non_null", scope: !54)
!54 = !DINamespace(name: "ptr", scope: !33)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !{!42}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !48, file: !2, baseType: !59, align: 8, offset: 64, flags: DIFlagPrivate)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !61, identifier: "b3a9535088463228dd721e3df15a74b4")
!60 = !DINamespace(name: "marker", scope: !33)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "T", type: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !45, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !64, templateParams: !29, identifier: "2d842b368858db53e5e95cb68f18ba4d")
!64 = !{!65}
!65 = !DICompositeType(tag: DW_TAG_variant_part, scope: !63, file: !2, size: 128, align: 64, elements: !66, templateParams: !29, identifier: "7b170337c204a193ef1904d1caedcc36", discriminator: !155)
!66 = !{!67, !133, !137, !151}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !65, file: !2, baseType: !68, size: 128, align: 64, extraData: i128 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !69, templateParams: !72, identifier: "ec7ef559ca1c1873dcb949d9353e83c4")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !71, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!71 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "C", type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !76, templateParams: !29, identifier: "4a83a1c02e32f7677e925d15cbf9f223")
!76 = !{!77, !122}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !75, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !45, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !80)
!79 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121}
!81 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !75, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPrivate)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !124, templateParams: !29, identifier: "fc4c978384b58c14d0c3b28c9444e0a6")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !2, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !29, identifier: "af492d0fde630cae993a48fd15ada2c5")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !123, file: !2, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 10, lowerBound: 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !65, file: !2, baseType: !134, size: 128, align: 64, extraData: i128 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !135, templateParams: !72, identifier: "c722108768e442de944796846599cf6a")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !78, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !65, file: !2, baseType: !138, size: 128, align: 64, extraData: i128 2)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !139, templateParams: !72, identifier: "a889002bec16644f89535583317530e7")
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !138, file: !2, baseType: !141, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !45, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !143, templateParams: !29, identifier: "1cc23320a6f881d629e59649fa6dee8b")
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !142, file: !2, baseType: !78, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !142, file: !2, baseType: !146, size: 128, align: 64, flags: DIFlagPrivate)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !147, templateParams: !29, identifier: "9277eecd40495f85161460476aacc992")
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !2, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !65, file: !2, baseType: !152, size: 128, align: 64, extraData: i128 3)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !153, templateParams: !72, identifier: "6be90b54a330d2fbea2d9f76e0bfb292")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !152, file: !2, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !63, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !35, file: !2, baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !31, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !158, templateParams: !41, identifier: "a184e6321da6a5ec587e5ea90c206f8c")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !31, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!161 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !22)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !167, vtableHolder: !174, templateParams: !29, identifier: "4be7f99a10befd66f3b6b76afbf3cdc")
!167 = !{!168, !169, !170, !171, !172, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !166, file: !2, baseType: !6, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !166, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !166, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !175, file: !2, size: 64, align: 64, elements: !177, templateParams: !29, identifier: "60efa411c23a73a7fcf3c4457776e82c")
!175 = !DINamespace(name: "lang_start", scope: !176)
!176 = !DINamespace(name: "rt", scope: !18)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !174, file: !2, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{null}
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::local::AccessError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !185, vtableHolder: !190, templateParams: !29, identifier: "d1e6113bad2ee842366668e053677b38")
!185 = !{!186, !187, !188, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !184, file: !2, baseType: !6, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !184, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !184, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AccessError", scope: !191, file: !2, align: 8, flags: DIFlagPublic, elements: !29, identifier: "ce4dd4a4d8c5e4af26addbcd50190a55")
!191 = !DINamespace(name: "local", scope: !192)
!192 = !DINamespace(name: "thread", scope: !18)
!193 = !{i32 8, !"PIC Level", i32 2}
!194 = !{i32 7, !"PIE Level", i32 2}
!195 = !{i32 2, !"RtLibUseGOT", i32 1}
!196 = !{i32 2, !"Dwarf Version", i32 4}
!197 = !{i32 2, !"Debug Info Version", i32 3}
!198 = !{!"rustc version 1.80.0-dev"}
!199 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !200, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !201, globals: !305, splitDebugInlining: false, nameTableKind: None)
!200 = !DIFile(filename: "benches/spawn.rs/@/spawn.286bc830a0e37119-cgu.0", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/async-task-4.7.1")
!201 = !{!202, !210, !277, !78, !286, !293, !299}
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !203, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !205)
!203 = !DINamespace(name: "rt", scope: !204)
!204 = !DINamespace(name: "fmt", scope: !33)
!205 = !{!206, !207, !208, !209}
!206 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!207 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!208 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!209 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !211, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagEnumClass, elements: !212)
!211 = !DINamespace(name: "alignment", scope: !54)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!213 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!220 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!221 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!222 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!223 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!224 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!225 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!226 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!227 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!228 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!229 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!230 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!231 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!232 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!233 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!234 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!235 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!236 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!237 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!238 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!239 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!240 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!241 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!242 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!243 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!244 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!245 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!246 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!247 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!248 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!249 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!250 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!251 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!252 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!253 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!254 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!255 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!256 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!257 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!258 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!259 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!260 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!261 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!262 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!263 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!264 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!265 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!266 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!267 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!268 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!269 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!270 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!271 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!272 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!273 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!274 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!275 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!276 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !278, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !280)
!278 = !DINamespace(name: "atomic", scope: !279)
!279 = !DINamespace(name: "sync", scope: !33)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!285 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !287, file: !2, baseType: !288, size: 8, align: 8, flags: DIFlagEnumClass, elements: !289)
!287 = !DINamespace(name: "cmp", scope: !33)
!288 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "Less", value: -1)
!291 = !DIEnumerator(name: "Equal", value: 0)
!292 = !DIEnumerator(name: "Greater", value: 1)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BenchMode", scope: !294, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !296)
!294 = !DINamespace(name: "options", scope: !295)
!295 = !DINamespace(name: "test", scope: null)
!296 = !{!297, !298}
!297 = !DIEnumerator(name: "Auto", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "Single", value: 1, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !300, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagEnumClass, elements: !302)
!300 = !DINamespace(name: "raw_vec", scope: !301)
!301 = !DINamespace(name: "alloc", scope: null)
!302 = !{!303, !304}
!303 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!304 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!305 = !{!0, !164, !182}
!306 = distinct !DISubprogram(name: "drop_waker<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$10drop_waker17hdd5bc0965d5a06e4E", scope: !308, file: !307, line: 382, type: !358, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !469, declaration: !472, retainedNodes: !473)
!307 = !DIFile(filename: "src/raw.rs", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/async-task-4.7.1", checksumkind: CSK_MD5, checksum: "2b2f4b98add5e55372609408d03f1b54")
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTask<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", scope: !309, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !311, templateParams: !469, identifier: "c1fc60eb9e654eb3b53edcfcf4983d12")
!309 = !DINamespace(name: "raw", scope: !310)
!310 = !DINamespace(name: "async_task", scope: null)
!311 = !{!312, !415, !425, !442}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !308, file: !2, baseType: !313, size: 64, align: 64, flags: DIFlagProtected)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const async_task::header::Header<()>", baseType: !314, size: 64, align: 64, dwarfAddressSpace: 0)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header<()>", scope: !315, file: !2, size: 320, align: 64, flags: DIFlagProtected, elements: !316, templateParams: !413, identifier: "1c97ce18f91dc9b97a11621ca6dfb30b")
!315 = !DINamespace(name: "header", scope: !310)
!316 = !{!317, !327, !369, !411, !412}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !2, baseType: !318, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !278, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !319, templateParams: !29, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !318, file: !2, baseType: !321, size: 64, align: 64, flags: DIFlagPrivate)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !322, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !323, templateParams: !325, identifier: "739795389d327d6873469e3d89b8c60e")
!322 = !DINamespace(name: "cell", scope: !33)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !321, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!325 = !{!326}
!326 = !DITemplateTypeParameter(name: "T", type: !9)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "awaiter", scope: !314, file: !2, baseType: !328, size: 128, align: 64, offset: 128, flags: DIFlagProtected)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::task::wake::Waker>>", scope: !322, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !329, templateParams: !367, identifier: "402882feea895d88487f598fd3781d2f")
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !328, file: !2, baseType: !331, size: 128, align: 64, flags: DIFlagPrivate)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::task::wake::Waker>", scope: !332, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !333, templateParams: !29, identifier: "fdf92b2a7f95e10b1f6af3c28f571177")
!332 = !DINamespace(name: "option", scope: !33)
!333 = !{!334}
!334 = !DICompositeType(tag: DW_TAG_variant_part, scope: !331, file: !2, size: 128, align: 64, elements: !335, templateParams: !29, identifier: "79b709c92f110a7567e6b4260f3fffd1", discriminator: !366)
!335 = !{!336, !362}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !334, file: !2, baseType: !337, size: 128, align: 64, extraData: i128 0)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !331, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !29, templateParams: !338, identifier: "e3b1b04ced3820bf6ad9a1cf1a84b270")
!338 = !{!339}
!339 = !DITemplateTypeParameter(name: "T", type: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Waker", scope: !341, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !343, templateParams: !29, identifier: "ec03eb30528f12f1717f729e65eac0d1")
!341 = !DINamespace(name: "wake", scope: !342)
!342 = !DINamespace(name: "task", scope: !33)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "waker", scope: !340, file: !2, baseType: !345, size: 128, align: 64, flags: DIFlagPrivate)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !341, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !346, templateParams: !29, identifier: "212c6d54ee18011b525ba8a27d92578c")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !2, baseType: !6, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !345, file: !2, baseType: !349, size: 64, align: 64, flags: DIFlagPrivate)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !350, size: 64, align: 64, dwarfAddressSpace: 0)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !341, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !351, templateParams: !29, identifier: "f4abbf7758eb3384651691936bf57e5b")
!351 = !{!352, !356, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !350, file: !2, baseType: !353, size: 64, align: 64, flags: DIFlagPrivate)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DISubroutineType(types: !355)
!355 = !{!345, !6}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !350, file: !2, baseType: !357, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !358, size: 64, align: 64, dwarfAddressSpace: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !6}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !350, file: !2, baseType: !357, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !350, file: !2, baseType: !357, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !334, file: !2, baseType: !363, size: 128, align: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !331, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !364, templateParams: !338, identifier: "f45b850959d020985d588404342ce426")
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !363, file: !2, baseType: !340, size: 128, align: 64, flags: DIFlagPublic)
!366 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "T", type: !331)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !314, file: !2, baseType: !370, size: 64, align: 64, flags: DIFlagProtected)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&async_task::raw::TaskVTable", baseType: !371, size: 64, align: 64, dwarfAddressSpace: 0)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskVTable", scope: !309, file: !2, size: 512, align: 64, flags: DIFlagProtected, elements: !372, templateParams: !29, identifier: "aed114c2ab7916b1f100b689ff8e8ce9")
!372 = !{!373, !382, !383, !387, !388, !389, !393, !394}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !371, file: !2, baseType: !374, size: 64, align: 64, flags: DIFlagProtected)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const (), async_task::runnable::ScheduleInfo)", baseType: !375, size: 64, align: 64, dwarfAddressSpace: 0)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !6, !377}
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "ScheduleInfo", scope: !378, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !379, templateParams: !29, identifier: "88b84d9358c8937d50ac8b8892fa691e")
!378 = !DINamespace(name: "runnable", scope: !310)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "woken_while_running", scope: !377, file: !2, baseType: !381, size: 8, align: 8, flags: DIFlagPublic)
!381 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "drop_future", scope: !371, file: !2, baseType: !357, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "get_output", scope: !371, file: !2, baseType: !384, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> *const ()", baseType: !385, size: 64, align: 64, dwarfAddressSpace: 0)
!385 = !DISubroutineType(types: !386)
!386 = !{!6, !6}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ref", scope: !371, file: !2, baseType: !357, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !371, file: !2, baseType: !357, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !371, file: !2, baseType: !390, size: 64, align: 64, offset: 320, flags: DIFlagProtected)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> bool", baseType: !391, size: 64, align: 64, dwarfAddressSpace: 0)
!391 = !DISubroutineType(types: !392)
!392 = !{!381, !6}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "clone_waker", scope: !371, file: !2, baseType: !353, size: 64, align: 64, offset: 384, flags: DIFlagProtected)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "layout_info", scope: !371, file: !2, baseType: !395, size: 64, align: 64, offset: 448, flags: DIFlagProtected)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&async_task::raw::TaskLayout", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "TaskLayout", scope: !309, file: !2, size: 320, align: 64, flags: DIFlagProtected, elements: !397, templateParams: !29, identifier: "ef501e9dac0c1af979036a048113a5f")
!397 = !{!398, !408, !409, !410}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !396, file: !2, baseType: !399, size: 128, align: 64, flags: DIFlagProtected)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !400, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !29, identifier: "e53210ff23d6d7b64d0c502d9cf034c2")
!400 = !DINamespace(name: "layout", scope: !401)
!401 = !DINamespace(name: "alloc", scope: !33)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !399, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !399, file: !2, baseType: !405, size: 64, align: 64, flags: DIFlagPrivate)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !211, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !406, templateParams: !29, identifier: "d52b523600ea492069fdcf2d89e5e6af")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !405, file: !2, baseType: !210, size: 64, align: 64, flags: DIFlagPrivate)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "offset_s", scope: !396, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "offset_f", scope: !396, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "offset_r", scope: !396, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagProtected)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !314, file: !2, baseType: !7, align: 8, offset: 264, flags: DIFlagProtected)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "propagate_panic", scope: !314, file: !2, baseType: !381, size: 8, align: 8, offset: 256, flags: DIFlagProtected)
!413 = !{!414}
!414 = !DITemplateTypeParameter(name: "M", type: !7)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !308, file: !2, baseType: !416, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const fn(async_task::runnable::Runnable<()>)", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(async_task::runnable::Runnable<()>)", baseType: !418, align: 1, dwarfAddressSpace: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420}
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "Runnable<()>", scope: !378, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !421, templateParams: !413, identifier: "d28320833187a4f0ba29f54fe172b397")
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !420, file: !2, baseType: !52, size: 64, align: 64, flags: DIFlagProtected)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !420, file: !2, baseType: !424, align: 8, offset: 64, flags: DIFlagProtected)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<()>", scope: !60, file: !2, align: 8, flags: DIFlagPublic, elements: !29, templateParams: !57, identifier: "c0ac5dd9794ce0c9804cd88f3d5e02b")
!425 = !DIDerivedType(tag: DW_TAG_member, name: "future", scope: !308, file: !2, baseType: !426, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spawn::task_run::{closure#0}::{async_block_env#0}", baseType: !427, size: 64, align: 64, dwarfAddressSpace: 0)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "{async_block_env#0}", scope: !428, file: !2, size: 8, align: 8, elements: !431, templateParams: !29, identifier: "1b79ba3b687687b13c4f7c5fcc86a7c6")
!428 = !DINamespace(name: "{closure#0}", scope: !429)
!429 = !DINamespace(name: "task_run", scope: !430)
!430 = !DINamespace(name: "spawn", scope: null)
!431 = !{!432}
!432 = !DICompositeType(tag: DW_TAG_variant_part, scope: !427, file: !2, size: 8, align: 8, elements: !433, templateParams: !29, identifier: "20bd13884c25ada2e086b50d36f061a0", discriminator: !441)
!433 = !{!434, !437, !439}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "0", scope: !432, file: !435, line: 18, baseType: !436, size: 8, align: 8, extraData: i128 0)
!435 = !DIFile(filename: "benches/spawn.rs", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/async-task-4.7.1", checksumkind: CSK_MD5, checksum: "0cb7f3757f10829ac66febe6a3a301f4")
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unresumed", scope: !427, file: !2, size: 8, align: 8, elements: !29, identifier: "b642e50d6703506bcbde962abdf3e06d")
!437 = !DIDerivedType(tag: DW_TAG_member, name: "1", scope: !432, file: !435, line: 18, baseType: !438, size: 8, align: 8, extraData: i128 1)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Returned", scope: !427, file: !2, size: 8, align: 8, elements: !29, identifier: "da9697941021dd6b8ecb49bbd8281fb5")
!439 = !DIDerivedType(tag: DW_TAG_member, name: "2", scope: !432, file: !435, line: 18, baseType: !440, size: 8, align: 8, extraData: i128 2)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "Panicked", scope: !427, file: !2, size: 8, align: 8, elements: !29, identifier: "75e00ffbbb405d53eea3b72c830caa6c")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !427, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !308, file: !2, baseType: !443, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::result::Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", baseType: !444, size: 64, align: 64, dwarfAddressSpace: 0)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", scope: !32, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !445, templateParams: !29, identifier: "53dec22df4875abbdb0f8e9ab7096d8c")
!445 = !{!446}
!446 = !DICompositeType(tag: DW_TAG_variant_part, scope: !444, file: !2, size: 128, align: 64, elements: !447, templateParams: !29, identifier: "9330202a7894ebe9d2bebfb13ca94b5f", discriminator: !468)
!447 = !{!448, !464}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !446, file: !2, baseType: !449, size: 128, align: 64, extraData: i128 0)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !444, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !450, templateParams: !452, identifier: "1d2102a372591620634126e96a2e2142")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !449, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!452 = !{!42, !453}
!453 = !DITemplateTypeParameter(name: "E", type: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !455, templateParams: !29, identifier: "69efc71d62726b9d235d74b72706b922")
!455 = !{!456, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !454, file: !2, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !29, identifier: "d9d0340af71c3931acd562336146ce60")
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !454, file: !2, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !461, size: 64, align: 64, dwarfAddressSpace: 0)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 4, lowerBound: 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !446, file: !2, baseType: !465, size: 128, align: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !444, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !466, templateParams: !452, identifier: "79beb65a77bb93c117a0bf64f94129e3")
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !465, file: !2, baseType: !454, size: 128, align: 64, flags: DIFlagPublic)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !444, file: !2, baseType: !161, size: 64, align: 64, flags: DIFlagArtificial)
!469 = !{!470, !42, !471, !414}
!470 = !DITemplateTypeParameter(name: "F", type: !427)
!471 = !DITemplateTypeParameter(name: "S", type: !417)
!472 = !DISubprogram(name: "drop_waker<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$10drop_waker17hdd5bc0965d5a06e4E", scope: !308, file: !307, line: 382, type: !358, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !469)
!473 = !{!474, !475, !475, !475, !475, !477}
!474 = !DILocalVariable(name: "ptr", arg: 1, scope: !306, file: !307, line: 382, type: !6)
!475 = !DILocalVariable(name: "raw", scope: !476, file: !307, line: 383, type: !308, align: 8)
!476 = distinct !DILexicalBlock(scope: !306, file: !307, line: 383, column: 9)
!477 = !DILocalVariable(name: "new", scope: !478, file: !307, line: 386, type: !9, align: 8)
!478 = distinct !DILexicalBlock(scope: !476, file: !307, line: 386, column: 9)
!479 = !{i32 0}
!480 = !DILocalVariable(name: "val", scope: !481, file: !482, line: 2686, type: !9, align: 8)
!481 = distinct !DILexicalBlock(scope: !483, file: !482, line: 2686, column: 13)
!482 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "3974e4024eb8e2ba36045270da58dc5a")
!483 = distinct !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17h83dbbb1e9ac08f15E", scope: !318, file: !482, line: 2686, type: !484, scopeLine: 2686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, declaration: !487, retainedNodes: !488)
!484 = !DISubroutineType(types: !485)
!485 = !{!9, !486, !9, !277}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17h83dbbb1e9ac08f15E", scope: !318, file: !482, line: 2686, type: !484, scopeLine: 2686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !29)
!488 = !{!489, !480, !490}
!489 = !DILocalVariable(name: "self", arg: 1, scope: !481, file: !482, line: 2686, type: !486)
!490 = !DILocalVariable(name: "order", scope: !481, file: !482, line: 2686, type: !277, align: 1)
!491 = !DILocation(line: 0, scope: !481, inlinedAt: !492)
!492 = !DILocation(line: 386, column: 39, scope: !476)
!493 = !DILocalVariable(name: "val", scope: !494, file: !482, line: 3344, type: !9, align: 8)
!494 = distinct !DILexicalBlock(scope: !495, file: !482, line: 3344, column: 1)
!495 = distinct !DISubprogram(name: "atomic_sub<usize>", linkageName: "_ZN4core4sync6atomic10atomic_sub17h1adba34cc386fb8dE", scope: !278, file: !482, line: 3344, type: !496, scopeLine: 3344, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, retainedNodes: !499)
!496 = !DISubroutineType(types: !497)
!497 = !{!9, !498, !9, !277}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!499 = !{!500, !493, !501}
!500 = !DILocalVariable(name: "dst", arg: 1, scope: !494, file: !482, line: 3344, type: !498)
!501 = !DILocalVariable(name: "order", scope: !494, file: !482, line: 3344, type: !277, align: 1)
!502 = !DILocation(line: 0, scope: !494, inlinedAt: !503)
!503 = !DILocation(line: 2688, column: 26, scope: !481, inlinedAt: !492)
!504 = !DILocalVariable(name: "val", scope: !505, file: !482, line: 2431, type: !9, align: 8)
!505 = distinct !DILexicalBlock(scope: !506, file: !482, line: 2431, column: 13)
!506 = distinct !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h342e0a2ec353d1b3E", scope: !318, file: !482, line: 2431, type: !507, scopeLine: 2431, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, declaration: !509, retainedNodes: !510)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !486, !9, !277}
!509 = !DISubprogram(name: "store", linkageName: "_ZN4core4sync6atomic11AtomicUsize5store17h342e0a2ec353d1b3E", scope: !318, file: !482, line: 2431, type: !507, scopeLine: 2431, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !29)
!510 = !{!511, !504, !512}
!511 = !DILocalVariable(name: "self", arg: 1, scope: !505, file: !482, line: 2431, type: !486)
!512 = !DILocalVariable(name: "order", scope: !505, file: !482, line: 2431, type: !277, align: 1)
!513 = !DILocation(line: 0, scope: !505, inlinedAt: !514)
!514 = !DILocation(line: 396, column: 22, scope: !478)
!515 = !DILocation(line: 0, scope: !306)
!516 = !DILocation(line: 0, scope: !476)
!517 = !DILocalVariable(name: "self", arg: 1, scope: !518, file: !519, line: 2144, type: !523)
!518 = distinct !DILexicalBlock(scope: !520, file: !519, line: 2144, column: 5)
!519 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "96190046e27e935d811dc31e0616c631")
!520 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha6aa499416671576E", scope: !321, file: !519, line: 2144, type: !521, scopeLine: 2144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, declaration: !524, retainedNodes: !525)
!521 = !DISubroutineType(types: !522)
!522 = !{!498, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<usize>", baseType: !321, size: 64, align: 64, dwarfAddressSpace: 0)
!524 = !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha6aa499416671576E", scope: !321, file: !519, line: 2144, type: !521, scopeLine: 2144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !325)
!525 = !{!517, !526}
!526 = !DILocalVariable(name: "self", arg: 1, scope: !527, file: !519, line: 2144, type: !523)
!527 = distinct !DILexicalBlock(scope: !520, file: !519, line: 2144, column: 5)
!528 = !DILocation(line: 0, scope: !518, inlinedAt: !529)
!529 = !DILocation(line: 2688, column: 44, scope: !481, inlinedAt: !492)
!530 = !DILocation(line: 2148, column: 9, scope: !518, inlinedAt: !529)
!531 = !{!"instruction in unsafe Rust fn or block"}
!532 = !{i32 2148, !"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/cell.rs"}
!533 = !DILocation(line: 3351, column: 23, scope: !494, inlinedAt: !503)
!534 = !{i32 3351, !"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs"}
!535 = !DILocation(line: 0, scope: !478)
!536 = !DILocation(line: 390, column: 12, scope: !478)
!537 = !{i32 390, !"src/raw.rs"}
!538 = !DILocation(line: 390, column: 43, scope: !478)
!539 = !DILocation(line: 1, column: 1, scope: !540)
!540 = !DILexicalBlockFile(scope: !478, file: !435, discriminator: 0)
!541 = !{i32 1, !"benches/spawn.rs"}
!542 = !DILocation(line: 391, column: 16, scope: !478)
!543 = !{i32 391, !"src/raw.rs"}
!544 = !DILocalVariable(name: "order", arg: 3, scope: !545, file: !482, line: 3279, type: !277)
!545 = distinct !DISubprogram(name: "atomic_store<usize>", linkageName: "_ZN4core4sync6atomic12atomic_store17h2b9bddf9b60848b8E", scope: !278, file: !482, line: 3279, type: !546, scopeLine: 3279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, retainedNodes: !548)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !498, !9, !277}
!548 = !{!549, !550, !544}
!549 = !DILocalVariable(name: "dst", arg: 1, scope: !545, file: !482, line: 3279, type: !498)
!550 = !DILocalVariable(name: "val", arg: 2, scope: !545, file: !482, line: 3279, type: !9)
!551 = !DILocation(line: 0, scope: !545, inlinedAt: !552)
!552 = distinct !DILocation(line: 2433, column: 26, scope: !505, inlinedAt: !514)
!553 = !DILocation(line: 3284, column: 24, scope: !545, inlinedAt: !552)
!554 = !DILocalVariable(name: "ptr", arg: 1, scope: !555, file: !307, line: 427, type: !6)
!555 = distinct !DISubprogram(name: "schedule<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$8schedule17h39227753fbe4dcbdE", scope: !308, file: !307, line: 427, type: !375, scopeLine: 427, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !469, declaration: !556, retainedNodes: !557)
!556 = !DISubprogram(name: "schedule<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$8schedule17h39227753fbe4dcbdE", scope: !308, file: !307, line: 427, type: !375, scopeLine: 427, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !469)
!557 = !{!554, !558, !559, !559, !559, !559, !561, !563}
!558 = !DILocalVariable(name: "info", arg: 2, scope: !555, file: !307, line: 427, type: !377)
!559 = !DILocalVariable(name: "raw", scope: !560, file: !307, line: 428, type: !308, align: 8)
!560 = distinct !DILexicalBlock(scope: !555, file: !307, line: 428, column: 9)
!561 = !DILocalVariable(name: "_waker", scope: !562, file: !307, line: 432, type: !340, align: 8)
!562 = distinct !DILexicalBlock(scope: !560, file: !307, line: 432, column: 9)
!563 = !DILocalVariable(name: "task", scope: !564, file: !307, line: 437, type: !420, align: 8)
!564 = distinct !DILexicalBlock(scope: !562, file: !307, line: 437, column: 9)
!565 = !DILocation(line: 0, scope: !555, inlinedAt: !566)
!566 = distinct !DILocation(line: 397, column: 17, scope: !478)
!567 = !DILocation(line: 432, column: 13, scope: !562, inlinedAt: !566)
!568 = !DILocation(line: 0, scope: !560, inlinedAt: !566)
!569 = !DILocation(line: 433, column: 12, scope: !562, inlinedAt: !566)
!570 = !DILocation(line: 437, column: 39, scope: !562, inlinedAt: !566)
!571 = !DILocation(line: 0, scope: !564, inlinedAt: !566)
!572 = !DILocation(line: 438, column: 9, scope: !564, inlinedAt: !566)
!573 = !DILocalVariable(name: "self", arg: 1, scope: !574, file: !575, line: 107, type: !579)
!574 = distinct !DISubprogram(name: "schedule<(), fn(async_task::runnable::Runnable<()>)>", linkageName: "_ZN61_$LT$F$u20$as$u20$async_task..runnable..Schedule$LT$M$GT$$GT$8schedule17ha49dd79da4ac7382E", scope: !576, file: !575, line: 107, type: !577, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !583, retainedNodes: !580)
!575 = !DIFile(filename: "src/runnable.rs", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/async-task-4.7.1", checksumkind: CSK_MD5, checksum: "8284069b7106026e7e395da439c1a401")
!576 = !DINamespace(name: "{impl#2}", scope: !378)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579, !420, !377}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&fn(async_task::runnable::Runnable<()>)", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!580 = !{!573, !581, !582}
!581 = !DILocalVariable(name: "runnable", arg: 2, scope: !574, file: !575, line: 107, type: !420)
!582 = !DILocalVariable(arg: 3, scope: !574, file: !575, line: 107, type: !377)
!583 = !{!414, !584}
!584 = !DITemplateTypeParameter(name: "F", type: !417)
!585 = !DILocation(line: 0, scope: !574, inlinedAt: !586)
!586 = distinct !DILocation(line: 438, column: 9, scope: !564, inlinedAt: !566)
!587 = !DILocalVariable(arg: 2, scope: !588, file: !589, line: 79, type: !600)
!588 = distinct !DISubprogram(name: "call<fn(async_task::runnable::Runnable<()>), (async_task::runnable::Runnable<()>)>", linkageName: "_ZN4core3ops8function2Fn4call17h87c61896fee97210E", scope: !590, file: !589, line: 79, type: !593, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !597, retainedNodes: !595)
!589 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "abc772494ea8033dad5cae2e40e54b10")
!590 = !DINamespace(name: "Fn", scope: !591)
!591 = !DINamespace(name: "function", scope: !592)
!592 = !DINamespace(name: "ops", scope: !33)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !579, !420}
!595 = !{!596, !587}
!596 = !DILocalVariable(arg: 1, scope: !588, file: !589, line: 79, type: !579)
!597 = !{!598, !599}
!598 = !DITemplateTypeParameter(name: "Self", type: !417)
!599 = !DITemplateTypeParameter(name: "Args", type: !600)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "(async_task::runnable::Runnable<()>)", file: !2, size: 64, align: 64, elements: !601, templateParams: !29, identifier: "66c8bba0f6202eaa53e544f71e84baf0")
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !600, file: !2, baseType: !420, size: 64, align: 64)
!603 = !DILocation(line: 0, scope: !588, inlinedAt: !604)
!604 = distinct !DILocation(line: 108, column: 9, scope: !574, inlinedAt: !586)
!605 = !DILocalVariable(name: "_x", arg: 1, scope: !606, file: !607, line: 938, type: !420)
!606 = distinct !DISubprogram(name: "drop<async_task::runnable::Runnable<()>>", linkageName: "_ZN4core3mem4drop17he96df1e3052df8eaE", scope: !608, file: !607, line: 938, type: !418, scopeLine: 938, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !610, retainedNodes: !609)
!607 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ab6d66e759286ff434b3e279bd7267d7")
!608 = !DINamespace(name: "mem", scope: !33)
!609 = !{!605}
!610 = !{!611}
!611 = !DITemplateTypeParameter(name: "T", type: !420)
!612 = !DILocation(line: 0, scope: !606, inlinedAt: !613)
!613 = distinct !DILocation(line: 79, column: 5, scope: !588, inlinedAt: !604)
!614 = !DILocation(line: 938, column: 24, scope: !606, inlinedAt: !613)
!615 = !{i32 427, !"src/raw.rs"}
!616 = !DILocation(line: 439, column: 5, scope: !560, inlinedAt: !566)
!617 = !DILocation(line: 427, column: 5, scope: !555, inlinedAt: !566)
!618 = !DILocation(line: 438, column: 44, scope: !564, inlinedAt: !566)
!619 = !DILocation(line: 439, column: 6, scope: !555, inlinedAt: !566)
!620 = !DILocation(line: 397, column: 17, scope: !478)
!621 = !{i32 397, !"src/raw.rs"}
!622 = !DILocalVariable(name: "ptr", arg: 1, scope: !623, file: !307, line: 463, type: !6)
!623 = distinct !DISubprogram(name: "destroy<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$7destroy17h2bce9ad0f75d2030E", scope: !308, file: !307, line: 463, type: !358, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !469, declaration: !624, retainedNodes: !625)
!624 = !DISubprogram(name: "destroy<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$7destroy17h2bce9ad0f75d2030E", scope: !308, file: !307, line: 463, type: !358, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !469)
!625 = !{!622, !626, !628, !628, !628, !628}
!626 = !DILocalVariable(name: "raw", scope: !627, file: !307, line: 464, type: !308, align: 8)
!627 = distinct !DILexicalBlock(scope: !623, file: !307, line: 464, column: 9)
!628 = !DILocalVariable(name: "task_layout", scope: !629, file: !307, line: 465, type: !396, align: 8)
!629 = distinct !DILexicalBlock(scope: !627, file: !307, line: 465, column: 9)
!630 = !DILocation(line: 0, scope: !623, inlinedAt: !631)
!631 = distinct !DILocation(line: 400, column: 17, scope: !478)
!632 = !DILocation(line: 0, scope: !627, inlinedAt: !631)
!633 = !DILocation(line: 0, scope: !629, inlinedAt: !631)
!634 = !DILocation(line: 468, column: 9, scope: !629, inlinedAt: !631)
!635 = !DILocation(line: 542, column: 1, scope: !636, inlinedAt: !643)
!636 = distinct !DISubprogram(name: "drop_in_place<core::option::Option<core::task::wake::Waker>>", linkageName: "_ZN4core3ptr72drop_in_place$LT$core..option..Option$LT$core..task..wake..Waker$GT$$GT$17h84dc4476c5f4bef7E", scope: !54, file: !637, line: 542, type: !638, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !367, retainedNodes: !641)
!637 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "a85d519116fde26821981e2ebfa0ecba")
!638 = !DISubroutineType(types: !639)
!639 = !{null, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<core::task::wake::Waker>", baseType: !331, size: 64, align: 64, dwarfAddressSpace: 0)
!641 = !{!642}
!642 = !DILocalVariable(arg: 1, scope: !636, file: !637, line: 542, type: !640)
!643 = distinct !DILocation(line: 542, column: 1, scope: !644, inlinedAt: !652)
!644 = distinct !DISubprogram(name: "drop_in_place<core::cell::UnsafeCell<core::option::Option<core::task::wake::Waker>>>", linkageName: "_ZN4core3ptr102drop_in_place$LT$core..cell..UnsafeCell$LT$core..option..Option$LT$core..task..wake..Waker$GT$$GT$$GT$17hbe8b6406379d6d57E", scope: !54, file: !637, line: 542, type: !645, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !650, retainedNodes: !648)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::cell::UnsafeCell<core::option::Option<core::task::wake::Waker>>", baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!648 = !{!649}
!649 = !DILocalVariable(arg: 1, scope: !644, file: !637, line: 542, type: !647)
!650 = !{!651}
!651 = !DITemplateTypeParameter(name: "T", type: !328)
!652 = distinct !DILocation(line: 542, column: 1, scope: !653, inlinedAt: !661)
!653 = distinct !DISubprogram(name: "drop_in_place<async_task::header::Header<()>>", linkageName: "_ZN4core3ptr63drop_in_place$LT$async_task..header..Header$LT$$LP$$RP$$GT$$GT$17h184f92c5ba2fe40bE", scope: !54, file: !637, line: 542, type: !654, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !659, retainedNodes: !657)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut async_task::header::Header<()>", baseType: !314, size: 64, align: 64, dwarfAddressSpace: 0)
!657 = !{!658}
!658 = !DILocalVariable(arg: 1, scope: !653, file: !637, line: 542, type: !656)
!659 = !{!660}
!660 = !DITemplateTypeParameter(name: "T", type: !314)
!661 = distinct !DILocation(line: 1573, column: 18, scope: !662, inlinedAt: !669)
!662 = distinct !DILexicalBlock(scope: !664, file: !663, line: 1571, column: 5)
!663 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "8cba8f2cafffb0d8862ad9c302ad0cdd")
!664 = distinct !DISubprogram(name: "drop_in_place<async_task::header::Header<()>>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$13drop_in_place17ha001eb61274d698aE", scope: !665, file: !663, line: 1571, type: !654, scopeLine: 1571, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !659, retainedNodes: !667)
!665 = !DINamespace(name: "{impl#0}", scope: !666)
!666 = !DINamespace(name: "mut_ptr", scope: !54)
!667 = !{!668}
!668 = !DILocalVariable(name: "self", arg: 1, scope: !662, file: !663, line: 1571, type: !656)
!669 = distinct !DILocation(line: 470, column: 44, scope: !670, inlinedAt: !684)
!670 = distinct !DISubprogram(name: "{closure#0}<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$7destroy28_$u7b$$u7b$closure$u7d$$u7d$17h3962e157b09765d1E", scope: !671, file: !307, line: 468, type: !673, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !469, retainedNodes: !681)
!671 = !DINamespace(name: "destroy", scope: !672)
!672 = !DINamespace(name: "{impl#3}", scope: !309)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !675}
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", scope: !671, file: !2, size: 128, align: 64, elements: !676, templateParams: !29, identifier: "6b6d186cc52aa265d9fb9befd054c513")
!676 = !{!677, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__raw__header", scope: !675, file: !2, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const async_task::header::Header<()>", baseType: !313, size: 64, align: 64, dwarfAddressSpace: 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__raw__schedule", scope: !675, file: !2, baseType: !680, size: 64, align: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const fn(async_task::runnable::Runnable<()>)", baseType: !416, size: 64, align: 64, dwarfAddressSpace: 0)
!681 = !{!682, !683}
!682 = !DILocalVariable(name: "raw__header", scope: !670, file: !307, line: 464, type: !313, align: 8)
!683 = !DILocalVariable(name: "raw__schedule", scope: !670, file: !307, line: 464, type: !416, align: 8)
!684 = distinct !DILocation(line: 34, column: 13, scope: !685, inlinedAt: !698)
!685 = distinct !DILexicalBlock(scope: !687, file: !686, line: 33, column: 5)
!686 = !DIFile(filename: "src/utils.rs", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/async-task-4.7.1", checksumkind: CSK_MD5, checksum: "5b70d4d2b6c6e73079dd7b9085e0915f")
!687 = distinct !DISubprogram(name: "abort_on_panic<(), async_task::raw::{impl#3}::destroy::{closure_env#0}<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>>", linkageName: "_ZN10async_task5utils14abort_on_panic17hfdfa0da4cb97ba92E", scope: !688, file: !686, line: 24, type: !673, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !696, retainedNodes: !689)
!688 = !DINamespace(name: "utils", scope: !310)
!689 = !{!690, !691, !694}
!690 = !DILocalVariable(name: "f", arg: 1, scope: !687, file: !686, line: 24, type: !675)
!691 = !DILocalVariable(name: "bomb", scope: !685, file: !686, line: 33, type: !692, align: 1)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bomb", scope: !693, file: !2, align: 8, flags: DIFlagProtected, elements: !29, identifier: "7627f8500d81ea11dcdd736bd89bb40")
!693 = !DINamespace(name: "abort_on_panic", scope: !688)
!694 = !DILocalVariable(name: "t", scope: !695, file: !686, line: 34, type: !7, align: 1)
!695 = distinct !DILexicalBlock(scope: !685, file: !686, line: 34, column: 5)
!696 = !{!42, !697}
!697 = !DITemplateTypeParameter(name: "impl FnOnce() -> T", type: !675)
!698 = distinct !DILocation(line: 468, column: 9, scope: !629, inlinedAt: !631)
!699 = !DILocation(line: 33, column: 9, scope: !685, inlinedAt: !698)
!700 = !DILocation(line: 0, scope: !687, inlinedAt: !698)
!701 = !DILocation(line: 0, scope: !670, inlinedAt: !684)
!702 = !DILocation(line: 0, scope: !662, inlinedAt: !669)
!703 = !DILocation(line: 0, scope: !653, inlinedAt: !661)
!704 = !DILocation(line: 0, scope: !644, inlinedAt: !652)
!705 = !DILocation(line: 0, scope: !636, inlinedAt: !643)
!706 = !DILocalVariable(arg: 1, scope: !707, file: !637, line: 542, type: !710)
!707 = distinct !DISubprogram(name: "drop_in_place<core::task::wake::Waker>", linkageName: "_ZN4core3ptr44drop_in_place$LT$core..task..wake..Waker$GT$17hc9e35fcdbaff2345E", scope: !54, file: !637, line: 542, type: !708, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !338, retainedNodes: !711)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::task::wake::Waker", baseType: !340, size: 64, align: 64, dwarfAddressSpace: 0)
!711 = !{!706}
!712 = !DILocation(line: 0, scope: !707, inlinedAt: !713)
!713 = distinct !DILocation(line: 542, column: 1, scope: !636, inlinedAt: !643)
!714 = !DILocalVariable(name: "self", arg: 1, scope: !715, file: !716, line: 629, type: !720)
!715 = distinct !DISubprogram(name: "drop", linkageName: "_ZN65_$LT$core..task..wake..Waker$u20$as$u20$core..ops..drop..Drop$GT$4drop17hf4be223045c3b68eE", scope: !717, file: !716, line: 629, type: !718, scopeLine: 629, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, retainedNodes: !721)
!716 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/task/wake.rs", directory: "", checksumkind: CSK_MD5, checksum: "2d1b9043f786ef2c63ff5b941e8d2886")
!717 = !DINamespace(name: "{impl#10}", scope: !341)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::task::wake::Waker", baseType: !340, size: 64, align: 64, dwarfAddressSpace: 0)
!721 = !{!714}
!722 = !DILocation(line: 0, scope: !715, inlinedAt: !723)
!723 = distinct !DILocation(line: 542, column: 1, scope: !707, inlinedAt: !713)
!724 = !DILocation(line: 633, column: 18, scope: !715, inlinedAt: !723)
!725 = !DILocalVariable(arg: 1, scope: !726, file: !637, line: 542, type: !729)
!726 = distinct !DISubprogram(name: "drop_in_place<async_task::utils::abort_on_panic::Bomb>", linkageName: "_ZN4core3ptr60drop_in_place$LT$async_task..utils..abort_on_panic..Bomb$GT$17h4d825f5176435e7dE", scope: !54, file: !637, line: 542, type: !727, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !731, retainedNodes: !730)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut async_task::utils::abort_on_panic::Bomb", baseType: !692, size: 64, align: 64, dwarfAddressSpace: 0)
!730 = !{!725}
!731 = !{!732}
!732 = !DITemplateTypeParameter(name: "T", type: !692)
!733 = !DILocation(line: 0, scope: !726, inlinedAt: !734)
!734 = distinct !DILocation(line: 37, column: 1, scope: !687, inlinedAt: !698)
!735 = !DILocation(line: 542, column: 1, scope: !726, inlinedAt: !734)
!736 = !DILocation(line: 24, column: 1, scope: !687, inlinedAt: !698)
!737 = !DILocation(line: 37, column: 2, scope: !687, inlinedAt: !698)
!738 = !DILocalVariable(name: "ptr", arg: 1, scope: !739, file: !740, line: 118, type: !745)
!739 = distinct !DILexicalBlock(scope: !741, file: !740, line: 118, column: 1)
!740 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/alloc.rs", directory: "", checksumkind: CSK_MD5, checksum: "6687e3e140ed9b8c51f77000a3d3a272")
!741 = distinct !DISubprogram(name: "dealloc", linkageName: "_ZN5alloc5alloc7dealloc17h50c1b4509c737c52E", scope: !742, file: !740, line: 118, type: !743, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, retainedNodes: !746)
!742 = !DINamespace(name: "alloc", scope: !301)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !745, !399}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!746 = !{!738, !747}
!747 = !DILocalVariable(name: "layout", arg: 2, scope: !739, file: !740, line: 118, type: !399)
!748 = !DILocation(line: 0, scope: !739, inlinedAt: !749)
!749 = distinct !DILocation(line: 477, column: 9, scope: !629, inlinedAt: !631)
!750 = !DILocation(line: 119, column: 14, scope: !739, inlinedAt: !749)
!751 = !{i32 119, !"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/alloc.rs"}
!752 = !DILocation(line: 478, column: 6, scope: !623, inlinedAt: !631)
!753 = !DILocation(line: 400, column: 17, scope: !478)
!754 = !{i32 400, !"src/raw.rs"}
!755 = !DILocation(line: 390, column: 9, scope: !478)
!756 = !DILocation(line: 403, column: 6, scope: !306)
!757 = !{i32 403, !"src/raw.rs"}
!758 = distinct !DISubprogram(name: "get_output<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$10get_output17h9da173b5e21f3529E", scope: !759, file: !307, line: 453, type: !385, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !779, declaration: !781, retainedNodes: !782)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawTask<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", scope: !309, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !760, templateParams: !779, identifier: "19662b0340f47f77cd71f031faa7aba7")
!760 = !{!761, !762, !763, !778}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !759, file: !2, baseType: !313, size: 64, align: 64, flags: DIFlagProtected)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !759, file: !2, baseType: !416, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "future", scope: !759, file: !2, baseType: !764, size: 64, align: 64, offset: 128, flags: DIFlagProtected)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut spawn::task_create::{closure#0}::{async_block_env#0}", baseType: !765, size: 64, align: 64, dwarfAddressSpace: 0)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "{async_block_env#0}", scope: !766, file: !2, size: 8, align: 8, elements: !768, templateParams: !29, identifier: "490a53d3b651212eefc88803d2ca0ed6")
!766 = !DINamespace(name: "{closure#0}", scope: !767)
!767 = !DINamespace(name: "task_create", scope: !430)
!768 = !{!769}
!769 = !DICompositeType(tag: DW_TAG_variant_part, scope: !765, file: !2, size: 8, align: 8, elements: !770, templateParams: !29, identifier: "c40ddd9f9c3f25e0b607b1cf9adb3fd4", discriminator: !777)
!770 = !{!771, !773, !775}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "0", scope: !769, file: !435, line: 11, baseType: !772, size: 8, align: 8, extraData: i128 0)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unresumed", scope: !765, file: !2, size: 8, align: 8, elements: !29, identifier: "cf62d48bfd862c7cae5908d3c119d349")
!773 = !DIDerivedType(tag: DW_TAG_member, name: "1", scope: !769, file: !435, line: 11, baseType: !774, size: 8, align: 8, extraData: i128 1)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Returned", scope: !765, file: !2, size: 8, align: 8, elements: !29, identifier: "f95867aa1ff0dbbadcaddd136bfbca82")
!775 = !DIDerivedType(tag: DW_TAG_member, name: "2", scope: !769, file: !435, line: 11, baseType: !776, size: 8, align: 8, extraData: i128 2)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Panicked", scope: !765, file: !2, size: 8, align: 8, elements: !29, identifier: "9dc4526aeb5247ee2aad6799f050d4e1")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !765, file: !2, baseType: !79, size: 8, align: 8, flags: DIFlagArtificial)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !759, file: !2, baseType: !443, size: 64, align: 64, offset: 192, flags: DIFlagProtected)
!779 = !{!780, !42, !471, !414}
!780 = !DITemplateTypeParameter(name: "F", type: !765)
!781 = !DISubprogram(name: "get_output<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$10get_output17h9da173b5e21f3529E", scope: !759, file: !307, line: 453, type: !385, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !779)
!782 = !{!783, !784, !784, !784, !784}
!783 = !DILocalVariable(name: "ptr", arg: 1, scope: !758, file: !307, line: 453, type: !6)
!784 = !DILocalVariable(name: "raw", scope: !785, file: !307, line: 454, type: !759, align: 8)
!785 = distinct !DILexicalBlock(scope: !758, file: !307, line: 454, column: 9)
!786 = !{i32 1}
!787 = !DILocation(line: 0, scope: !758)
!788 = !DILocalVariable(name: "ptr", arg: 1, scope: !789, file: !307, line: 212, type: !6)
!789 = distinct !DILexicalBlock(scope: !790, file: !307, line: 212, column: 5)
!790 = distinct !DISubprogram(name: "from_ptr<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$8from_ptr17hebf9065bb560f823E", scope: !759, file: !307, line: 212, type: !791, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !779, declaration: !793, retainedNodes: !794)
!791 = !DISubroutineType(types: !792)
!792 = !{!759, !6}
!793 = !DISubprogram(name: "from_ptr<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$8from_ptr17hebf9065bb560f823E", scope: !759, file: !307, line: 212, type: !791, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !779)
!794 = !{!788, !795, !795, !795, !795, !795, !797}
!795 = !DILocalVariable(name: "task_layout", scope: !796, file: !307, line: 213, type: !396, align: 8)
!796 = distinct !DILexicalBlock(scope: !789, file: !307, line: 213, column: 9)
!797 = !DILocalVariable(name: "p", scope: !798, file: !307, line: 214, type: !799, align: 8)
!798 = distinct !DILexicalBlock(scope: !796, file: !307, line: 214, column: 9)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!800 = !DILocation(line: 0, scope: !789, inlinedAt: !801)
!801 = !DILocation(line: 454, column: 19, scope: !758)
!802 = !DILocation(line: 0, scope: !796, inlinedAt: !801)
!803 = !DILocalVariable(name: "count", arg: 2, scope: !804, file: !805, line: 1000, type: !9)
!804 = distinct !DILexicalBlock(scope: !806, file: !805, line: 1000, column: 5)
!805 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "b925067ec6cc15f01151b5ae643852d1")
!806 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h89dcb15caa9afb60E", scope: !807, file: !805, line: 1000, type: !809, scopeLine: 1000, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !819, retainedNodes: !811)
!807 = !DINamespace(name: "{impl#0}", scope: !808)
!808 = !DINamespace(name: "const_ptr", scope: !54)
!809 = !DISubroutineType(types: !810)
!810 = !{!799, !799, !9}
!811 = !{!812, !814, !815, !817, !818, !803}
!812 = !DILocalVariable(name: "self", arg: 1, scope: !813, file: !805, line: 1000, type: !799)
!813 = distinct !DILexicalBlock(scope: !806, file: !805, line: 1000, column: 5)
!814 = !DILocalVariable(name: "count", arg: 2, scope: !813, file: !805, line: 1000, type: !9)
!815 = !DILocalVariable(name: "self", arg: 1, scope: !816, file: !805, line: 1000, type: !799)
!816 = distinct !DILexicalBlock(scope: !806, file: !805, line: 1000, column: 5)
!817 = !DILocalVariable(name: "count", arg: 2, scope: !816, file: !805, line: 1000, type: !9)
!818 = !DILocalVariable(name: "self", arg: 1, scope: !804, file: !805, line: 1000, type: !799)
!819 = !{!820}
!820 = !DITemplateTypeParameter(name: "T", type: !79)
!821 = !DILocation(line: 0, scope: !804, inlinedAt: !822)
!822 = !DILocation(line: 221, column: 27, scope: !798, inlinedAt: !801)
!823 = !DILocation(line: 0, scope: !798, inlinedAt: !801)
!824 = !DILocation(line: 1005, column: 18, scope: !804, inlinedAt: !822)
!825 = !{i32 1005, !"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/const_ptr.rs"}
!826 = !DILocation(line: 456, column: 6, scope: !758)
!827 = !{i32 456, !"src/raw.rs"}
!828 = distinct !DISubprogram(name: "clone_waker<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11clone_waker17h823caf2824168b36E", scope: !759, file: !307, line: 361, type: !354, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !779, declaration: !829, retainedNodes: !830)
!829 = !DISubprogram(name: "clone_waker<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11clone_waker17h823caf2824168b36E", scope: !759, file: !307, line: 361, type: !354, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !779)
!830 = !{!831, !832, !832, !832, !832, !834}
!831 = !DILocalVariable(name: "ptr", arg: 1, scope: !828, file: !307, line: 361, type: !6)
!832 = !DILocalVariable(name: "raw", scope: !833, file: !307, line: 362, type: !759, align: 8)
!833 = distinct !DILexicalBlock(scope: !828, file: !307, line: 362, column: 9)
!834 = !DILocalVariable(name: "state", scope: !835, file: !307, line: 366, type: !9, align: 8)
!835 = distinct !DILexicalBlock(scope: !833, file: !307, line: 366, column: 9)
!836 = !{i32 2}
!837 = !DILocalVariable(name: "val", scope: !838, file: !482, line: 2656, type: !9, align: 8)
!838 = distinct !DILexicalBlock(scope: !839, file: !482, line: 2656, column: 13)
!839 = distinct !DISubprogram(name: "fetch_add", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_add17h908472aa2f25c32eE", scope: !318, file: !482, line: 2656, type: !484, scopeLine: 2656, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, declaration: !840, retainedNodes: !841)
!840 = !DISubprogram(name: "fetch_add", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_add17h908472aa2f25c32eE", scope: !318, file: !482, line: 2656, type: !484, scopeLine: 2656, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !29)
!841 = !{!842, !837, !843}
!842 = !DILocalVariable(name: "self", arg: 1, scope: !838, file: !482, line: 2656, type: !486)
!843 = !DILocalVariable(name: "order", scope: !838, file: !482, line: 2656, type: !277, align: 1)
!844 = !DILocation(line: 0, scope: !838, inlinedAt: !845)
!845 = !DILocation(line: 366, column: 41, scope: !833)
!846 = !DILocalVariable(name: "val", scope: !847, file: !482, line: 3327, type: !9, align: 8)
!847 = distinct !DILexicalBlock(scope: !848, file: !482, line: 3327, column: 1)
!848 = distinct !DISubprogram(name: "atomic_add<usize>", linkageName: "_ZN4core4sync6atomic10atomic_add17h30b9685088ff2d71E", scope: !278, file: !482, line: 3327, type: !496, scopeLine: 3327, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, retainedNodes: !849)
!849 = !{!850, !846, !851}
!850 = !DILocalVariable(name: "dst", arg: 1, scope: !847, file: !482, line: 3327, type: !498)
!851 = !DILocalVariable(name: "order", scope: !847, file: !482, line: 3327, type: !277, align: 1)
!852 = !DILocation(line: 0, scope: !847, inlinedAt: !853)
!853 = !DILocation(line: 2658, column: 26, scope: !838, inlinedAt: !845)
!854 = !DILocation(line: 0, scope: !828)
!855 = !DILocation(line: 0, scope: !833)
!856 = !DILocalVariable(name: "self", arg: 1, scope: !857, file: !519, line: 2144, type: !523)
!857 = distinct !DILexicalBlock(scope: !858, file: !519, line: 2144, column: 5)
!858 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha6aa499416671576E", scope: !321, file: !519, line: 2144, type: !521, scopeLine: 2144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, declaration: !524, retainedNodes: !859)
!859 = !{!856}
!860 = !DILocation(line: 0, scope: !857, inlinedAt: !861)
!861 = !DILocation(line: 2658, column: 44, scope: !838, inlinedAt: !845)
!862 = !DILocation(line: 2148, column: 9, scope: !857, inlinedAt: !861)
!863 = !DILocation(line: 3331, column: 24, scope: !847, inlinedAt: !853)
!864 = !{i32 3331, !"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs"}
!865 = !DILocation(line: 0, scope: !835)
!866 = !DILocation(line: 369, column: 12, scope: !835)
!867 = !{i32 369, !"src/raw.rs"}
!868 = !DILocation(line: 374, column: 6, scope: !828)
!869 = !{i32 374, !"src/raw.rs"}
!870 = !DILocation(line: 370, column: 13, scope: !835)
!871 = !{i32 370, !"src/raw.rs"}
!872 = distinct !DISubprogram(name: "clone_waker<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11clone_waker17hed7cb9514b66dd55E", scope: !308, file: !307, line: 361, type: !354, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !469, declaration: !873, retainedNodes: !874)
!873 = !DISubprogram(name: "clone_waker<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11clone_waker17hed7cb9514b66dd55E", scope: !308, file: !307, line: 361, type: !354, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !469)
!874 = !{!875, !876, !876, !876, !876, !878}
!875 = !DILocalVariable(name: "ptr", arg: 1, scope: !872, file: !307, line: 361, type: !6)
!876 = !DILocalVariable(name: "raw", scope: !877, file: !307, line: 362, type: !308, align: 8)
!877 = distinct !DILexicalBlock(scope: !872, file: !307, line: 362, column: 9)
!878 = !DILocalVariable(name: "state", scope: !879, file: !307, line: 366, type: !9, align: 8)
!879 = distinct !DILexicalBlock(scope: !877, file: !307, line: 366, column: 9)
!880 = !{i32 3}
!881 = !DILocalVariable(name: "val", scope: !882, file: !482, line: 2656, type: !9, align: 8)
!882 = distinct !DILexicalBlock(scope: !883, file: !482, line: 2656, column: 13)
!883 = distinct !DISubprogram(name: "fetch_add", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_add17h908472aa2f25c32eE", scope: !318, file: !482, line: 2656, type: !484, scopeLine: 2656, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, declaration: !840, retainedNodes: !884)
!884 = !{!885, !881, !886}
!885 = !DILocalVariable(name: "self", arg: 1, scope: !882, file: !482, line: 2656, type: !486)
!886 = !DILocalVariable(name: "order", scope: !882, file: !482, line: 2656, type: !277, align: 1)
!887 = !DILocation(line: 0, scope: !882, inlinedAt: !888)
!888 = !DILocation(line: 366, column: 41, scope: !877)
!889 = !DILocalVariable(name: "val", scope: !890, file: !482, line: 3327, type: !9, align: 8)
!890 = distinct !DILexicalBlock(scope: !891, file: !482, line: 3327, column: 1)
!891 = distinct !DISubprogram(name: "atomic_add<usize>", linkageName: "_ZN4core4sync6atomic10atomic_add17h30b9685088ff2d71E", scope: !278, file: !482, line: 3327, type: !496, scopeLine: 3327, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, retainedNodes: !892)
!892 = !{!893, !889, !894}
!893 = !DILocalVariable(name: "dst", arg: 1, scope: !890, file: !482, line: 3327, type: !498)
!894 = !DILocalVariable(name: "order", scope: !890, file: !482, line: 3327, type: !277, align: 1)
!895 = !DILocation(line: 0, scope: !890, inlinedAt: !896)
!896 = !DILocation(line: 2658, column: 26, scope: !882, inlinedAt: !888)
!897 = !DILocation(line: 0, scope: !872)
!898 = !DILocation(line: 0, scope: !877)
!899 = !DILocalVariable(name: "self", arg: 1, scope: !900, file: !519, line: 2144, type: !523)
!900 = distinct !DILexicalBlock(scope: !901, file: !519, line: 2144, column: 5)
!901 = distinct !DISubprogram(name: "get<usize>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17ha6aa499416671576E", scope: !321, file: !519, line: 2144, type: !521, scopeLine: 2144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !325, declaration: !524, retainedNodes: !902)
!902 = !{!899}
!903 = !DILocation(line: 0, scope: !900, inlinedAt: !904)
!904 = !DILocation(line: 2658, column: 44, scope: !882, inlinedAt: !888)
!905 = !DILocation(line: 2148, column: 9, scope: !900, inlinedAt: !904)
!906 = !DILocation(line: 3331, column: 24, scope: !890, inlinedAt: !896)
!907 = !DILocation(line: 0, scope: !879)
!908 = !DILocation(line: 369, column: 12, scope: !879)
!909 = !DILocation(line: 374, column: 6, scope: !872)
!910 = !DILocation(line: 370, column: 13, scope: !879)
!911 = distinct !DISubprogram(name: "drop_future<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11drop_future17h528d722a714d9b81E", scope: !759, file: !307, line: 443, type: !358, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !779, declaration: !912, retainedNodes: !913)
!912 = !DISubprogram(name: "drop_future<spawn::task_create::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11drop_future17h528d722a714d9b81E", scope: !759, file: !307, line: 443, type: !358, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !779)
!913 = !{!914, !915}
!914 = !DILocalVariable(name: "ptr", arg: 1, scope: !911, file: !307, line: 443, type: !6)
!915 = !DILocalVariable(name: "raw", scope: !916, file: !307, line: 444, type: !759, align: 8)
!916 = distinct !DILexicalBlock(scope: !911, file: !307, line: 444, column: 9)
!917 = !{i32 4}
!918 = !DILocation(line: 0, scope: !911)
!919 = !DILocation(line: 450, column: 6, scope: !911)
!920 = !{i32 450, !"src/raw.rs"}
!921 = distinct !DISubprogram(name: "wake_by_ref<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11wake_by_ref17h444ad9fef4e8980dE", scope: !308, file: !307, line: 298, type: !358, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !469, declaration: !922, retainedNodes: !923)
!922 = !DISubprogram(name: "wake_by_ref<spawn::task_run::{closure#0}::{async_block_env#0}, (), fn(async_task::runnable::Runnable<()>), ()>", linkageName: "_ZN10async_task3raw28RawTask$LT$F$C$T$C$S$C$M$GT$11wake_by_ref17h444ad9fef4e8980dE", scope: !308, file: !307, line: 298, type: !358, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !469)
!923 = !{!924, !925, !925, !925, !925, !927, !929, !931, !933, !935}
!924 = !DILocalVariable(name: "ptr", arg: 1, scope: !921, file: !307, line: 298, type: !6)
!925 = !DILocalVariable(name: "raw", scope: !926, file: !307, line: 299, type: !308, align: 8)
!926 = distinct !DILexicalBlock(scope: !921, file: !307, line: 299, column: 9)
!927 = !DILocalVariable(name: "state", scope: !928, file: !307, line: 301, type: !9, align: 8)
!928 = distinct !DILexicalBlock(scope: !926, file: !307, line: 301, column: 9)
!929 = !DILocalVariable(name: "s", scope: !930, file: !307, line: 320, type: !9, align: 8)
!930 = distinct !DILexicalBlock(scope: !928, file: !307, line: 320, column: 21)
!931 = !DILocalVariable(name: "new", scope: !932, file: !307, line: 324, type: !9, align: 8)
!932 = distinct !DILexicalBlock(scope: !928, file: !307, line: 324, column: 17)
!933 = !DILocalVariable(name: "task", scope: !934, file: !307, line: 348, type: !420, align: 8)
!934 = distinct !DILexicalBlock(scope: !932, file: !307, line: 348, column: 29)
!935 = !DILocalVariable(name: "s", scope: !936, file: !307, line: 354, type: !9, align: 8)
!936 = distinct !DILexicalBlock(scope: !932, file: !307, line: 354, column: 21)
!937 = !{i32 5}
!938 = !DILocalVariable(name: "order", scope: !939, file: !482, line: 2404, type: !277, align: 1)
!939 = distinct !DILexicalBlock(scope: !940, file: !482, line: 2404, column: 13)
!940 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17ha275ef96911d62f2E", scope: !318, file: !482, line: 2404, type: !941, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !199, templateParams: !29, declaration: !943, retainedNodes: !944)
!941 = !DISubroutineType(types: !942)
!942 = !{!9, !486, !277}
!943 = !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic11AtomicUsize4load17ha275ef96911d62f2E", scope: !318, file: !482, line: 2404, type: !941, scopeLine: 2404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !29)
!944 = !{!945, !938}
!945 = !DILocalVariable(name: "self", arg: 1, scope: !939, file: !482, line: 2404, type: !486)
