; ModuleID = 'tracing.8a1c5b55e1d2bd9c-cgu.0'
source_filename = "tracing.8a1c5b55e1d2bd9c-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"tracing_core::dispatcher::Dispatch" = type { %"tracing_core::dispatcher::Kind<alloc::sync::Arc<dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync>>" }
%"tracing_core::dispatcher::Kind<alloc::sync::Arc<dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync>>" = type { i64, [2 x i64] }

@_ZN12tracing_core10dispatcher11GLOBAL_INIT17h32115fdb9b27e6eeE = external local_unnamed_addr global %"core::sync::atomic::AtomicUsize"
@_ZN12tracing_core10dispatcher15GLOBAL_DISPATCH17h87fe84e1b4a2c89aE = external local_unnamed_addr global %"tracing_core::dispatcher::Dispatch"
@_ZN12tracing_core10dispatcher4NONE17h6e5b38c8436baf83E = external local_unnamed_addr global %"tracing_core::dispatcher::Dispatch"
@alloc_41e6d83e28ed22dc441f7e93d8e2ff1c = private unnamed_addr constant <{ [2 x i8] }> <{ [2 x i8] c"Id" }>, align 1
@vtable.0 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7945e695e7aee2abE" }>, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&core::num::nonzero::NonZero<u64> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::num::nonzero::NonZero<u64> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "b2c7470d5e0ed9a3b53cf0dfd5a87d0")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::num::nonzero::NonZero<u64>", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<u64>", scope: !14, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !17, templateParams: !25, identifier: "865ca377f9884d17eb6d1de2ac2b0ca4")
!14 = !DINamespace(name: "nonzero", scope: !15)
!15 = !DINamespace(name: "num", scope: !16)
!16 = !DINamespace(name: "core", scope: null)
!17 = !{!18}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !13, file: !2, baseType: !19, size: 64, align: 64, flags: DIFlagPrivate)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64Inner", scope: !20, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !21, templateParams: !24, identifier: "83ed7247d11b03e3fd807680270ea392")
!20 = !DINamespace(name: "private", scope: !14)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !19, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagPrivate)
!23 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!24 = !{}
!25 = !{!26}
!26 = !DITemplateTypeParameter(name: "T", type: !23)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "<&tracing_core::metadata::LevelInner as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&tracing_core::metadata::LevelInner as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !30, vtableHolder: !35, templateParams: !24, identifier: "caa48abd01896fbcb012d4b944a6322c")
!30 = !{!31, !32, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !29, file: !2, baseType: !6, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !29, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !29, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::metadata::LevelInner", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LevelInner", scope: !37, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagEnumClass, elements: !39)
!37 = !DINamespace(name: "metadata", scope: !38)
!38 = !DINamespace(name: "tracing_core", scope: null)
!39 = !{!40, !41, !42, !43, !44}
!40 = !DIEnumerator(name: "Trace", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "Info", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "Warn", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "Error", value: 4, isUnsigned: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !48, vtableHolder: !53, templateParams: !24, identifier: "590bafd6944d20d0c360131be18cbca1")
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !47, file: !2, baseType: !6, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !47, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !47, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !47, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !54, templateParams: !24, identifier: "9277eecd40495f85161460476aacc992")
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !53, file: !2, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "<&tracing_core::metadata::Level as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&tracing_core::metadata::Level as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !62, vtableHolder: !67, templateParams: !24, identifier: "4e0eb8bd0cafc45e96b3e0848142adbe")
!62 = !{!63, !64, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !61, file: !2, baseType: !6, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !61, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !61, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !61, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::metadata::Level", baseType: !68, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Level", scope: !37, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !69, templateParams: !24, identifier: "3d305f8aa09ff344e25a3e8e657c6f0")
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !68, file: !2, baseType: !36, size: 64, align: 64, flags: DIFlagPrivate)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "<tracing_core::span::Id as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::span::Id as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !74, vtableHolder: !79, templateParams: !24, identifier: "18a0de637193c970467a8115a0a3f351")
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !73, file: !2, baseType: !6, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !73, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !73, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Id", scope: !80, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !24, identifier: "747070ec511dc8b336002e42221f6223")
!80 = !DINamespace(name: "span", scope: !38)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !79, file: !2, baseType: !13, size: 64, align: 64, flags: DIFlagPrivate)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !86, vtableHolder: !91, templateParams: !24, identifier: "cff74116dd1b0531eb9ac650399ff52a")
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !85, file: !2, baseType: !6, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !85, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!91 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "<&&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !95, vtableHolder: !100, templateParams: !24, identifier: "beb53bd9b67bd3d7c7ef05c22fdfd3ab")
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !94, file: !2, baseType: !6, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !94, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !94, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !94, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !104, vtableHolder: !109, templateParams: !24, identifier: "7f1ab221b4b144a4ae52390ba12cbcf8")
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !103, file: !2, baseType: !6, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !103, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !103, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !110, size: 64, align: 64, dwarfAddressSpace: 0)
!110 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!111 = !{i32 8, !"PIC Level", i32 2}
!112 = !{i32 2, !"RtLibUseGOT", i32 1}
!113 = !{i32 2, !"Dwarf Version", i32 4}
!114 = !{i32 2, !"Debug Info Version", i32 3}
!115 = !{!"rustc version 1.80.0-dev"}
!116 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !117, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !118, globals: !210, splitDebugInlining: false, nameTableKind: None)
!117 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-0.1.40/src/lib.rs/@/tracing.8a1c5b55e1d2bd9c-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-0.1.40")
!118 = !{!36, !119, !128, !136, !204}
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !120, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagEnumClass, elements: !122)
!120 = !DINamespace(name: "atomic", scope: !121)
!121 = !DINamespace(name: "sync", scope: !16)
!122 = !{!123, !124, !125, !126, !127}
!123 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!124 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!125 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!126 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!127 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !129, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagEnumClass, elements: !131)
!129 = !DINamespace(name: "rt", scope: !130)
!130 = !DINamespace(name: "fmt", scope: !16)
!131 = !{!132, !133, !134, !135}
!132 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !137, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagEnumClass, elements: !139)
!137 = !DINamespace(name: "alignment", scope: !138)
!138 = !DINamespace(name: "ptr", scope: !16)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!140 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!196 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!197 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!198 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!199 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!200 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!201 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!202 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!203 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InterestKind", scope: !205, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagEnumClass, elements: !206)
!205 = !DINamespace(name: "subscriber", scope: !38)
!206 = !{!207, !208, !209}
!207 = !DIEnumerator(name: "Never", value: 0, isUnsigned: true)
!208 = !DIEnumerator(name: "Sometimes", value: 1, isUnsigned: true)
!209 = !DIEnumerator(name: "Always", value: 2, isUnsigned: true)
!210 = !{!0, !27, !45, !59, !71, !83, !92, !101}
!211 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h40eba7a03f944241E", scope: !213, file: !212, line: 2385, type: !214, scopeLine: 2385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !269)
!212 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!213 = !DINamespace(name: "{impl#12}", scope: !130)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !234, !235}
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !217, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !218, templateParams: !24, identifier: "d2df09569ea43718984b3f07c77d7786")
!217 = !DINamespace(name: "result", scope: !16)
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_variant_part, scope: !216, file: !2, size: 8, align: 8, elements: !220, templateParams: !24, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !233)
!220 = !{!221, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !219, file: !2, baseType: !222, size: 8, align: 8, extraData: i128 0)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !216, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !223, templateParams: !225, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !222, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!225 = !{!226, !227}
!226 = !DITemplateTypeParameter(name: "T", type: !7)
!227 = !DITemplateTypeParameter(name: "E", type: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !130, file: !2, align: 8, flags: DIFlagPublic, elements: !24, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !219, file: !2, baseType: !230, size: 8, align: 8, extraData: i128 1)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !216, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !231, templateParams: !225, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !230, file: !2, baseType: !228, align: 8, offset: 8, flags: DIFlagPublic)
!233 = !DIDerivedType(tag: DW_TAG_member, scope: !216, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagArtificial)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !130, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !237, templateParams: !24, identifier: "9d9578b0f9368582a2201563ca126cd4")
!237 = !{!238, !239, !241, !242, !257, !258}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !236, file: !2, baseType: !110, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !236, file: !2, baseType: !240, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!240 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !236, file: !2, baseType: !128, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !236, file: !2, baseType: !243, size: 128, align: 64, flags: DIFlagPrivate)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !244, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !245, templateParams: !24, identifier: "3850c4a210aea148b16f79ec227c427")
!244 = !DINamespace(name: "option", scope: !16)
!245 = !{!246}
!246 = !DICompositeType(tag: DW_TAG_variant_part, scope: !243, file: !2, size: 128, align: 64, elements: !247, templateParams: !24, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !256)
!247 = !{!248, !252}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !246, file: !2, baseType: !249, size: 128, align: 64, extraData: i128 0)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !243, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !250, identifier: "10be3845cc366e59d680126f255dea8b")
!250 = !{!251}
!251 = !DITemplateTypeParameter(name: "T", type: !9)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !246, file: !2, baseType: !253, size: 128, align: 64, extraData: i128 1)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !243, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !254, templateParams: !250, identifier: "d166501012b6febc55685f1b3285acb8")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !253, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, scope: !243, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagArtificial)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !236, file: !2, baseType: !243, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !236, file: !2, baseType: !259, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !260, templateParams: !24, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!260 = !{!261, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !259, file: !2, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64, dwarfAddressSpace: 0)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !259, file: !2, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !266, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 6, lowerBound: 0)
!269 = !{!270, !271}
!270 = !DILocalVariable(name: "self", arg: 1, scope: !211, file: !212, line: 2385, type: !234)
!271 = !DILocalVariable(name: "f", arg: 2, scope: !211, file: !212, line: 2385, type: !235)
!272 = !DILocation(line: 0, scope: !211)
!273 = !DILocation(line: 2386, column: 9, scope: !211)
!274 = !DILocation(line: 2387, column: 6, scope: !211)
!275 = distinct !DISubprogram(name: "fmt<u32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h11cfd5dd8dd21841E", scope: !276, file: !212, line: 2354, type: !277, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !283, retainedNodes: !280)
!276 = !DINamespace(name: "{impl#51}", scope: !130)
!277 = !DISubroutineType(types: !278)
!278 = !{!216, !279, !235}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u32", baseType: !109, size: 64, align: 64, dwarfAddressSpace: 0)
!280 = !{!281, !282}
!281 = !DILocalVariable(name: "self", arg: 1, scope: !275, file: !212, line: 2354, type: !279)
!282 = !DILocalVariable(name: "f", arg: 2, scope: !275, file: !212, line: 2354, type: !235)
!283 = !{!284}
!284 = !DITemplateTypeParameter(name: "T", type: !110)
!285 = !DILocation(line: 0, scope: !275)
!286 = !DILocation(line: 2354, column: 71, scope: !275)
!287 = !{i64 4}
!288 = !DILocalVariable(name: "self", arg: 1, scope: !289, file: !290, line: 189, type: !109)
!289 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hf891af710521ab67E", scope: !291, file: !290, line: 189, type: !293, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !295)
!290 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "5d2b54fa2f493740652965deb7ce1e35")
!291 = !DINamespace(name: "{impl#86}", scope: !292)
!292 = !DINamespace(name: "num", scope: !130)
!293 = !DISubroutineType(types: !294)
!294 = !{!216, !109, !235}
!295 = !{!288, !296}
!296 = !DILocalVariable(name: "f", arg: 2, scope: !289, file: !290, line: 189, type: !235)
!297 = !DILocation(line: 0, scope: !289, inlinedAt: !298)
!298 = distinct !DILocation(line: 2354, column: 62, scope: !275)
!299 = !DILocalVariable(name: "self", arg: 1, scope: !300, file: !212, line: 1907, type: !235)
!300 = distinct !DILexicalBlock(scope: !301, file: !212, line: 1907, column: 5)
!301 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h9aa1604b062df0e6E", scope: !236, file: !212, line: 1907, type: !302, scopeLine: 1907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, declaration: !305, retainedNodes: !306)
!302 = !DISubroutineType(types: !303)
!303 = !{!91, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Formatter", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!305 = !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h9aa1604b062df0e6E", scope: !236, file: !212, line: 1907, type: !302, scopeLine: 1907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !24)
!306 = !{!299}
!307 = !DILocation(line: 0, scope: !300, inlinedAt: !308)
!308 = distinct !DILocation(line: 190, column: 22, scope: !289, inlinedAt: !298)
!309 = !DILocalVariable(name: "self", arg: 1, scope: !310, file: !212, line: 1911, type: !235)
!310 = distinct !DILexicalBlock(scope: !311, file: !212, line: 1911, column: 5)
!311 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h0b52a51434de3210E", scope: !236, file: !212, line: 1911, type: !302, scopeLine: 1911, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, declaration: !312, retainedNodes: !313)
!312 = !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h0b52a51434de3210E", scope: !236, file: !212, line: 1911, type: !302, scopeLine: 1911, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !24)
!313 = !{!309}
!314 = !DILocation(line: 0, scope: !310, inlinedAt: !315)
!315 = distinct !DILocation(line: 192, column: 29, scope: !289, inlinedAt: !298)
!316 = !DILocation(line: 1908, column: 9, scope: !300, inlinedAt: !308)
!317 = !{!318}
!318 = distinct !{!318, !319, !"_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hf891af710521ab67E: %f"}
!319 = distinct !{!319, !"_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hf891af710521ab67E"}
!320 = !{!321}
!321 = distinct !{!321, !319, !"_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hf891af710521ab67E: %self"}
!322 = !DILocation(line: 190, column: 20, scope: !289, inlinedAt: !298)
!323 = !DILocation(line: 1912, column: 9, scope: !310, inlinedAt: !315)
!324 = !DILocation(line: 192, column: 27, scope: !289, inlinedAt: !298)
!325 = !DILocation(line: 191, column: 21, scope: !289, inlinedAt: !298)
!326 = !DILocation(line: 195, column: 21, scope: !289, inlinedAt: !298)
!327 = !DILocation(line: 193, column: 21, scope: !289, inlinedAt: !298)
!328 = !DILocation(line: 2354, column: 84, scope: !275)
!329 = distinct !DISubprogram(name: "fmt<tracing_core::metadata::LevelInner>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h36c7385e59dee82aE", scope: !276, file: !212, line: 2354, type: !330, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !336, retainedNodes: !333)
!330 = !DISubroutineType(types: !331)
!331 = !{!216, !332, !235}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&tracing_core::metadata::LevelInner", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!333 = !{!334, !335}
!334 = !DILocalVariable(name: "self", arg: 1, scope: !329, file: !212, line: 2354, type: !332)
!335 = !DILocalVariable(name: "f", arg: 2, scope: !329, file: !212, line: 2354, type: !235)
!336 = !{!337}
!337 = !DITemplateTypeParameter(name: "T", type: !36)
!338 = !DILocation(line: 0, scope: !329)
!339 = !DILocation(line: 2354, column: 71, scope: !329)
!340 = !{i64 8}
!341 = !DILocation(line: 2354, column: 62, scope: !329)
!342 = !{i64 0, i64 5}
!343 = !DILocalVariable(name: "self", arg: 1, scope: !344, file: !345, line: 579, type: !35)
!344 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN71_$LT$tracing_core..metadata..LevelInner$u20$as$u20$core..fmt..Debug$GT$3fmt17h8619e0e2422b3804E", scope: !346, file: !345, line: 579, type: !347, scopeLine: 579, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !349)
!345 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32/src/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "d1af9c854fdc7f5179338ce730e31216")
!346 = !DINamespace(name: "{impl#47}", scope: !37)
!347 = !DISubroutineType(types: !348)
!348 = !{!216, !35, !235}
!349 = !{!343, !350}
!350 = !DILocalVariable(name: "f", arg: 2, scope: !344, file: !345, line: 579, type: !235)
!351 = !DILocation(line: 0, scope: !344, inlinedAt: !352)
!352 = distinct !DILocation(line: 2354, column: 62, scope: !329)
!353 = !DILocation(line: 579, column: 23, scope: !344, inlinedAt: !352)
!354 = !DILocation(line: 2354, column: 84, scope: !329)
!355 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h71a3c0bbad5d61c2E", scope: !276, file: !212, line: 2354, type: !356, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !361, retainedNodes: !358)
!356 = !DISubroutineType(types: !357)
!357 = !{!216, !100, !235}
!358 = !{!359, !360}
!359 = !DILocalVariable(name: "self", arg: 1, scope: !355, file: !212, line: 2354, type: !100)
!360 = !DILocalVariable(name: "f", arg: 2, scope: !355, file: !212, line: 2354, type: !235)
!361 = !{!362}
!362 = !DITemplateTypeParameter(name: "T", type: !57)
!363 = !DILocation(line: 0, scope: !355)
!364 = !DILocation(line: 2354, column: 71, scope: !355)
!365 = !{i64 1}
!366 = !DILocation(line: 2354, column: 62, scope: !355)
!367 = !DILocation(line: 2354, column: 84, scope: !355)
!368 = distinct !DISubprogram(name: "fmt<&str>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7510124a3ea7030dE", scope: !276, file: !212, line: 2354, type: !369, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !375, retainedNodes: !372)
!369 = !DISubroutineType(types: !370)
!370 = !{!216, !371, !235}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&&str", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!372 = !{!373, !374}
!373 = !DILocalVariable(name: "self", arg: 1, scope: !368, file: !212, line: 2354, type: !371)
!374 = !DILocalVariable(name: "f", arg: 2, scope: !368, file: !212, line: 2354, type: !235)
!375 = !{!376}
!376 = !DITemplateTypeParameter(name: "T", type: !53)
!377 = !DILocation(line: 0, scope: !368)
!378 = !DILocation(line: 2354, column: 71, scope: !368)
!379 = !{!380}
!380 = distinct !{!380, !381, !"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h71a3c0bbad5d61c2E: %self"}
!381 = distinct !{!381, !"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h71a3c0bbad5d61c2E"}
!382 = !DILocation(line: 2354, column: 62, scope: !368)
!383 = !DILocation(line: 0, scope: !355, inlinedAt: !384)
!384 = distinct !DILocation(line: 2354, column: 62, scope: !368)
!385 = !DILocation(line: 2354, column: 71, scope: !355, inlinedAt: !384)
!386 = !{!387}
!387 = distinct !{!387, !381, !"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h71a3c0bbad5d61c2E: %f"}
!388 = !DILocation(line: 2354, column: 62, scope: !355, inlinedAt: !384)
!389 = !DILocation(line: 2354, column: 84, scope: !368)
!390 = distinct !DISubprogram(name: "fmt<core::num::nonzero::NonZero<u64>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7945e695e7aee2abE", scope: !276, file: !212, line: 2354, type: !391, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !397, retainedNodes: !394)
!391 = !DISubroutineType(types: !392)
!392 = !{!216, !393, !235}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::num::nonzero::NonZero<u64>", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!394 = !{!395, !396}
!395 = !DILocalVariable(name: "self", arg: 1, scope: !390, file: !212, line: 2354, type: !393)
!396 = !DILocalVariable(name: "f", arg: 2, scope: !390, file: !212, line: 2354, type: !235)
!397 = !{!398}
!398 = !DITemplateTypeParameter(name: "T", type: !13)
!399 = !DILocation(line: 0, scope: !390)
!400 = !DILocation(line: 2354, column: 71, scope: !390)
!401 = !DILocation(line: 2354, column: 62, scope: !390)
!402 = !{i64 1, i64 0}
!403 = !{!404}
!404 = distinct !{!404, !405, !"_ZN73_$LT$core..num..nonzero..NonZero$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17h3a062a15f31a41f3E: %f"}
!405 = distinct !{!405, !"_ZN73_$LT$core..num..nonzero..NonZero$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17h3a062a15f31a41f3E"}
!406 = !DILocalVariable(name: "self", arg: 1, scope: !407, file: !408, line: 126, type: !12)
!407 = distinct !DISubprogram(name: "fmt<u64>", linkageName: "_ZN73_$LT$core..num..nonzero..NonZero$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17h3a062a15f31a41f3E", scope: !409, file: !408, line: 126, type: !410, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !25, retainedNodes: !412)
!408 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/num/nonzero.rs", directory: "", checksumkind: CSK_MD5, checksum: "6ad24e76685b0e114d6ae2b100dfa0a0")
!409 = !DINamespace(name: "{impl#39}", scope: !14)
!410 = !DISubroutineType(types: !411)
!411 = !{!216, !12, !235}
!412 = !{!406, !413}
!413 = !DILocalVariable(name: "f", arg: 2, scope: !407, file: !408, line: 126, type: !235)
!414 = !DILocation(line: 0, scope: !407, inlinedAt: !415)
!415 = distinct !DILocation(line: 2354, column: 62, scope: !390)
!416 = !DILocation(line: 127, column: 17, scope: !407, inlinedAt: !415)
!417 = !DILocalVariable(name: "self", arg: 1, scope: !418, file: !408, line: 434, type: !13)
!418 = distinct !DILexicalBlock(scope: !419, file: !408, line: 434, column: 5)
!419 = distinct !DISubprogram(name: "get<u64>", linkageName: "_ZN4core3num7nonzero16NonZero$LT$T$GT$3get17hbc320d86788f874fE", scope: !13, file: !408, line: 434, type: !420, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !25, declaration: !422, retainedNodes: !423)
!420 = !DISubroutineType(types: !421)
!421 = !{!23, !13}
!422 = !DISubprogram(name: "get<u64>", linkageName: "_ZN4core3num7nonzero16NonZero$LT$T$GT$3get17hbc320d86788f874fE", scope: !13, file: !408, line: 434, type: !420, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !25)
!423 = !{!417}
!424 = !DILocation(line: 0, scope: !418, inlinedAt: !425)
!425 = distinct !DILocation(line: 127, column: 22, scope: !407, inlinedAt: !415)
!426 = !DILocation(line: 447, column: 18, scope: !418, inlinedAt: !425)
!427 = !DILocalVariable(name: "self", arg: 1, scope: !428, file: !290, line: 189, type: !432)
!428 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17hf3b4b1fe0b8575eeE", scope: !429, file: !290, line: 189, type: !430, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !433)
!429 = !DINamespace(name: "{impl#87}", scope: !292)
!430 = !DISubroutineType(types: !431)
!431 = !{!216, !432, !235}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!433 = !{!427, !434}
!434 = !DILocalVariable(name: "f", arg: 2, scope: !428, file: !290, line: 189, type: !235)
!435 = !DILocation(line: 0, scope: !428, inlinedAt: !436)
!436 = distinct !DILocation(line: 127, column: 17, scope: !407, inlinedAt: !415)
!437 = !DILocalVariable(name: "self", arg: 1, scope: !438, file: !212, line: 1907, type: !235)
!438 = distinct !DILexicalBlock(scope: !439, file: !212, line: 1907, column: 5)
!439 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h9aa1604b062df0e6E", scope: !236, file: !212, line: 1907, type: !302, scopeLine: 1907, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, declaration: !305, retainedNodes: !440)
!440 = !{!437}
!441 = !DILocation(line: 0, scope: !438, inlinedAt: !442)
!442 = distinct !DILocation(line: 190, column: 22, scope: !428, inlinedAt: !436)
!443 = !DILocalVariable(name: "self", arg: 1, scope: !444, file: !212, line: 1911, type: !235)
!444 = distinct !DILexicalBlock(scope: !445, file: !212, line: 1911, column: 5)
!445 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h0b52a51434de3210E", scope: !236, file: !212, line: 1911, type: !302, scopeLine: 1911, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, declaration: !312, retainedNodes: !446)
!446 = !{!443}
!447 = !DILocation(line: 0, scope: !444, inlinedAt: !448)
!448 = distinct !DILocation(line: 192, column: 29, scope: !428, inlinedAt: !436)
!449 = !DILocation(line: 1908, column: 9, scope: !438, inlinedAt: !442)
!450 = !{!451, !404}
!451 = distinct !{!451, !452, !"_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17hf3b4b1fe0b8575eeE: %f"}
!452 = distinct !{!452, !"_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17hf3b4b1fe0b8575eeE"}
!453 = !{!454}
!454 = distinct !{!454, !452, !"_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u64$GT$3fmt17hf3b4b1fe0b8575eeE: %self"}
!455 = !DILocation(line: 190, column: 20, scope: !428, inlinedAt: !436)
!456 = !DILocation(line: 1912, column: 9, scope: !444, inlinedAt: !448)
!457 = !DILocation(line: 192, column: 27, scope: !428, inlinedAt: !436)
!458 = !DILocation(line: 191, column: 21, scope: !428, inlinedAt: !436)
!459 = !DILocation(line: 195, column: 21, scope: !428, inlinedAt: !436)
!460 = !DILocation(line: 193, column: 21, scope: !428, inlinedAt: !436)
!461 = !DILocation(line: 128, column: 13, scope: !407, inlinedAt: !415)
!462 = !DILocation(line: 2354, column: 84, scope: !390)
!463 = distinct !DISubprogram(name: "fmt<tracing_core::metadata::Level>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hbb5b0ea3c55244f4E", scope: !276, file: !212, line: 2354, type: !464, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !470, retainedNodes: !467)
!464 = !DISubroutineType(types: !465)
!465 = !{!216, !466, !235}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&tracing_core::metadata::Level", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!467 = !{!468, !469}
!468 = !DILocalVariable(name: "self", arg: 1, scope: !463, file: !212, line: 2354, type: !466)
!469 = !DILocalVariable(name: "f", arg: 2, scope: !463, file: !212, line: 2354, type: !235)
!470 = !{!471}
!471 = !DITemplateTypeParameter(name: "T", type: !68)
!472 = !DILocation(line: 0, scope: !463)
!473 = !DILocation(line: 2354, column: 71, scope: !463)
!474 = !DILocalVariable(name: "self", arg: 1, scope: !475, file: !345, line: 220, type: !67)
!475 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN66_$LT$tracing_core..metadata..Level$u20$as$u20$core..fmt..Debug$GT$3fmt17h7203b2f48f3fdec3E", scope: !476, file: !345, line: 220, type: !477, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !479)
!476 = !DINamespace(name: "{impl#32}", scope: !37)
!477 = !DISubroutineType(types: !478)
!478 = !{!216, !67, !235}
!479 = !{!474, !480}
!480 = !DILocalVariable(name: "f", arg: 2, scope: !475, file: !345, line: 220, type: !235)
!481 = !DILocation(line: 0, scope: !475, inlinedAt: !482)
!482 = distinct !DILocation(line: 2354, column: 62, scope: !463)
!483 = !DILocation(line: 221, column: 18, scope: !475, inlinedAt: !482)
!484 = !{!485, !487}
!485 = distinct !{!485, !486, !"_ZN66_$LT$tracing_core..metadata..Level$u20$as$u20$core..fmt..Debug$GT$3fmt17h7203b2f48f3fdec3E: %self"}
!486 = distinct !{!486, !"_ZN66_$LT$tracing_core..metadata..Level$u20$as$u20$core..fmt..Debug$GT$3fmt17h7203b2f48f3fdec3E"}
!487 = distinct !{!487, !486, !"_ZN66_$LT$tracing_core..metadata..Level$u20$as$u20$core..fmt..Debug$GT$3fmt17h7203b2f48f3fdec3E: %f"}
!488 = !DILocation(line: 220, column: 23, scope: !475, inlinedAt: !482)
!489 = !DILocation(line: 220, column: 27, scope: !475, inlinedAt: !482)
!490 = !DILocation(line: 2354, column: 84, scope: !463)
!491 = distinct !DISubprogram(name: "drop_in_place<tracing::span::Span>", linkageName: "_ZN4core3ptr40drop_in_place$LT$tracing..span..Span$GT$17h47c79a7196b31a47E", scope: !138, file: !492, line: 542, type: !493, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !657, retainedNodes: !655)
!492 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "a85d519116fde26821981e2ebfa0ecba")
!493 = !DISubroutineType(types: !494)
!494 = !{null, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut tracing::span::Span", baseType: !496, size: 64, align: 64, dwarfAddressSpace: 0)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Span", scope: !497, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !499, templateParams: !24, identifier: "aa1ae4df75c54ee0cacdf4cb54262788")
!497 = !DINamespace(name: "span", scope: !498)
!498 = !DINamespace(name: "tracing", scope: null)
!499 = !{!500, !585}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !496, file: !2, baseType: !501, size: 256, align: 64, flags: DIFlagPrivate)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<tracing::span::Inner>", scope: !244, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !502, templateParams: !24, identifier: "e1b971ca34a26e525ff2821529999320")
!502 = !{!503}
!503 = !DICompositeType(tag: DW_TAG_variant_part, scope: !501, file: !2, size: 256, align: 64, elements: !504, templateParams: !24, identifier: "403dd481c295ade255c2fa9523bcf672", discriminator: !584)
!504 = !{!505, !580}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !503, file: !2, baseType: !506, size: 256, align: 64, extraData: i128 2)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !501, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !507, identifier: "3c19a37d0757c0319ad2324ad5674bed")
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "T", type: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !497, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !510, templateParams: !24, identifier: "94908639363bef2cbe0fc9130dcf9404")
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !509, file: !2, baseType: !79, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "subscriber", scope: !509, file: !2, baseType: !513, size: 192, align: 64, flags: DIFlagPrivate)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dispatch", scope: !514, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !515, templateParams: !24, identifier: "f513359f5f96301a76fe25b76bf4d8e4")
!514 = !DINamespace(name: "dispatcher", scope: !38)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "subscriber", scope: !513, file: !2, baseType: !517, size: 192, align: 64, flags: DIFlagPrivate)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Kind<alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !514, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !518, templateParams: !24, identifier: "7cb32a7a4cf61c40753f9af8eda9fd69")
!518 = !{!519}
!519 = !DICompositeType(tag: DW_TAG_variant_part, scope: !517, file: !2, size: 192, align: 64, elements: !520, templateParams: !24, identifier: "a49141d706bc8ab32715280cd56a9598", discriminator: !579)
!520 = !{!521, !575}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Global", scope: !519, file: !2, baseType: !522, size: 192, align: 64, extraData: i128 0)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !517, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !523, templateParams: !535, identifier: "21ab0d80e171cf9d3720901adec4027f")
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !522, file: !2, baseType: !525, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !526, templateParams: !24, identifier: "16fab107c0a541436ee8c6ecf7042812")
!526 = !{!527, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !525, file: !2, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64, dwarfAddressSpace: 0)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !24, identifier: "ce8e0bac22c4feba408114ee1b241eda")
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !525, file: !2, baseType: !531, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 19]", baseType: !532, size: 64, align: 64, dwarfAddressSpace: 0)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1216, align: 64, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 19, lowerBound: 0)
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !538, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !540, templateParams: !573, identifier: "165c8fc35a08543ceefbd4746397f59c")
!538 = !DINamespace(name: "sync", scope: !539)
!539 = !DINamespace(name: "alloc", scope: null)
!540 = !{!541, !567, !570}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !537, file: !2, baseType: !542, size: 128, align: 64, flags: DIFlagPrivate)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", scope: !543, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !544, templateParams: !565, identifier: "13db5b897d334de180996f5308efd323")
!543 = !DINamespace(name: "non_null", scope: !138)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !542, file: !2, baseType: !546, size: 128, align: 64, flags: DIFlagPrivate)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>", file: !2, size: 128, align: 64, elements: !547, templateParams: !24, identifier: "9ddad5a4adbe4401f27fb0dfa99cc3a")
!547 = !{!548, !564}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !546, file: !2, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>", scope: !538, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !551, templateParams: !562, identifier: "6b5c7714fa91098da5f1add0cecda23")
!551 = !{!552, !560, !561}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !550, file: !2, baseType: !553, size: 64, align: 64, flags: DIFlagPrivate)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !120, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !554, templateParams: !24, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !553, file: !2, baseType: !556, size: 64, align: 64, flags: DIFlagPrivate)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !557, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !558, templateParams: !250, identifier: "739795389d327d6873469e3d89b8c60e")
!557 = !DINamespace(name: "cell", scope: !16)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !556, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !550, file: !2, baseType: !553, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !2, baseType: !529, align: 8, offset: 128, flags: DIFlagPrivate)
!562 = !{!563}
!563 = !DITemplateTypeParameter(name: "T", type: !529)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !546, file: !2, baseType: !531, size: 64, align: 64, offset: 64)
!565 = !{!566}
!566 = !DITemplateTypeParameter(name: "T", type: !550)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !537, file: !2, baseType: !568, align: 8, offset: 128, flags: DIFlagPrivate)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", scope: !569, file: !2, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !565, identifier: "682416ecbb2b71b69b8fc69936e2cb56")
!569 = !DINamespace(name: "marker", scope: !16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !537, file: !2, baseType: !571, align: 8, offset: 128, flags: DIFlagPrivate)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !572, file: !2, align: 8, flags: DIFlagPublic, elements: !24, identifier: "14de19725ec4b1fd38fae074afd4da08")
!572 = !DINamespace(name: "alloc", scope: !539)
!573 = !{!563, !574}
!574 = !DITemplateTypeParameter(name: "A", type: !571)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "Scoped", scope: !519, file: !2, baseType: !576, size: 192, align: 64, extraData: i128 1)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scoped", scope: !517, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !577, templateParams: !535, identifier: "aa95d937bbfe68d1ad746d2f9081a7e")
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !576, file: !2, baseType: !537, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!579 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagArtificial)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !503, file: !2, baseType: !581, size: 256, align: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !501, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !582, templateParams: !507, identifier: "e0aa69c1c456079f2fdb2e15379d81be")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !581, file: !2, baseType: !509, size: 256, align: 64, flags: DIFlagPublic)
!584 = !DIDerivedType(tag: DW_TAG_member, scope: !501, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagArtificial)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "meta", scope: !496, file: !2, baseType: !586, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&tracing_core::metadata::Metadata>", scope: !244, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !587, templateParams: !24, identifier: "81a1ee220b23247d38e7c215ff5796eb")
!587 = !{!588}
!588 = !DICompositeType(tag: DW_TAG_variant_part, scope: !586, file: !2, size: 64, align: 64, elements: !589, templateParams: !24, identifier: "be4c847ce0c66495a8b1105341889a5b", discriminator: !654)
!589 = !{!590, !650}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !588, file: !2, baseType: !591, size: 64, align: 64, extraData: i128 0)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !586, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !592, identifier: "159a853285ddedad307b415a1a5bc800")
!592 = !{!593}
!593 = !DITemplateTypeParameter(name: "T", type: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::metadata::Metadata", baseType: !595, size: 64, align: 64, dwarfAddressSpace: 0)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Metadata", scope: !37, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !596, templateParams: !24, identifier: "3b84479356cedceecb2a6e9a052a0bb")
!596 = !{!597, !598, !599, !600, !612, !613, !625, !646}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !595, file: !2, baseType: !53, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !595, file: !2, baseType: !53, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !595, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagPrivate)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "module_path", scope: !595, file: !2, baseType: !601, size: 128, align: 64, offset: 640, flags: DIFlagPrivate)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !244, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !602, templateParams: !24, identifier: "c9cc8e2c9bc8d3061e54de437c9b5882")
!602 = !{!603}
!603 = !DICompositeType(tag: DW_TAG_variant_part, scope: !601, file: !2, size: 128, align: 64, elements: !604, templateParams: !24, identifier: "dc91c89dee9d03b772ff0b7d0b60a9cb", discriminator: !611)
!604 = !{!605, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !603, file: !2, baseType: !606, size: 128, align: 64, extraData: i128 0)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !601, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !375, identifier: "20871c480156d021cbbc4b2eec20a35c")
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !603, file: !2, baseType: !608, size: 128, align: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !601, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !609, templateParams: !375, identifier: "2bd48e68865dce7a72b4a9887ea344e7")
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !608, file: !2, baseType: !53, size: 128, align: 64, flags: DIFlagPublic)
!611 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagArtificial)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !595, file: !2, baseType: !601, size: 128, align: 64, offset: 768, flags: DIFlagPrivate)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !595, file: !2, baseType: !614, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u32>", scope: !244, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !615, templateParams: !24, identifier: "ebe2cffeee76dada7a14f25e4750045b")
!615 = !{!616}
!616 = !DICompositeType(tag: DW_TAG_variant_part, scope: !614, file: !2, size: 64, align: 32, elements: !617, templateParams: !24, identifier: "3a58987d801709f0f7fa9f7e54d1fd1d", discriminator: !624)
!617 = !{!618, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !616, file: !2, baseType: !619, size: 64, align: 32, extraData: i128 0)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !614, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !24, templateParams: !283, identifier: "e28adf562df1b32c687fa9358c66829a")
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !616, file: !2, baseType: !621, size: 64, align: 32, extraData: i128 1)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !614, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !622, templateParams: !283, identifier: "f83975a5848a2c13d4de936bd3cabeef")
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !621, file: !2, baseType: !110, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !614, file: !2, baseType: !110, size: 32, align: 32, flags: DIFlagArtificial)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !595, file: !2, baseType: !626, size: 256, align: 64, offset: 384, flags: DIFlagPrivate)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldSet", scope: !627, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !628, templateParams: !24, identifier: "642257ca0ce4840b22f807882fb913e5")
!627 = !DINamespace(name: "field", scope: !38)
!628 = !{!629, !635}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !626, file: !2, baseType: !630, size: 128, align: 64, flags: DIFlagPrivate)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !631, templateParams: !24, identifier: "4e66b00a376d6af5b8765440fb2839f")
!631 = !{!632, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !630, file: !2, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !630, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "callsite", scope: !626, file: !2, baseType: !636, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Identifier", scope: !637, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !638, templateParams: !24, identifier: "694a2c46ec2152c644a6ea782ce3d0c9")
!637 = !DINamespace(name: "callsite", scope: !38)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !636, file: !2, baseType: !640, size: 128, align: 64, flags: DIFlagPublic)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "&dyn tracing_core::callsite::Callsite", file: !2, size: 128, align: 64, elements: !641, templateParams: !24, identifier: "df1a176f56d6ca7c28bcf92f700ee32a")
!641 = !{!642, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !640, file: !2, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64, dwarfAddressSpace: 0)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn tracing_core::callsite::Callsite", file: !2, align: 8, elements: !24, identifier: "5c748cc422d45a5e574d89abc4ee022")
!645 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !640, file: !2, baseType: !265, size: 64, align: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !595, file: !2, baseType: !647, size: 8, align: 8, offset: 896, flags: DIFlagPrivate)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "Kind", scope: !37, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !648, templateParams: !24, identifier: "4cc597743dd29f5ff357f7fb040d40ab")
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !647, file: !2, baseType: !57, size: 8, align: 8, flags: DIFlagPrivate)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !588, file: !2, baseType: !651, size: 64, align: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !586, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !652, templateParams: !592, identifier: "b9052824f1cc6e87c17d5b6d70598857")
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !651, file: !2, baseType: !594, size: 64, align: 64, flags: DIFlagPublic)
!654 = !DIDerivedType(tag: DW_TAG_member, scope: !586, file: !2, baseType: !23, size: 64, align: 64, flags: DIFlagArtificial)
!655 = !{!656}
!656 = !DILocalVariable(arg: 1, scope: !491, file: !492, line: 542, type: !495)
!657 = !{!658}
!658 = !DITemplateTypeParameter(name: "T", type: !496)
!659 = !DILocation(line: 0, scope: !491)
!660 = !DILocalVariable(name: "self", arg: 1, scope: !661, file: !662, line: 1457, type: !666)
!661 = distinct !DISubprogram(name: "drop", linkageName: "_ZN61_$LT$tracing..span..Span$u20$as$u20$core..ops..drop..Drop$GT$4drop17h79a747c7f385e531E", scope: !663, file: !662, line: 1457, type: !664, scopeLine: 1457, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !667)
!662 = !DIFile(filename: "src/span.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-0.1.40", checksumkind: CSK_MD5, checksum: "36b173768066d898131844f4dbe718c0")
!663 = !DINamespace(name: "{impl#9}", scope: !497)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut tracing::span::Span", baseType: !496, size: 64, align: 64, dwarfAddressSpace: 0)
!667 = !{!660, !668, !671}
!668 = !DILocalVariable(name: "id", scope: !669, file: !662, line: 1459, type: !670, align: 8)
!669 = distinct !DILexicalBlock(scope: !661, file: !662, line: 1462, column: 9)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::span::Id", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!671 = !DILocalVariable(name: "subscriber", scope: !669, file: !662, line: 1460, type: !672, align: 8)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::dispatcher::Dispatch", baseType: !513, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DILocation(line: 0, scope: !661, inlinedAt: !674)
!674 = distinct !DILocation(line: 542, column: 1, scope: !491)
!675 = !DILocation(line: 1458, column: 16, scope: !669, inlinedAt: !674)
!676 = !{i64 0, i64 3}
!677 = !DILocation(line: 0, scope: !669, inlinedAt: !674)
!678 = !DILocalVariable(name: "self", arg: 1, scope: !679, file: !680, line: 15, type: !670)
!679 = distinct !DILexicalBlock(scope: !681, file: !680, line: 15, column: 10)
!680 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32/src/span.rs", directory: "", checksumkind: CSK_MD5, checksum: "2dedf5da54da6a00065d1e911ab65f60")
!681 = distinct !DISubprogram(name: "clone", linkageName: "_ZN61_$LT$tracing_core..span..Id$u20$as$u20$core..clone..Clone$GT$5clone17h5e223a06f4921736E", scope: !682, file: !680, line: 15, type: !683, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !685)
!682 = !DINamespace(name: "{impl#9}", scope: !80)
!683 = !DISubroutineType(types: !684)
!684 = !{!79, !670}
!685 = !{!678}
!686 = !DILocation(line: 0, scope: !679, inlinedAt: !687)
!687 = distinct !DILocation(line: 1463, column: 37, scope: !669, inlinedAt: !674)
!688 = !DILocalVariable(name: "self", arg: 1, scope: !689, file: !408, line: 166, type: !12)
!689 = distinct !DILexicalBlock(scope: !690, file: !408, line: 166, column: 5)
!690 = distinct !DISubprogram(name: "clone<u64>", linkageName: "_ZN75_$LT$core..num..nonzero..NonZero$LT$T$GT$$u20$as$u20$core..clone..Clone$GT$5clone17heffdaa7f954382e9E", scope: !691, file: !408, line: 166, type: !692, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !25, retainedNodes: !694)
!691 = !DINamespace(name: "{impl#0}", scope: !14)
!692 = !DISubroutineType(types: !693)
!693 = !{!13, !12}
!694 = !{!688}
!695 = !DILocation(line: 0, scope: !689, inlinedAt: !696)
!696 = distinct !DILocation(line: 16, column: 15, scope: !679, inlinedAt: !687)
!697 = !DILocation(line: 167, column: 14, scope: !689, inlinedAt: !696)
!698 = !{!699}
!699 = distinct !{!699, !700, !"_ZN61_$LT$tracing..span..Span$u20$as$u20$core..ops..drop..Drop$GT$4drop17h79a747c7f385e531E: %self"}
!700 = distinct !{!700, !"_ZN61_$LT$tracing..span..Span$u20$as$u20$core..ops..drop..Drop$GT$4drop17h79a747c7f385e531E"}
!701 = !DILocation(line: 1463, column: 13, scope: !669, inlinedAt: !674)
!702 = !DILocation(line: 542, column: 1, scope: !491)
!703 = !{!704}
!704 = distinct !{!704, !705, !"_ZN4core3ptr69drop_in_place$LT$core..option..Option$LT$tracing..span..Inner$GT$$GT$17h1db1e8740abf1046E: %_1"}
!705 = distinct !{!705, !"_ZN4core3ptr69drop_in_place$LT$core..option..Option$LT$tracing..span..Inner$GT$$GT$17h1db1e8740abf1046E"}
!706 = !DILocalVariable(arg: 1, scope: !707, file: !492, line: 542, type: !710)
!707 = distinct !DISubprogram(name: "drop_in_place<core::option::Option<tracing::span::Inner>>", linkageName: "_ZN4core3ptr69drop_in_place$LT$core..option..Option$LT$tracing..span..Inner$GT$$GT$17h1db1e8740abf1046E", scope: !138, file: !492, line: 542, type: !708, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !712, retainedNodes: !711)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::option::Option<tracing::span::Inner>", baseType: !501, size: 64, align: 64, dwarfAddressSpace: 0)
!711 = !{!706}
!712 = !{!713}
!713 = !DITemplateTypeParameter(name: "T", type: !501)
!714 = !DILocation(line: 0, scope: !707, inlinedAt: !715)
!715 = distinct !DILocation(line: 542, column: 1, scope: !491)
!716 = !{!717}
!717 = distinct !{!717, !718, !"_ZN4core3ptr41drop_in_place$LT$tracing..span..Inner$GT$17h9016837035fc36cdE: %_1"}
!718 = distinct !{!718, !"_ZN4core3ptr41drop_in_place$LT$tracing..span..Inner$GT$17h9016837035fc36cdE"}
!719 = !DILocation(line: 542, column: 1, scope: !707, inlinedAt: !715)
!720 = !DILocalVariable(arg: 1, scope: !721, file: !492, line: 542, type: !724)
!721 = distinct !DISubprogram(name: "drop_in_place<tracing::span::Inner>", linkageName: "_ZN4core3ptr41drop_in_place$LT$tracing..span..Inner$GT$17h9016837035fc36cdE", scope: !138, file: !492, line: 542, type: !722, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !507, retainedNodes: !725)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut tracing::span::Inner", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!725 = !{!720}
!726 = !DILocation(line: 0, scope: !721, inlinedAt: !727)
!727 = distinct !DILocation(line: 542, column: 1, scope: !707, inlinedAt: !715)
!728 = !{!729}
!729 = distinct !{!729, !730, !"_ZN4core3ptr55drop_in_place$LT$tracing_core..dispatcher..Dispatch$GT$17h7c6d9b43d7ecd45fE: %_1"}
!730 = distinct !{!730, !"_ZN4core3ptr55drop_in_place$LT$tracing_core..dispatcher..Dispatch$GT$17h7c6d9b43d7ecd45fE"}
!731 = !DILocation(line: 542, column: 1, scope: !721, inlinedAt: !727)
!732 = !DILocalVariable(arg: 1, scope: !733, file: !492, line: 542, type: !736)
!733 = distinct !DISubprogram(name: "drop_in_place<tracing_core::dispatcher::Dispatch>", linkageName: "_ZN4core3ptr55drop_in_place$LT$tracing_core..dispatcher..Dispatch$GT$17h7c6d9b43d7ecd45fE", scope: !138, file: !492, line: 542, type: !734, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !738, retainedNodes: !737)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut tracing_core::dispatcher::Dispatch", baseType: !513, size: 64, align: 64, dwarfAddressSpace: 0)
!737 = !{!732}
!738 = !{!739}
!739 = !DITemplateTypeParameter(name: "T", type: !513)
!740 = !DILocation(line: 0, scope: !733, inlinedAt: !741)
!741 = distinct !DILocation(line: 542, column: 1, scope: !721, inlinedAt: !727)
!742 = !{!743}
!743 = distinct !{!743, !744, !"_ZN4core3ptr173drop_in_place$LT$tracing_core..dispatcher..Kind$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$$GT$17h86cbf24f5334265dE: %_1"}
!744 = distinct !{!744, !"_ZN4core3ptr173drop_in_place$LT$tracing_core..dispatcher..Kind$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$$GT$17h86cbf24f5334265dE"}
!745 = !DILocation(line: 542, column: 1, scope: !733, inlinedAt: !741)
!746 = !DILocalVariable(arg: 1, scope: !747, file: !492, line: 542, type: !750)
!747 = distinct !DISubprogram(name: "drop_in_place<tracing_core::dispatcher::Kind<alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>>", linkageName: "_ZN4core3ptr173drop_in_place$LT$tracing_core..dispatcher..Kind$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$$GT$17h86cbf24f5334265dE", scope: !138, file: !492, line: 542, type: !748, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !752, retainedNodes: !751)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut tracing_core::dispatcher::Kind<alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", baseType: !517, size: 64, align: 64, dwarfAddressSpace: 0)
!751 = !{!746}
!752 = !{!753}
!753 = !DITemplateTypeParameter(name: "T", type: !517)
!754 = !DILocation(line: 0, scope: !747, inlinedAt: !755)
!755 = distinct !DILocation(line: 542, column: 1, scope: !733, inlinedAt: !741)
!756 = !DILocation(line: 542, column: 1, scope: !747, inlinedAt: !755)
!757 = !{!758}
!758 = distinct !{!758, !759, !"_ZN4core3ptr135drop_in_place$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$17h15b29c79217a9dc5E: %_1"}
!759 = distinct !{!759, !"_ZN4core3ptr135drop_in_place$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$17h15b29c79217a9dc5E"}
!760 = !DILocalVariable(arg: 1, scope: !761, file: !492, line: 542, type: !764)
!761 = distinct !DISubprogram(name: "drop_in_place<alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", linkageName: "_ZN4core3ptr135drop_in_place$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$17h15b29c79217a9dc5E", scope: !138, file: !492, line: 542, type: !762, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !535, retainedNodes: !765)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!765 = !{!760}
!766 = !DILocation(line: 0, scope: !761, inlinedAt: !767)
!767 = distinct !DILocation(line: 542, column: 1, scope: !747, inlinedAt: !755)
!768 = !{!769}
!769 = distinct !{!769, !770, !"_ZN71_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h60f00d373ed34912E: %self"}
!770 = distinct !{!770, !"_ZN71_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h60f00d373ed34912E"}
!771 = !DILocation(line: 542, column: 1, scope: !761, inlinedAt: !767)
!772 = !DILocalVariable(name: "val", scope: !773, file: !774, line: 2686, type: !9, align: 8)
!773 = distinct !DILexicalBlock(scope: !775, file: !774, line: 2686, column: 13)
!774 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "3974e4024eb8e2ba36045270da58dc5a")
!775 = distinct !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17h83dbbb1e9ac08f15E", scope: !553, file: !774, line: 2686, type: !776, scopeLine: 2686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, declaration: !779, retainedNodes: !780)
!776 = !DISubroutineType(types: !777)
!777 = !{!9, !778, !9, !119}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicUsize", baseType: !553, size: 64, align: 64, dwarfAddressSpace: 0)
!779 = !DISubprogram(name: "fetch_sub", linkageName: "_ZN4core4sync6atomic11AtomicUsize9fetch_sub17h83dbbb1e9ac08f15E", scope: !553, file: !774, line: 2686, type: !776, scopeLine: 2686, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !24)
!780 = !{!781, !772, !782}
!781 = !DILocalVariable(name: "self", arg: 1, scope: !773, file: !774, line: 2686, type: !778)
!782 = !DILocalVariable(name: "order", scope: !773, file: !774, line: 2686, type: !119, align: 1)
!783 = !DILocation(line: 0, scope: !773, inlinedAt: !784)
!784 = distinct !DILocation(line: 2463, column: 32, scope: !785, inlinedAt: !793)
!785 = distinct !DISubprogram(name: "drop<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN71_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h60f00d373ed34912E", scope: !787, file: !786, line: 2459, type: !788, scopeLine: 2459, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !573, retainedNodes: !791)
!786 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/alloc/src/sync.rs", directory: "", checksumkind: CSK_MD5, checksum: "d97152ce06873160e4001a6951abf5fd")
!787 = !DINamespace(name: "{impl#35}", scope: !538)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!791 = !{!792}
!792 = !DILocalVariable(name: "self", arg: 1, scope: !785, file: !786, line: 2459, type: !790)
!793 = distinct !DILocation(line: 542, column: 1, scope: !761, inlinedAt: !767)
!794 = !DILocalVariable(name: "val", scope: !795, file: !774, line: 3344, type: !9, align: 8)
!795 = distinct !DILexicalBlock(scope: !796, file: !774, line: 3344, column: 1)
!796 = distinct !DISubprogram(name: "atomic_sub<usize>", linkageName: "_ZN4core4sync6atomic10atomic_sub17hf64b8cbcfdfbe2e2E", scope: !120, file: !774, line: 3344, type: !797, scopeLine: 3344, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !250, retainedNodes: !800)
!797 = !DISubroutineType(types: !798)
!798 = !{!9, !799, !9, !119}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!800 = !{!801, !794, !802}
!801 = !DILocalVariable(name: "dst", arg: 1, scope: !795, file: !774, line: 3344, type: !799)
!802 = !DILocalVariable(name: "order", scope: !795, file: !774, line: 3344, type: !119, align: 1)
!803 = !DILocation(line: 0, scope: !795, inlinedAt: !804)
!804 = distinct !DILocation(line: 2688, column: 26, scope: !773, inlinedAt: !784)
!805 = !DILocalVariable(name: "order", scope: !806, file: !774, line: 3637, type: !119, align: 1)
!806 = distinct !DILexicalBlock(scope: !807, file: !774, line: 3637, column: 1)
!807 = distinct !DISubprogram(name: "fence", linkageName: "_ZN4core4sync6atomic5fence17h8c0e8cfbe12bcb90E", scope: !120, file: !774, line: 3637, type: !808, scopeLine: 3637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !119}
!810 = !{!805}
!811 = !DILocation(line: 0, scope: !806, inlinedAt: !812)
!812 = distinct !DILocation(line: 64, column: 9, scope: !785, inlinedAt: !793)
!813 = !DILocation(line: 0, scope: !785, inlinedAt: !793)
!814 = !DILocalVariable(name: "self", arg: 1, scope: !815, file: !786, line: 1824, type: !790)
!815 = distinct !DILexicalBlock(scope: !816, file: !786, line: 1824, column: 5)
!816 = distinct !DISubprogram(name: "inner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN5alloc4sync16Arc$LT$T$C$A$GT$5inner17h9b3ae3d999e87b4fE", scope: !537, file: !786, line: 1824, type: !817, scopeLine: 1824, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !573, declaration: !824, retainedNodes: !825)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !823}
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "&alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>", file: !2, size: 128, align: 64, elements: !820, templateParams: !24, identifier: "98465e3b331482d75c3ce485ba8ab439")
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !819, file: !2, baseType: !549, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !819, file: !2, baseType: !531, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!824 = !DISubprogram(name: "inner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN5alloc4sync16Arc$LT$T$C$A$GT$5inner17h9b3ae3d999e87b4fE", scope: !537, file: !786, line: 1824, type: !817, scopeLine: 1824, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !573)
!825 = !{!814}
!826 = !DILocation(line: 0, scope: !815, inlinedAt: !827)
!827 = distinct !DILocation(line: 2463, column: 17, scope: !785, inlinedAt: !793)
!828 = !DILocalVariable(name: "self", arg: 1, scope: !829, file: !830, line: 398, type: !834)
!829 = distinct !DILexicalBlock(scope: !831, file: !830, line: 398, column: 5)
!830 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "19d9838ed489cc493bac2e425215a13e")
!831 = distinct !DISubprogram(name: "as_ref<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ref17hc806e0953d361304E", scope: !542, file: !830, line: 398, type: !832, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !565, declaration: !835, retainedNodes: !836)
!832 = !DISubroutineType(types: !833)
!833 = !{!819, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ptr::non_null::NonNull<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", baseType: !542, size: 64, align: 64, dwarfAddressSpace: 0)
!835 = !DISubprogram(name: "as_ref<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ref17hc806e0953d361304E", scope: !542, file: !830, line: 398, type: !832, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !565)
!836 = !{!828}
!837 = !DILocation(line: 0, scope: !829, inlinedAt: !838)
!838 = distinct !DILocation(line: 1830, column: 27, scope: !815, inlinedAt: !827)
!839 = !DILocation(line: 402, column: 20, scope: !829, inlinedAt: !838)
!840 = !{!769, !758, !743, !729, !717, !704}
!841 = !DILocation(line: 3350, column: 24, scope: !795, inlinedAt: !804)
!842 = !DILocation(line: 2463, column: 12, scope: !785, inlinedAt: !793)
!843 = !DILocation(line: 3641, column: 24, scope: !806, inlinedAt: !812)
!844 = !DILocation(line: 2506, column: 13, scope: !785, inlinedAt: !793)
!845 = !DILocation(line: 0, scope: !707)
!846 = !DILocation(line: 542, column: 1, scope: !707)
!847 = !{!848}
!848 = distinct !{!848, !849, !"_ZN4core3ptr41drop_in_place$LT$tracing..span..Inner$GT$17h9016837035fc36cdE: %_1"}
!849 = distinct !{!849, !"_ZN4core3ptr41drop_in_place$LT$tracing..span..Inner$GT$17h9016837035fc36cdE"}
!850 = !DILocation(line: 0, scope: !721, inlinedAt: !851)
!851 = distinct !DILocation(line: 542, column: 1, scope: !707)
!852 = !{!853}
!853 = distinct !{!853, !854, !"_ZN4core3ptr55drop_in_place$LT$tracing_core..dispatcher..Dispatch$GT$17h7c6d9b43d7ecd45fE: %_1"}
!854 = distinct !{!854, !"_ZN4core3ptr55drop_in_place$LT$tracing_core..dispatcher..Dispatch$GT$17h7c6d9b43d7ecd45fE"}
!855 = !DILocation(line: 542, column: 1, scope: !721, inlinedAt: !851)
!856 = !DILocation(line: 0, scope: !733, inlinedAt: !857)
!857 = distinct !DILocation(line: 542, column: 1, scope: !721, inlinedAt: !851)
!858 = !{!859}
!859 = distinct !{!859, !860, !"_ZN4core3ptr173drop_in_place$LT$tracing_core..dispatcher..Kind$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$$GT$17h86cbf24f5334265dE: %_1"}
!860 = distinct !{!860, !"_ZN4core3ptr173drop_in_place$LT$tracing_core..dispatcher..Kind$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$$GT$17h86cbf24f5334265dE"}
!861 = !DILocation(line: 542, column: 1, scope: !733, inlinedAt: !857)
!862 = !DILocation(line: 0, scope: !747, inlinedAt: !863)
!863 = distinct !DILocation(line: 542, column: 1, scope: !733, inlinedAt: !857)
!864 = !DILocation(line: 542, column: 1, scope: !747, inlinedAt: !863)
!865 = !{!866}
!866 = distinct !{!866, !867, !"_ZN4core3ptr135drop_in_place$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$17h15b29c79217a9dc5E: %_1"}
!867 = distinct !{!867, !"_ZN4core3ptr135drop_in_place$LT$alloc..sync..Arc$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$GT$17h15b29c79217a9dc5E"}
!868 = !DILocation(line: 0, scope: !761, inlinedAt: !869)
!869 = distinct !DILocation(line: 542, column: 1, scope: !747, inlinedAt: !863)
!870 = !{!871}
!871 = distinct !{!871, !872, !"_ZN71_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h60f00d373ed34912E: %self"}
!872 = distinct !{!872, !"_ZN71_$LT$alloc..sync..Arc$LT$T$C$A$GT$$u20$as$u20$core..ops..drop..Drop$GT$4drop17h60f00d373ed34912E"}
!873 = !DILocation(line: 542, column: 1, scope: !761, inlinedAt: !869)
!874 = !DILocation(line: 0, scope: !773, inlinedAt: !875)
!875 = distinct !DILocation(line: 2463, column: 32, scope: !785, inlinedAt: !876)
!876 = distinct !DILocation(line: 542, column: 1, scope: !761, inlinedAt: !869)
!877 = !DILocation(line: 0, scope: !795, inlinedAt: !878)
!878 = distinct !DILocation(line: 2688, column: 26, scope: !773, inlinedAt: !875)
!879 = !DILocation(line: 0, scope: !806, inlinedAt: !880)
!880 = distinct !DILocation(line: 64, column: 9, scope: !785, inlinedAt: !876)
!881 = !DILocation(line: 0, scope: !785, inlinedAt: !876)
!882 = !DILocation(line: 0, scope: !815, inlinedAt: !883)
!883 = distinct !DILocation(line: 2463, column: 17, scope: !785, inlinedAt: !876)
!884 = !DILocation(line: 0, scope: !829, inlinedAt: !885)
!885 = distinct !DILocation(line: 1830, column: 27, scope: !815, inlinedAt: !883)
!886 = !DILocation(line: 402, column: 20, scope: !829, inlinedAt: !885)
!887 = !{!871, !866, !859, !853, !848}
!888 = !DILocation(line: 3350, column: 24, scope: !795, inlinedAt: !878)
!889 = !DILocation(line: 2463, column: 12, scope: !785, inlinedAt: !876)
!890 = !DILocation(line: 3641, column: 24, scope: !806, inlinedAt: !880)
!891 = !DILocation(line: 2506, column: 13, scope: !785, inlinedAt: !876)
!892 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN59_$LT$tracing_core..span..Id$u20$as$u20$core..fmt..Debug$GT$3fmt17h76b37bd4a4f6c4a6E", scope: !893, file: !680, line: 15, type: !894, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !24, retainedNodes: !896)
!893 = !DINamespace(name: "{impl#10}", scope: !80)
!894 = !DISubroutineType(types: !895)
!895 = !{!216, !670, !235}
!896 = !{!897, !898}
!897 = !DILocalVariable(name: "self", arg: 1, scope: !892, file: !680, line: 15, type: !670)
!898 = !DILocalVariable(name: "f", arg: 2, scope: !892, file: !680, line: 15, type: !235)
!899 = !DILocation(line: 0, scope: !892)
!900 = !DILocation(line: 16, column: 15, scope: !892)
!901 = !DILocation(line: 15, column: 17, scope: !892)
!902 = !DILocation(line: 15, column: 21, scope: !892)
!903 = !DILocation(line: 15, column: 22, scope: !892)
!904 = distinct !DISubprogram(name: "drop_slow<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN5alloc4sync16Arc$LT$T$C$A$GT$9drop_slow17hd8d6316731aaf9c7E", scope: !537, file: !786, line: 1835, type: !788, scopeLine: 1835, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !573, declaration: !905, retainedNodes: !906)
!905 = !DISubprogram(name: "drop_slow<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN5alloc4sync16Arc$LT$T$C$A$GT$9drop_slow17hd8d6316731aaf9c7E", scope: !537, file: !786, line: 1835, type: !788, scopeLine: 1835, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !573)
!906 = !{!907}
!907 = !DILocalVariable(name: "self", arg: 1, scope: !904, file: !786, line: 1835, type: !790)
!908 = !DILocation(line: 0, scope: !904)
!909 = !DILocalVariable(name: "this", arg: 1, scope: !910, file: !786, line: 2396, type: !790)
!910 = distinct !DILexicalBlock(scope: !911, file: !786, line: 2396, column: 5)
!911 = distinct !DISubprogram(name: "get_mut_unchecked<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN5alloc4sync16Arc$LT$T$C$A$GT$17get_mut_unchecked17haff22e550742363dE", scope: !537, file: !786, line: 2396, type: !912, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !573, declaration: !918, retainedNodes: !919)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !790}
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut (dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !915, templateParams: !24, identifier: "f16a4a6a42a323b7f80c06afbc42dc9c")
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !914, file: !2, baseType: !528, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !914, file: !2, baseType: !531, size: 64, align: 64, offset: 64)
!918 = !DISubprogram(name: "get_mut_unchecked<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", linkageName: "_ZN5alloc4sync16Arc$LT$T$C$A$GT$17get_mut_unchecked17haff22e550742363dE", scope: !537, file: !786, line: 2396, type: !912, scopeLine: 2396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !573)
!919 = !{!909}
!920 = !DILocation(line: 0, scope: !910, inlinedAt: !921)
!921 = !DILocation(line: 1838, column: 37, scope: !904)
!922 = !DILocation(line: 2399, column: 25, scope: !910, inlinedAt: !921)
!923 = !DILocation(line: 1838, column: 18, scope: !904)
!924 = !DILocalVariable(arg: 1, scope: !925, file: !492, line: 542, type: !928)
!925 = distinct !DISubprogram(name: "drop_in_place<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>", linkageName: "_ZN4core3ptr111drop_in_place$LT$dyn$u20$tracing_core..subscriber..Subscriber$u2b$core..marker..Send$u2b$core..marker..Sync$GT$17hf513ef9193d9915fE", scope: !138, file: !492, line: 542, type: !926, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !562, retainedNodes: !932)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !928}
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut (dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !929, templateParams: !24, identifier: "31ffc74c6d6da414ab70890f3f6ceb32")
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !928, file: !2, baseType: !528, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !928, file: !2, baseType: !531, size: 64, align: 64, offset: 64)
!932 = !{!924}
!933 = !DILocation(line: 0, scope: !925, inlinedAt: !934)
!934 = distinct !DILocation(line: 1838, column: 18, scope: !904)
!935 = !DILocation(line: 542, column: 1, scope: !925, inlinedAt: !934)
!936 = !DILocalVariable(name: "_x", arg: 1, scope: !937, file: !938, line: 938, type: !943)
!937 = distinct !DILexicalBlock(scope: !939, file: !938, line: 938, column: 1)
!938 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/mem/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ab6d66e759286ff434b3e279bd7267d7")
!939 = distinct !DISubprogram(name: "drop<alloc::sync::Weak<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), &alloc::alloc::Global>>", linkageName: "_ZN4core3mem4drop17hbed32146cc37b5d5E", scope: !940, file: !938, line: 938, type: !941, scopeLine: 938, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, templateParams: !951, retainedNodes: !950)
!940 = !DINamespace(name: "mem", scope: !16)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !943}
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Weak<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), &alloc::alloc::Global>", scope: !538, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !944, templateParams: !948, identifier: "fdb606681831244eb460d4f9c0cc060f")
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !943, file: !2, baseType: !542, size: 128, align: 64, flags: DIFlagPrivate)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !943, file: !2, baseType: !947, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::alloc::Global", baseType: !571, size: 64, align: 64, dwarfAddressSpace: 0)
!948 = !{!563, !949}
!949 = !DITemplateTypeParameter(name: "A", type: !947)
!950 = !{!936}
