; ModuleID = 'tracing_core.5c3ec50f55875a0f-cgu.0'
source_filename = "tracing_core.5c3ec50f55875a0f-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::option::Option<&dyn field::Value>" = type { ptr, [1 x i64] }
%"core::fmt::rt::Argument<'_>" = type { %"core::fmt::rt::ArgumentType<'_>" }
%"core::fmt::rt::ArgumentType<'_>" = type { [1 x i64], ptr }

@vtable.0 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN79_$LT$tracing_core..field..DisplayValue$LT$T$GT$$u20$as$u20$core..fmt..Debug$GT$3fmt17he6fc54907e4cf2d7E" }>, align 8, !dbg !0
@vtable.1 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h98deaf3e4776d19fE" }>, align 8, !dbg !27
@vtable.3 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h85edd91399d497d0E" }>, align 8, !dbg !35
@vtable.4 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h49a007c955939cb0E" }>, align 8, !dbg !151

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<tracing_core::field::DisplayValue<&&str> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DisplayValue<&&str> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !24, identifier: "97e8d28966897ed3d37497548642e75f")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "DisplayValue<&&str>", scope: !13, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !15, templateParams: !25, identifier: "1fd7f2b5162656c8cbf769f779cc63c2")
!13 = !DINamespace(name: "field", scope: !14)
!14 = !DINamespace(name: "tracing_core", scope: null)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !12, file: !2, baseType: !17, size: 64, align: 64, flags: DIFlagPrivate)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !19, templateParams: !24, identifier: "9277eecd40495f85161460476aacc992")
!19 = !{!20, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !18, file: !2, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!22 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!24 = !{}
!25 = !{!26}
!26 = !DITemplateTypeParameter(name: "T", type: !17)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "<&&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !30, vtableHolder: !17, templateParams: !24, identifier: "beb53bd9b67bd3d7c7ef05c22fdfd3ab")
!30 = !{!31, !32, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !29, file: !2, baseType: !6, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !29, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !29, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "<&*const tracing_core::callsite::DefaultCallsite as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&*const tracing_core::callsite::DefaultCallsite as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !38, vtableHolder: !43, templateParams: !24, identifier: "6c313f329de0c80dc3bd14cb44c6c097")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !37, file: !2, baseType: !6, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !37, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !37, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*const tracing_core::callsite::DefaultCallsite", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const tracing_core::callsite::DefaultCallsite", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "DefaultCallsite", scope: !46, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !47, templateParams: !24, identifier: "773cae9b69570b4df1b9f369e670ea0b")
!46 = !DINamespace(name: "callsite", scope: !14)
!47 = !{!48, !61, !62, !139}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "interest", scope: !45, file: !2, baseType: !49, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU8", scope: !50, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !53, templateParams: !24, identifier: "ffd090b159fd8fe6731cd1b8f498bbda")
!50 = !DINamespace(name: "atomic", scope: !51)
!51 = !DINamespace(name: "sync", scope: !52)
!52 = !DINamespace(name: "core", scope: null)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !49, file: !2, baseType: !55, size: 8, align: 8, flags: DIFlagPrivate)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !56, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !57, templateParams: !59, identifier: "3d60124e2ea80f49fea4c31f0e521ce7")
!56 = !DINamespace(name: "cell", scope: !52)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !55, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagPrivate)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "T", type: !22)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "registration", scope: !45, file: !2, baseType: !49, size: 8, align: 8, offset: 136, flags: DIFlagPrivate)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "meta", scope: !45, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::metadata::Metadata", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Metadata", scope: !65, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !66, templateParams: !24, identifier: "3b84479356cedceecb2a6e9a052a0bb")
!65 = !DINamespace(name: "metadata", scope: !14)
!66 = !{!67, !68, !69, !81, !96, !97, !112, !135}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !2, baseType: !18, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !64, file: !2, baseType: !18, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !64, file: !2, baseType: !70, size: 64, align: 64, flags: DIFlagPrivate)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Level", scope: !65, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !71, templateParams: !24, identifier: "3d305f8aa09ff344e25a3e8e657c6f0")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !73, size: 64, align: 64, flags: DIFlagPrivate)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LevelInner", scope: !65, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagEnumClass, elements: !75)
!74 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "Trace", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "Info", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "Warn", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "Error", value: 4, isUnsigned: true)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "module_path", scope: !64, file: !2, baseType: !82, size: 128, align: 64, offset: 640, flags: DIFlagPrivate)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !83, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !84, templateParams: !24, identifier: "c9cc8e2c9bc8d3061e54de437c9b5882")
!83 = !DINamespace(name: "option", scope: !52)
!84 = !{!85}
!85 = !DICompositeType(tag: DW_TAG_variant_part, scope: !82, file: !2, size: 128, align: 64, elements: !86, templateParams: !24, identifier: "dc91c89dee9d03b772ff0b7d0b60a9cb", discriminator: !95)
!86 = !{!87, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !85, file: !2, baseType: !88, size: 128, align: 64, extraData: i128 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !82, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !89, identifier: "20871c480156d021cbbc4b2eec20a35c")
!89 = !{!90}
!90 = !DITemplateTypeParameter(name: "T", type: !18)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !85, file: !2, baseType: !92, size: 128, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !82, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !93, templateParams: !89, identifier: "2bd48e68865dce7a72b4a9887ea344e7")
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !92, file: !2, baseType: !18, size: 128, align: 64, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, scope: !82, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !64, file: !2, baseType: !82, size: 128, align: 64, offset: 768, flags: DIFlagPrivate)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !64, file: !2, baseType: !98, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u32>", scope: !83, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !99, templateParams: !24, identifier: "ebe2cffeee76dada7a14f25e4750045b")
!99 = !{!100}
!100 = !DICompositeType(tag: DW_TAG_variant_part, scope: !98, file: !2, size: 64, align: 32, elements: !101, templateParams: !24, identifier: "3a58987d801709f0f7fa9f7e54d1fd1d", discriminator: !111)
!101 = !{!102, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !100, file: !2, baseType: !103, size: 64, align: 32, extraData: i128 0)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !98, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !24, templateParams: !104, identifier: "e28adf562df1b32c687fa9358c66829a")
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "T", type: !106)
!106 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !100, file: !2, baseType: !108, size: 64, align: 32, extraData: i128 1)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !98, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !109, templateParams: !104, identifier: "f83975a5848a2c13d4de936bd3cabeef")
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !108, file: !2, baseType: !106, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, scope: !98, file: !2, baseType: !106, size: 32, align: 32, flags: DIFlagArtificial)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !64, file: !2, baseType: !113, size: 256, align: 64, offset: 384, flags: DIFlagPrivate)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "FieldSet", scope: !13, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !114, templateParams: !24, identifier: "642257ca0ce4840b22f807882fb913e5")
!114 = !{!115, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !113, file: !2, baseType: !116, size: 128, align: 64, flags: DIFlagPrivate)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !117, templateParams: !24, identifier: "4e66b00a376d6af5b8765440fb2839f")
!117 = !{!118, !120}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !116, file: !2, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !116, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "callsite", scope: !113, file: !2, baseType: !122, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Identifier", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !123, templateParams: !24, identifier: "694a2c46ec2152c644a6ea782ce3d0c9")
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !122, file: !2, baseType: !125, size: 128, align: 64, flags: DIFlagPublic)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "&dyn tracing_core::callsite::Callsite", file: !2, size: 128, align: 64, elements: !126, templateParams: !24, identifier: "df1a176f56d6ca7c28bcf92f700ee32a")
!126 = !{!127, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !125, file: !2, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn tracing_core::callsite::Callsite", file: !2, align: 8, elements: !24, identifier: "5c748cc422d45a5e574d89abc4ee022")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !125, file: !2, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !132, size: 64, align: 64, dwarfAddressSpace: 0)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 6, lowerBound: 0)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !64, file: !2, baseType: !136, size: 8, align: 8, offset: 896, flags: DIFlagPrivate)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Kind", scope: !65, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !137, templateParams: !24, identifier: "4cc597743dd29f5ff357f7fb040d40ab")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !136, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagPrivate)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !45, file: !2, baseType: !140, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<tracing_core::callsite::DefaultCallsite>", scope: !50, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !141, templateParams: !149, identifier: "29cbd457f15c06cbe7bfd5420cac594")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !140, file: !2, baseType: !143, size: 64, align: 64, flags: DIFlagPrivate)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut tracing_core::callsite::DefaultCallsite>", scope: !56, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !144, templateParams: !147, identifier: "c3dde6f4f12246fb30cb569cd65cfeca")
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !143, file: !2, baseType: !146, size: 64, align: 64, flags: DIFlagPrivate)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut tracing_core::callsite::DefaultCallsite", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!147 = !{!148}
!148 = !DITemplateTypeParameter(name: "T", type: !146)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !45)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "<&*mut tracing_core::callsite::DefaultCallsite as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&*mut tracing_core::callsite::DefaultCallsite as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !154, vtableHolder: !159, templateParams: !24, identifier: "ab41ee88503e235b434551c497b3466f")
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !153, file: !2, baseType: !6, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !153, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !153, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !153, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&*mut tracing_core::callsite::DefaultCallsite", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "CALLSITES", linkageName: "_ZN12tracing_core8callsite9CALLSITES17hccc57102ec60b6c5E", scope: !46, file: !162, line: 257, type: !163, isLocal: true, isDefinition: true, align: 64)
!162 = !DIFile(filename: "src/callsite.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32", checksumkind: CSK_MD5, checksum: "86f95afea5a472a4bec30b265a2b36ee")
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Callsites", scope: !46, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !164, templateParams: !24, identifier: "15e1194b99c2094aa5b0cfcc68be4e6d")
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "list_head", scope: !163, file: !2, baseType: !140, size: 64, align: 64, flags: DIFlagPrivate)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "has_locked_callsites", scope: !163, file: !2, baseType: !167, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !50, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !168, templateParams: !24, identifier: "e355366fff81569ecf8136dc5af7d4f7")
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !167, file: !2, baseType: !55, size: 8, align: 8, flags: DIFlagPrivate)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "LOCKED_CALLSITES", linkageName: "_ZN12tracing_core8callsite16LOCKED_CALLSITES17he8d4287cb4f62c95E", scope: !46, file: !162, line: 264, type: !172, isLocal: true, isDefinition: true, align: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Lazy<tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>, fn() -> tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>", scope: !173, file: !2, size: 448, align: 64, flags: DIFlagProtected, elements: !175, templateParams: !284, identifier: "a6b72db82ee539e97ddf66ccb63a1001")
!173 = !DINamespace(name: "spin", scope: !174)
!174 = !DINamespace(name: "lazy", scope: !14)
!175 = !{!176, !259}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cell", scope: !172, file: !2, baseType: !177, size: 384, align: 64, flags: DIFlagPrivate)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once<tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>", scope: !178, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !180, templateParams: !200, identifier: "483cc8797bae2628b2e4ad41183a30c3")
!178 = !DINamespace(name: "once", scope: !179)
!179 = !DINamespace(name: "spin", scope: !14)
!180 = !{!181, !190}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !177, file: !2, baseType: !182, size: 64, align: 64, flags: DIFlagPrivate)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !50, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !183, templateParams: !24, identifier: "5e2d2bd30b2255a1bb7bbacbfa3cfa79")
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !182, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagPrivate)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !56, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !186, templateParams: !188, identifier: "739795389d327d6873469e3d89b8c60e")
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !185, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !9)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !2, baseType: !191, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>>", scope: !56, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !192, templateParams: !257, identifier: "c700bc0624d7398478202dab14e05aee")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !191, file: !2, baseType: !194, size: 320, align: 64, flags: DIFlagPrivate)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>", scope: !83, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !195, templateParams: !24, identifier: "82d52b00df099f1c293a4b3332943d40")
!195 = !{!196}
!196 = !DICompositeType(tag: DW_TAG_variant_part, scope: !194, file: !2, size: 320, align: 64, elements: !197, templateParams: !24, identifier: "bf967461c0773c15e84a40e362df9574", discriminator: !256)
!197 = !{!198, !252}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !196, file: !2, baseType: !199, size: 320, align: 64, extraData: i128 0)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !194, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !200, identifier: "ef589cfc247cd36493a972c3e303fb5d")
!200 = !{!201}
!201 = !DITemplateTypeParameter(name: "T", type: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>", scope: !203, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !206, templateParams: !250, identifier: "7b87f0aa9ff4367d1144821e2fffdfe7")
!203 = !DINamespace(name: "sync", scope: !204)
!204 = !DINamespace(name: "no_std", scope: !205)
!205 = !DINamespace(name: "stdlib", scope: !14)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !202, file: !2, baseType: !208, size: 256, align: 64, flags: DIFlagPrivate)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>", scope: !209, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !210, templateParams: !250, identifier: "c6572100dbd32b147f159b8de5f0321d")
!209 = !DINamespace(name: "mutex", scope: !179)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !208, file: !2, baseType: !167, size: 8, align: 8, flags: DIFlagPrivate)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !2, baseType: !213, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>", scope: !56, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !214, templateParams: !250, identifier: "acd79c10c0d32f6b2482f5f254c76a77")
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !2, baseType: !216, size: 192, align: 64, flags: DIFlagPrivate)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>", scope: !217, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !219, templateParams: !247, identifier: "93412511cf5d60d11298ab0cbd5382ce")
!217 = !DINamespace(name: "vec", scope: !218)
!218 = !DINamespace(name: "alloc", scope: null)
!219 = !{!220, !249}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !216, file: !2, baseType: !221, size: 128, align: 64, flags: DIFlagPrivate)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>", scope: !222, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !223, templateParams: !247, identifier: "5bfcea26b75461881871598fbdc73362")
!222 = !DINamespace(name: "raw_vec", scope: !218)
!223 = !{!224, !240, !244}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !221, file: !2, baseType: !225, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<&dyn tracing_core::callsite::Callsite>", scope: !226, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !228, templateParams: !235, identifier: "472cff5e6a47bfd912f5e21cbbca67aa")
!226 = !DINamespace(name: "unique", scope: !227)
!227 = !DINamespace(name: "ptr", scope: !52)
!228 = !{!229, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !225, file: !2, baseType: !230, size: 64, align: 64, flags: DIFlagPrivate)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&dyn tracing_core::callsite::Callsite>", scope: !231, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !232, templateParams: !235, identifier: "487850bd659e1c0b443fcc11ecbd9b80")
!231 = !DINamespace(name: "non_null", scope: !227)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !230, file: !2, baseType: !234, size: 64, align: 64, flags: DIFlagPrivate)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &dyn tracing_core::callsite::Callsite", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !{!236}
!236 = !DITemplateTypeParameter(name: "T", type: !125)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !225, file: !2, baseType: !238, align: 8, offset: 64, flags: DIFlagPrivate)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&dyn tracing_core::callsite::Callsite>", scope: !239, file: !2, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !235, identifier: "2129c2a13a11284852a95fcc332f62dc")
!239 = !DINamespace(name: "marker", scope: !52)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !221, file: !2, baseType: !241, size: 64, align: 64, flags: DIFlagPrivate)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !222, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !242, templateParams: !24, identifier: "62de598dd28eaf1c7c0f61ca013e23b")
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !241, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !221, file: !2, baseType: !245, align: 8, offset: 128, flags: DIFlagPrivate)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !246, file: !2, align: 8, flags: DIFlagPublic, elements: !24, identifier: "14de19725ec4b1fd38fae074afd4da08")
!246 = !DINamespace(name: "alloc", scope: !218)
!247 = !{!236, !248}
!248 = !DITemplateTypeParameter(name: "A", type: !245)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !216, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!250 = !{!251}
!251 = !DITemplateTypeParameter(name: "T", type: !216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !196, file: !2, baseType: !253, size: 320, align: 64, extraData: i128 1)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !194, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !254, templateParams: !200, identifier: "87b4b9a24a709d443204e8fc492c30b9")
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !253, file: !2, baseType: !202, size: 256, align: 64, offset: 64, flags: DIFlagPublic)
!256 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!257 = !{!258}
!258 = !DITemplateTypeParameter(name: "T", type: !194)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !172, file: !2, baseType: !260, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<core::option::Option<fn() -> tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>>", scope: !56, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !261, templateParams: !282, identifier: "5513bde19aa31acf80fa0aeaa47326b8")
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !2, baseType: !263, size: 64, align: 64, flags: DIFlagPrivate)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<fn() -> tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>>", scope: !56, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !264, templateParams: !282, identifier: "834c58e5304d14771273b1b584e37e5f")
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !263, file: !2, baseType: !266, size: 64, align: 64, flags: DIFlagPrivate)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<fn() -> tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>>", scope: !83, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !267, templateParams: !24, identifier: "d3238a203ff012bf7c2e64da744a0f04")
!267 = !{!268}
!268 = !DICompositeType(tag: DW_TAG_variant_part, scope: !266, file: !2, size: 64, align: 64, elements: !269, templateParams: !24, identifier: "428dd4bae32f9f7f37c6b5ddabc03d6", discriminator: !281)
!269 = !{!270, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !268, file: !2, baseType: !271, size: 64, align: 64, extraData: i128 0)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !266, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !272, identifier: "1270a632e130202abdd933216e7b597d")
!272 = !{!273}
!273 = !DITemplateTypeParameter(name: "T", type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> tracing_core::stdlib::no_std::sync::Mutex<alloc::vec::Vec<&dyn tracing_core::callsite::Callsite, alloc::alloc::Global>>", baseType: !275, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !DISubroutineType(types: !276)
!276 = !{!202}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !268, file: !2, baseType: !278, size: 64, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !266, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !279, templateParams: !272, identifier: "1b9ba76ba244fa977aa013b595f43d3")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !278, file: !2, baseType: !274, size: 64, align: 64, flags: DIFlagPublic)
!281 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!282 = !{!283}
!283 = !DITemplateTypeParameter(name: "T", type: !266)
!284 = !{!201, !285}
!285 = !DITemplateTypeParameter(name: "F", type: !274)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "EXISTS", linkageName: "_ZN12tracing_core10dispatcher6EXISTS17h5eb0de3fb9590007E", scope: !288, file: !289, line: 196, type: !167, isLocal: false, isDefinition: true, align: 8)
!288 = !DINamespace(name: "dispatcher", scope: !14)
!289 = !DIFile(filename: "src/dispatcher.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32", checksumkind: CSK_MD5, checksum: "f6797c55d2fea3e4e0a0bb79b60f4aef")
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "GLOBAL_INIT", linkageName: "_ZN12tracing_core10dispatcher11GLOBAL_INIT17h32115fdb9b27e6eeE", scope: !288, file: !289, line: 197, type: !182, isLocal: false, isDefinition: true, align: 64)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "GLOBAL_DISPATCH", linkageName: "_ZN12tracing_core10dispatcher15GLOBAL_DISPATCH17h87fe84e1b4a2c89aE", scope: !288, file: !289, line: 206, type: !294, isLocal: false, isDefinition: true, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dispatch", scope: !288, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !295, templateParams: !24, identifier: "f513359f5f96301a76fe25b76bf4d8e4")
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "subscriber", scope: !294, file: !2, baseType: !297, size: 192, align: 64, flags: DIFlagPrivate)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Kind<alloc::sync::Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>>", scope: !288, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !298, templateParams: !24, identifier: "7cb32a7a4cf61c40753f9af8eda9fd69")
!298 = !{!299}
!299 = !DICompositeType(tag: DW_TAG_variant_part, scope: !297, file: !2, size: 192, align: 64, elements: !300, templateParams: !24, identifier: "a49141d706bc8ab32715280cd56a9598", discriminator: !346)
!300 = !{!301, !342}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Global", scope: !299, file: !2, baseType: !302, size: 192, align: 64, extraData: i128 0)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !297, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !303, templateParams: !315, identifier: "21ab0d80e171cf9d3720901adec4027f")
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !302, file: !2, baseType: !305, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "&(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)", file: !2, size: 128, align: 64, elements: !306, templateParams: !24, identifier: "16fab107c0a541436ee8c6ecf7042812")
!306 = !{!307, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !305, file: !2, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !24, identifier: "ce8e0bac22c4feba408114ee1b241eda")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !305, file: !2, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 19]", baseType: !312, size: 64, align: 64, dwarfAddressSpace: 0)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1216, align: 64, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 19, lowerBound: 0)
!315 = !{!316}
!316 = !DITemplateTypeParameter(name: "T", type: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", scope: !318, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !319, templateParams: !341, identifier: "165c8fc35a08543ceefbd4746397f59c")
!318 = !DINamespace(name: "sync", scope: !218)
!319 = !{!320, !338, !340}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !317, file: !2, baseType: !321, size: 128, align: 64, flags: DIFlagPrivate)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", scope: !231, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !322, templateParams: !336, identifier: "13db5b897d334de180996f5308efd323")
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !321, file: !2, baseType: !324, size: 128, align: 64, flags: DIFlagPrivate)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>", file: !2, size: 128, align: 64, elements: !325, templateParams: !24, identifier: "9ddad5a4adbe4401f27fb0dfa99cc3a")
!325 = !{!326, !335}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !324, file: !2, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64, dwarfAddressSpace: 0)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>", scope: !318, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !329, templateParams: !333, identifier: "6b5c7714fa91098da5f1add0cecda23")
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !328, file: !2, baseType: !182, size: 64, align: 64, flags: DIFlagPrivate)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !328, file: !2, baseType: !182, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !2, baseType: !309, align: 8, offset: 128, flags: DIFlagPrivate)
!333 = !{!334}
!334 = !DITemplateTypeParameter(name: "T", type: !309)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !324, file: !2, baseType: !311, size: 64, align: 64, offset: 64)
!336 = !{!337}
!337 = !DITemplateTypeParameter(name: "T", type: !328)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !317, file: !2, baseType: !339, align: 8, offset: 128, flags: DIFlagPrivate)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<(dyn tracing_core::subscriber::Subscriber + core::marker::Send + core::marker::Sync)>>", scope: !239, file: !2, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !336, identifier: "682416ecbb2b71b69b8fc69936e2cb56")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !317, file: !2, baseType: !245, align: 8, offset: 128, flags: DIFlagPrivate)
!341 = !{!334, !248}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Scoped", scope: !299, file: !2, baseType: !343, size: 192, align: 64, extraData: i128 1)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scoped", scope: !297, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !344, templateParams: !315, identifier: "aa95d937bbfe68d1ad746d2f9081a7e")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !343, file: !2, baseType: !317, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !297, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "NONE", linkageName: "_ZN12tracing_core10dispatcher4NONE17h6e5b38c8436baf83E", scope: !288, file: !289, line: 209, type: !294, isLocal: false, isDefinition: true, align: 64)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "NO_SUBSCRIBER", linkageName: "_ZN12tracing_core10dispatcher13NO_SUBSCRIBER17h03311d1c194bfc5eE", scope: !288, file: !289, line: 212, type: !351, isLocal: false, isDefinition: true, align: 8)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "NoSubscriber", scope: !352, file: !2, align: 8, flags: DIFlagPublic, elements: !353, templateParams: !24, identifier: "10c57d8069560ad89a1ca4f5d240d847")
!352 = !DINamespace(name: "subscriber", scope: !14)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !351, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !358, vtableHolder: !18, templateParams: !24, identifier: "590bafd6944d20d0c360131be18cbca1")
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !357, file: !2, baseType: !6, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !357, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !357, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !366, vtableHolder: !371, templateParams: !24, identifier: "f614f8b463743339f8d80bd2fd809446")
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !365, file: !2, baseType: !6, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !365, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !365, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !372, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !373, templateParams: !24, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!372 = !DINamespace(name: "fmt", scope: !52)
!373 = !{!374, !375, !425}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !371, file: !2, baseType: !116, size: 128, align: 64, flags: DIFlagPrivate)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !371, file: !2, baseType: !376, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !83, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !377, templateParams: !24, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!377 = !{!378}
!378 = !DICompositeType(tag: DW_TAG_variant_part, scope: !376, file: !2, size: 128, align: 64, elements: !379, templateParams: !24, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !424)
!379 = !{!380, !420}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !378, file: !2, baseType: !381, size: 128, align: 64, extraData: i128 0)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !382, identifier: "c062391546990b9ae716e587a9c44107")
!382 = !{!383}
!383 = !DITemplateTypeParameter(name: "T", type: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !385, templateParams: !24, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!385 = !{!386, !419}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !384, file: !2, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64, dwarfAddressSpace: 0)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !389, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !390, templateParams: !24, identifier: "402846c0893391618e34a15e0598c24e")
!389 = !DINamespace(name: "rt", scope: !372)
!390 = !{!391, !392, !394, !401, !402, !418}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !388, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !388, file: !2, baseType: !393, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!393 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !388, file: !2, baseType: !395, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !389, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagEnumClass, elements: !396)
!396 = !{!397, !398, !399, !400}
!397 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!398 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!399 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!400 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !388, file: !2, baseType: !106, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !388, file: !2, baseType: !403, size: 128, align: 64, flags: DIFlagPublic)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !389, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !404, templateParams: !24, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!404 = !{!405}
!405 = !DICompositeType(tag: DW_TAG_variant_part, scope: !403, file: !2, size: 128, align: 64, elements: !406, templateParams: !24, identifier: "96fecae849037968fdad1729d3166571", discriminator: !417)
!406 = !{!407, !411, !415}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !405, file: !2, baseType: !408, size: 128, align: 64, extraData: i128 0)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !403, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !409, templateParams: !24, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !408, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !405, file: !2, baseType: !412, size: 128, align: 64, extraData: i128 1)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !403, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !413, templateParams: !24, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !412, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !405, file: !2, baseType: !416, size: 128, align: 64, extraData: i128 2)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !403, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !24, identifier: "844235131be8a6898de5150ba908049f")
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !388, file: !2, baseType: !403, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !384, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !378, file: !2, baseType: !421, size: 128, align: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !422, templateParams: !382, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !421, file: !2, baseType: !384, size: 128, align: 64, flags: DIFlagPublic)
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !376, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !371, file: !2, baseType: !426, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !427, templateParams: !24, identifier: "baf028fc654408299b6dd770f089fd48")
!427 = !{!428, !497}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !426, file: !2, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !389, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !431, templateParams: !24, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !430, file: !2, baseType: !433, size: 128, align: 64, flags: DIFlagPrivate)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !389, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !434, templateParams: !24, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!434 = !{!435}
!435 = !DICompositeType(tag: DW_TAG_variant_part, scope: !433, file: !2, size: 128, align: 64, elements: !436, templateParams: !24, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !496)
!436 = !{!437, !492}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !435, file: !2, baseType: !438, size: 128, align: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !433, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !439, templateParams: !24, identifier: "7c7df21330d573ca4eefe40395fd691")
!439 = !{!440, !444}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !438, file: !2, baseType: !441, size: 64, align: 64, flags: DIFlagPrivate)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !442, size: 64, align: 64, dwarfAddressSpace: 0)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !443, file: !2, align: 8, elements: !24, identifier: "728a64207294457ae982b2390ae8a902")
!443 = !DINamespace(name: "{extern#0}", scope: !389)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !438, file: !2, baseType: !445, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !446, size: 64, align: 64, dwarfAddressSpace: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !441, !466}
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !449, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !450, templateParams: !24, identifier: "d2df09569ea43718984b3f07c77d7786")
!449 = !DINamespace(name: "result", scope: !52)
!450 = !{!451}
!451 = !DICompositeType(tag: DW_TAG_variant_part, scope: !448, file: !2, size: 8, align: 8, elements: !452, templateParams: !24, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !465)
!452 = !{!453, !461}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !451, file: !2, baseType: !454, size: 8, align: 8, extraData: i128 0)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !448, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !455, templateParams: !457, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !454, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!457 = !{!458, !459}
!458 = !DITemplateTypeParameter(name: "T", type: !7)
!459 = !DITemplateTypeParameter(name: "E", type: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !372, file: !2, align: 8, flags: DIFlagPublic, elements: !24, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !451, file: !2, baseType: !462, size: 8, align: 8, extraData: i128 1)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !448, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !463, templateParams: !457, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !462, file: !2, baseType: !460, align: 8, offset: 8, flags: DIFlagPublic)
!465 = !DIDerivedType(tag: DW_TAG_member, scope: !448, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagArtificial)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !467, size: 64, align: 64, dwarfAddressSpace: 0)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !372, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !468, templateParams: !24, identifier: "9d9578b0f9368582a2201563ca126cd4")
!468 = !{!469, !470, !471, !472, !484, !485}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !2, baseType: !106, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !467, file: !2, baseType: !393, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !467, file: !2, baseType: !395, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !467, file: !2, baseType: !473, size: 128, align: 64, flags: DIFlagPrivate)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !83, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !474, templateParams: !24, identifier: "3850c4a210aea148b16f79ec227c427")
!474 = !{!475}
!475 = !DICompositeType(tag: DW_TAG_variant_part, scope: !473, file: !2, size: 128, align: 64, elements: !476, templateParams: !24, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !483)
!476 = !{!477, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !475, file: !2, baseType: !478, size: 128, align: 64, extraData: i128 0)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !473, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !188, identifier: "10be3845cc366e59d680126f255dea8b")
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !475, file: !2, baseType: !480, size: 128, align: 64, extraData: i128 1)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !473, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !481, templateParams: !188, identifier: "d166501012b6febc55685f1b3285acb8")
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !480, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !473, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !467, file: !2, baseType: !473, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !467, file: !2, baseType: !486, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !487, templateParams: !24, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!487 = !{!488, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !486, file: !2, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64, dwarfAddressSpace: 0)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !24, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !486, file: !2, baseType: !131, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !435, file: !2, baseType: !493, size: 128, align: 64, extraData: i128 0)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !433, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !494, templateParams: !24, identifier: "fb37c399e04d1117cfdf49fc8e0ef2cd")
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !493, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !2, baseType: !74, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !426, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "<f64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "<f64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !501, vtableHolder: !506, templateParams: !24, identifier: "8cd7c9e79b1f52c73004dcd4888ff4d")
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !500, file: !2, baseType: !6, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !500, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !500, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !500, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!506 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "<i64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "<i64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !510, vtableHolder: !515, templateParams: !24, identifier: "9eeec6a12116c0b5f85883e54592b9c1")
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !509, file: !2, baseType: !6, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !509, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !509, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !509, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!515 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "<u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !519, vtableHolder: !74, templateParams: !24, identifier: "58b97cd39c615d0eb89b0d7b18255306")
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !518, file: !2, baseType: !6, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !518, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !518, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !518, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "<i128 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "<i128 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !527, vtableHolder: !532, templateParams: !24, identifier: "774f79dac6e1b187d4399a53852f97bf")
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !526, file: !2, baseType: !6, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !526, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !526, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !526, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!532 = !DIBasicType(name: "i128", size: 128, encoding: DW_ATE_signed)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "<u128 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u128 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !536, vtableHolder: !541, templateParams: !24, identifier: "3fb7ab95c9c5cbee42380ae9949c5a2")
!536 = !{!537, !538, !539, !540}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !535, file: !2, baseType: !6, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !535, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !535, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !535, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!541 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !545, vtableHolder: !550, templateParams: !24, identifier: "cff74116dd1b0531eb9ac650399ff52a")
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !544, file: !2, baseType: !6, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !544, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !544, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!550 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "<tracing_core::field::{impl#17}::fmt::{closure_env#0} as tracing_core::field::Visit>::{vtable}", scope: null, file: !2, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::{impl#17}::fmt::{closure_env#0} as tracing_core::field::Visit>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !554, vtableHolder: !566, templateParams: !24, identifier: "d793bd4e0f93e773fb16e5a7cdcb1940")
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !553, file: !2, baseType: !6, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !553, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !553, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !567, file: !2, size: 128, align: 64, elements: !569, templateParams: !24, identifier: "2857df53bdb416859897ddde49901c9e")
!567 = !DINamespace(name: "fmt", scope: !568)
!568 = !DINamespace(name: "{impl#17}", scope: !13)
!569 = !{!570, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__res", scope: !566, file: !2, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::result::Result<(), core::fmt::Error>", baseType: !448, size: 64, align: 64, dwarfAddressSpace: 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !566, file: !2, baseType: !573, size: 64, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &mut core::fmt::Formatter", baseType: !466, size: 64, align: 64, dwarfAddressSpace: 0)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "NULL_CALLSITE", linkageName: "_ZN71_$LT$dyn$u20$tracing_core..field..Value$u20$as$u20$core..fmt..Debug$GT$3fmt13NULL_CALLSITE17hcf8556c390a89c56E", scope: !567, file: !576, line: 643, type: !577, isLocal: true, isDefinition: true, align: 8)
!576 = !DIFile(filename: "src/field.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32", checksumkind: CSK_MD5, checksum: "40023e95f23864d0e9ddae5c56e45c79")
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "NullCallsite", scope: !567, file: !2, align: 8, flags: DIFlagProtected, elements: !24, identifier: "d925ad73f33c681d4a733c3c6e4df766")
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "FIELD", linkageName: "_ZN71_$LT$dyn$u20$tracing_core..field..Value$u20$as$u20$core..fmt..Debug$GT$3fmt5FIELD17h4729a8c26fe982dcE", scope: !567, file: !576, line: 654, type: !580, isLocal: true, isDefinition: true, align: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "Field", scope: !13, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !581, templateParams: !24, identifier: "f009229e509a98cbdf21eda3c450a6d1")
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !580, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !580, file: !2, baseType: !113, size: 256, align: 64, flags: DIFlagPrivate)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "<&[&str] as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&[&str] as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !587, vtableHolder: !116, templateParams: !24, identifier: "a2cc4c6ece69adea1bd23a707086696d")
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !586, file: !2, baseType: !6, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !586, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !586, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "<tracing_core::callsite::Identifier as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::callsite::Identifier as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !595, vtableHolder: !122, templateParams: !24, identifier: "80bc7c7608fca165122832527e48f061")
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !594, file: !2, baseType: !6, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !594, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !594, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !594, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "<core::fmt::builders::DebugStruct as tracing_core::field::Visit>::{vtable}", scope: null, file: !2, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::builders::DebugStruct as tracing_core::field::Visit>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !603, vtableHolder: !615, templateParams: !24, identifier: "e076fa319cb6a51deae3e641eab59f5e")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !602, file: !2, baseType: !6, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !602, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !602, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !602, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugStruct", scope: !616, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !617, templateParams: !24, identifier: "56e47a374f1450843695d3c27d8f38a9")
!616 = !DINamespace(name: "builders", scope: !372)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !615, file: !2, baseType: !466, size: 64, align: 64, flags: DIFlagPrivate)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !615, file: !2, baseType: !448, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !615, file: !2, baseType: !550, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "<core::fmt::builders::DebugMap as tracing_core::field::Visit>::{vtable}", scope: null, file: !2, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::builders::DebugMap as tracing_core::field::Visit>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !624, vtableHolder: !636, templateParams: !24, identifier: "cb1384ed130192d5c4947bc7d33f6a36")
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !623, file: !2, baseType: !6, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !623, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !623, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !623, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugMap", scope: !616, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !637, templateParams: !24, identifier: "baf1e8ca543dce7c35819cf77c4cb030")
!637 = !{!638, !639, !640, !641, !642}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !636, file: !2, baseType: !466, size: 64, align: 64, flags: DIFlagPrivate)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !636, file: !2, baseType: !448, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !636, file: !2, baseType: !550, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "has_key", scope: !636, file: !2, baseType: !550, size: 8, align: 8, offset: 80, flags: DIFlagPrivate)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !636, file: !2, baseType: !643, size: 8, align: 8, offset: 88, flags: DIFlagPrivate)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapterState", scope: !616, file: !2, size: 8, align: 8, flags: DIFlagPrivate, elements: !644, templateParams: !24, identifier: "d53d4e17b195c0fba9f3acd39fae8bbd")
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "on_newline", scope: !643, file: !2, baseType: !550, size: 8, align: 8, flags: DIFlagPrivate)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "MAX_LEVEL", linkageName: "_ZN12tracing_core8metadata9MAX_LEVEL17h2def28f3c9fb9790E", scope: !65, file: !648, line: 246, type: !182, isLocal: false, isDefinition: true, align: 64)
!648 = !DIFile(filename: "src/metadata.rs", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32", checksumkind: CSK_MD5, checksum: "d1af9c854fdc7f5179338ce730e31216")
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "<tracing_core::metadata::Level as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !651, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::metadata::Level as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !652, vtableHolder: !70, templateParams: !24, identifier: "1c37c187799b0169b5da49062f811e6")
!652 = !{!653, !654, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !651, file: !2, baseType: !6, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !651, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !651, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !660, vtableHolder: !106, templateParams: !24, identifier: "8c90aa1592fec3b0b65600e28815cd7c")
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !659, file: !2, baseType: !6, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !659, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !659, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !659, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "<tracing_core::metadata::Kind as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::metadata::Kind as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !668, vtableHolder: !136, templateParams: !24, identifier: "48fcaffb793cf3259e0f633518b573bc")
!668 = !{!669, !670, !671, !672}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !667, file: !2, baseType: !6, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !667, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !667, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !667, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "<&tracing_core::metadata::LevelInner as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&tracing_core::metadata::LevelInner as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !676, vtableHolder: !681, templateParams: !24, identifier: "caa48abd01896fbcb012d4b944a6322c")
!676 = !{!677, !678, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !675, file: !2, baseType: !6, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !675, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !675, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !675, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&tracing_core::metadata::LevelInner", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!682 = !{i32 8, !"PIC Level", i32 2}
!683 = !{i32 2, !"RtLibUseGOT", i32 1}
!684 = !{i32 2, !"Dwarf Version", i32 4}
!685 = !{i32 2, !"Debug Info Version", i32 3}
!686 = !{!"rustc version 1.80.0-dev"}
!687 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !688, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !689, globals: !791, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32/src/lib.rs/@/tracing_core.5c3ec50f55875a0f-cgu.0", directory: "/home/arsalan/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/tracing-core-0.1.32")
!689 = !{!395, !73, !690, !757, !764, !769, !776, !782}
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !691, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagEnumClass, elements: !692)
!691 = !DINamespace(name: "alignment", scope: !227)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!693 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!694 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!695 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!696 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!697 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!698 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!699 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!700 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!701 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!702 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!703 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!704 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!705 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!706 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!707 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!708 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!709 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!710 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!711 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!712 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!713 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!714 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!715 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!716 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!717 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!718 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!719 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!720 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!721 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!722 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!723 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!724 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!725 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!726 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!727 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!728 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!729 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!730 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!731 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!732 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!733 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!734 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!735 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!736 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!737 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!738 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!739 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!740 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!741 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!742 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!743 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!744 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!745 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!746 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!747 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!748 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!749 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!750 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!751 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!752 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!753 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!754 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!755 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!756 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !758, file: !2, baseType: !759, size: 8, align: 8, flags: DIFlagEnumClass, elements: !760)
!758 = !DINamespace(name: "cmp", scope: !52)
!759 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!760 = !{!761, !762, !763}
!761 = !DIEnumerator(name: "Less", value: -1)
!762 = !DIEnumerator(name: "Equal", value: 0)
!763 = !DIEnumerator(name: "Greater", value: 1)
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InterestKind", scope: !352, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagEnumClass, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIEnumerator(name: "Never", value: 0, isUnsigned: true)
!767 = !DIEnumerator(name: "Sometimes", value: 1, isUnsigned: true)
!768 = !DIEnumerator(name: "Always", value: 2, isUnsigned: true)
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !50, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagEnumClass, elements: !770)
!770 = !{!771, !772, !773, !774, !775}
!771 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!772 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!773 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!774 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!775 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !777, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagEnumClass, elements: !778)
!777 = !DINamespace(name: "panicking", scope: !52)
!778 = !{!779, !780, !781}
!779 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!780 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!781 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!782 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !783, file: !2, baseType: !22, size: 8, align: 8, flags: DIFlagEnumClass, elements: !785)
!783 = !DINamespace(name: "error", scope: !784)
!784 = !DINamespace(name: "num", scope: !52)
!785 = !{!786, !787, !788, !789, !790}
!786 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!787 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!788 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!789 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!790 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!791 = !{!0, !27, !792, !35, !151, !160, !800, !170, !806, !286, !290, !292, !347, !349, !355, !363, !498, !507, !516, !524, !533, !542, !551, !574, !578, !584, !592, !600, !621, !646, !649, !657, !665, !673}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "<() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "<() as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !795, vtableHolder: !7, templateParams: !24, identifier: "76361e630fcd319b3e73951ae411409a")
!795 = !{!796, !797, !798, !799}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !794, file: !2, baseType: !6, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !794, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !794, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "DISPATCHERS", linkageName: "_ZN12tracing_core8callsite11DISPATCHERS17h1f8193a63d33ebd7E", scope: !46, file: !162, line: 262, type: !802, isLocal: true, isDefinition: true, align: 8)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dispatchers", scope: !803, file: !2, align: 8, flags: DIFlagProtected, elements: !804, templateParams: !24, identifier: "6b03883e8d969bcf917aad5cbd10039")
!803 = !DINamespace(name: "dispatchers", scope: !46)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !802, file: !2, baseType: !7, align: 8, flags: DIFlagPrivate)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "<tracing_core::callsite::DefaultCallsite as tracing_core::callsite::Callsite>::{vtable}", scope: null, file: !2, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::callsite::DefaultCallsite as tracing_core::callsite::Callsite>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !809, vtableHolder: !45, templateParams: !24, identifier: "3959841cb4fff1173beef248614fcde8")
!809 = !{!810, !811, !812, !813, !814, !815}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !808, file: !2, baseType: !6, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !808, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !808, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !808, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !808, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !808, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!816 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN41_$LT$bool$u20$as$u20$core..fmt..Debug$GT$3fmt17h40eba7a03f944241E", scope: !818, file: !817, line: 2385, type: !819, scopeLine: 2385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !687, templateParams: !24, retainedNodes: !822)
!817 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!818 = !DINamespace(name: "{impl#12}", scope: !372)
!819 = !DISubroutineType(types: !820)
!820 = !{!448, !821, !466}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!822 = !{!823, !824}
!823 = !DILocalVariable(name: "self", arg: 1, scope: !816, file: !817, line: 2385, type: !821)
!824 = !DILocalVariable(name: "f", arg: 2, scope: !816, file: !817, line: 2385, type: !466)
!825 = !DILocation(line: 0, scope: !816)
!826 = !DILocation(line: 2386, column: 9, scope: !816)
!827 = !DILocation(line: 2387, column: 6, scope: !816)
!828 = distinct !DISubprogram(name: "fmt<*mut tracing_core::callsite::DefaultCallsite>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h49a007c955939cb0E", scope: !829, file: !817, line: 2354, type: !830, scopeLine: 2354, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !687, templateParams: !147, retainedNodes: !833)
!829 = !DINamespace(name: "{impl#51}", scope: !372)
!830 = !DISubroutineType(types: !831)
!831 = !{!448, !832, !466}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&*mut tracing_core::callsite::DefaultCallsite", baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!833 = !{!834, !835}
!834 = !DILocalVariable(name: "self", arg: 1, scope: !828, file: !817, line: 2354, type: !832)
!835 = !DILocalVariable(name: "f", arg: 2, scope: !828, file: !817, line: 2354, type: !466)
!836 = !DILocation(line: 0, scope: !828)
!837 = !DILocation(line: 2354, column: 71, scope: !828)
!838 = !{i64 8}
!839 = !DILocation(line: 2354, column: 62, scope: !828)
!840 = !DILocalVariable(name: "self", arg: 1, scope: !841, file: !817, line: 2549, type: !159)
