; ModuleID = 'buffer.5e7c5db5b35e0cf5-cgu.0'
source_filename = "buffer.5e7c5db5b35e0cf5-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicPtr<core::ffi::c_void>" = type { ptr }

@vtable.0 = private constant <{ [24 x i8], ptr, ptr, ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", ptr @"_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h6e8be0d08ff79c63E", ptr @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hea1f261d208f49b6E", ptr @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hea1f261d208f49b6E" }>, align 8, !dbg !0
@alloc_374c9df73b8540d3e9b0cfbfed1be08c = private unnamed_addr constant <{ [25 x i8] }> <{ [25 x i8] c"overflow in Duration::new" }>, align 1
@alloc_b7c1c22a954085a45dacf7c670d25258 = private unnamed_addr constant <{ ptr, [8 x i8] }> <{ ptr @alloc_374c9df73b8540d3e9b0cfbfed1be08c, [8 x i8] c"\19\00\00\00\00\00\00\00" }>, align 8
@alloc_8b358ae686d38d8a24608308769d36ed = private unnamed_addr constant <{ [77 x i8] }> <{ [77 x i8] c"/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/time.rs" }>, align 1
@alloc_780cce55eebcf3006d09c4f4f63d73b0 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_8b358ae686d38d8a24608308769d36ed, [16 x i8] c"M\00\00\00\00\00\00\00\DA\00\00\00\19\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "4be7f99a10befd66f3b6b76afbf3cdc")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "60efa411c23a73a7fcf3c4457776e82c")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<getrandom::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<getrandom::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "7f1a6dcbf713c13ede202e04a2a7f8e")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !33, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !35, templateParams: !23, identifier: "de8a12a9285be0a4b6331a2af275ae45")
!33 = !DINamespace(name: "error", scope: !34)
!34 = !DINamespace(name: "getrandom", scope: null)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !32, file: !2, baseType: !37, size: 32, align: 32, flags: DIFlagPrivate)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<i32>", scope: !38, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !41, templateParams: !48, identifier: "a84bc22a85578d3221cf5a0866b871c2")
!38 = !DINamespace(name: "nonzero", scope: !39)
!39 = !DINamespace(name: "num", scope: !40)
!40 = !DINamespace(name: "core", scope: null)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !37, file: !2, baseType: !43, size: 32, align: 32, flags: DIFlagPrivate)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroI32Inner", scope: !44, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !45, templateParams: !23, identifier: "ad4c4f76d7fe4497c12b03994db04d74")
!44 = !DINamespace(name: "private", scope: !38)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !43, file: !2, baseType: !47, size: 32, align: 32, flags: DIFlagPrivate)
!47 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "T", type: !47)
!50 = !{i32 8, !"PIC Level", i32 2}
!51 = !{i32 7, !"PIE Level", i32 2}
!52 = !{i32 2, !"RtLibUseGOT", i32 1}
!53 = !{i32 2, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{!"rustc version 1.80.0-dev"}
!56 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !57, producer: "clang LLVM (rustc version 1.80.0-dev)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, globals: !170, splitDebugInlining: false, nameTableKind: None)
!57 = !DIFile(filename: "benches/buffer.rs/@/buffer.5e7c5db5b35e0cf5-cgu.0", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/getrandom-0.3.2")
!58 = !{!59, !66, !73, !78, !87, !95, !164}
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !60, file: !2, baseType: !61, size: 8, align: 8, flags: DIFlagEnumClass, elements: !62)
!60 = !DINamespace(name: "cmp", scope: !40)
!61 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "Less", value: -1)
!64 = !DIEnumerator(name: "Equal", value: 0)
!65 = !DIEnumerator(name: "Greater", value: 1)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BenchMode", scope: !67, file: !2, baseType: !69, size: 8, align: 8, flags: DIFlagEnumClass, elements: !70)
!67 = !DINamespace(name: "options", scope: !68)
!68 = !DINamespace(name: "test", scope: null)
!69 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "Auto", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "Single", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !74, file: !2, baseType: !69, size: 8, align: 8, flags: DIFlagEnumClass, elements: !75)
!74 = !DINamespace(name: "ffi", scope: !40)
!75 = !{!76, !77}
!76 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !79, file: !2, baseType: !69, size: 8, align: 8, flags: DIFlagEnumClass, elements: !81)
!79 = !DINamespace(name: "atomic", scope: !80)
!80 = !DINamespace(name: "sync", scope: !40)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !88, file: !2, baseType: !69, size: 8, align: 8, flags: DIFlagEnumClass, elements: !90)
!88 = !DINamespace(name: "rt", scope: !89)
!89 = !DINamespace(name: "fmt", scope: !40)
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !96, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagEnumClass, elements: !99)
!96 = !DINamespace(name: "alignment", scope: !97)
!97 = !DINamespace(name: "ptr", scope: !40)
!98 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!100 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!102 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!103 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!104 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!105 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!106 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!107 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!108 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!109 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!110 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!111 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!112 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!113 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!114 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!115 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!116 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!145 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!146 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!147 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!148 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!149 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!150 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!151 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!152 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!153 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!154 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!155 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!156 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !165, file: !2, baseType: !69, size: 8, align: 8, flags: DIFlagEnumClass, elements: !167)
!165 = !DINamespace(name: "raw_vec", scope: !166)
!166 = !DINamespace(name: "alloc", scope: null)
!167 = !{!168, !169}
!168 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!169 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!170 = !{!0, !24}
!171 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17had73a76463822464E", scope: !173, file: !172, line: 151, type: !175, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !181, retainedNodes: !177)
!172 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "9a938a0945aa66d12453850743d3bf49")
!173 = !DINamespace(name: "backtrace", scope: !174)
!174 = !DINamespace(name: "sys_common", scope: !17)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !20}
!177 = !{!178, !179}
!178 = !DILocalVariable(name: "f", arg: 1, scope: !171, file: !172, line: 151, type: !20)
!179 = !DILocalVariable(name: "result", scope: !180, file: !172, line: 155, type: !7, align: 1)
!180 = distinct !DILexicalBlock(scope: !171, file: !172, line: 155, column: 5)
!181 = !{!182, !183}
!182 = !DITemplateTypeParameter(name: "F", type: !20)
!183 = !DITemplateTypeParameter(name: "T", type: !7)
!184 = !{i32 0}
!185 = !DILocation(line: 250, column: 5, scope: !186, inlinedAt: !197)
!186 = distinct !DISubprogram(name: "call_once<fn(), ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17hb601846ede019618E", scope: !188, file: !187, line: 250, type: !175, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !194, retainedNodes: !191)
!187 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "abc772494ea8033dad5cae2e40e54b10")
!188 = !DINamespace(name: "FnOnce", scope: !189)
!189 = !DINamespace(name: "function", scope: !190)
!190 = !DINamespace(name: "ops", scope: !40)
!191 = !{!192, !193}
!192 = !DILocalVariable(arg: 1, scope: !186, file: !187, line: 250, type: !20)
!193 = !DILocalVariable(arg: 2, scope: !186, file: !187, line: 250, type: !7)
!194 = !{!195, !196}
!195 = !DITemplateTypeParameter(name: "Self", type: !20)
!196 = !DITemplateTypeParameter(name: "Args", type: !7)
!197 = distinct !DILocation(line: 155, column: 18, scope: !171)
!198 = !DILocalVariable(name: "dummy", scope: !199, file: !200, line: 337, type: !7, align: 1)
!199 = distinct !DILexicalBlock(scope: !201, file: !200, line: 337, column: 1)
!200 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "36624a7f44e0e372094a9874489ad080")
!201 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hea04605bd231d4fbE", scope: !202, file: !200, line: 337, type: !203, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !206, retainedNodes: !205)
!202 = !DINamespace(name: "hint", scope: !40)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !7}
!205 = !{!198}
!206 = !{!183}
!207 = !DILocation(line: 337, column: 27, scope: !199, inlinedAt: !208)
!208 = !DILocation(line: 158, column: 5, scope: !180)
!209 = !DILocation(line: 155, column: 9, scope: !180)
!210 = !DILocation(line: 0, scope: !171)
!211 = !DILocation(line: 0, scope: !186, inlinedAt: !197)
!212 = !DILocation(line: 338, column: 5, scope: !199, inlinedAt: !208)
!213 = !{i32 2706043}
!214 = !DILocation(line: 161, column: 2, scope: !171)
!215 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h504a5e79cb36845dE", scope: !16, file: !216, line: 152, type: !217, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !206, retainedNodes: !222)
!216 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "d023918fb5f452acdbb300902bf5fc59")
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !20, !219, !220, !69}
!219 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !221, size: 64, align: 64, dwarfAddressSpace: 0)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!222 = !{!223, !224, !225, !226, !227}
!223 = !DILocalVariable(name: "main", arg: 1, scope: !215, file: !216, line: 153, type: !20)
!224 = !DILocalVariable(name: "argc", arg: 2, scope: !215, file: !216, line: 154, type: !219)
!225 = !DILocalVariable(name: "argv", arg: 3, scope: !215, file: !216, line: 155, type: !220)
!226 = !DILocalVariable(name: "sigpipe", arg: 4, scope: !215, file: !216, line: 156, type: !69)
!227 = !DILocalVariable(name: "v", scope: !228, file: !216, line: 158, type: !219, align: 8)
!228 = distinct !DILexicalBlock(scope: !215, file: !216, line: 158, column: 5)
!229 = !{i32 1}
!230 = !DILocation(line: 0, scope: !215)
!231 = !DILocation(line: 159, column: 10, scope: !215)
!232 = !DILocation(line: 158, column: 17, scope: !215)
!233 = !DILocation(line: 163, column: 6, scope: !215)
!234 = !DILocation(line: 165, column: 2, scope: !215)
!235 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hea1f261d208f49b6E", scope: !15, file: !216, line: 159, type: !236, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !206, retainedNodes: !239)
!236 = !DISubroutineType(types: !237)
!237 = !{!47, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !{!240}
!240 = !DILocalVariable(name: "main", scope: !235, file: !216, line: 153, type: !20, align: 8)
!241 = !{i32 2}
!242 = !DILocation(line: 159, column: 77, scope: !235)
!243 = !DILocation(line: 0, scope: !235)
!244 = !DILocation(line: 159, column: 18, scope: !235)
!245 = !DILocation(line: 159, column: 100, scope: !235)
!246 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h6e8be0d08ff79c63E", scope: !188, file: !187, line: 250, type: !247, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !253, retainedNodes: !250)
!247 = !DISubroutineType(types: !248)
!248 = !{!47, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !{!251, !252}
!251 = !DILocalVariable(arg: 1, scope: !246, file: !187, line: 250, type: !249)
!252 = !DILocalVariable(arg: 2, scope: !246, file: !187, line: 250, type: !7)
!253 = !{!254, !196}
!254 = !DITemplateTypeParameter(name: "Self", type: !14)
!255 = !{i32 3}
!256 = !DILocation(line: 250, column: 5, scope: !246)
!257 = !DILocation(line: 0, scope: !246)
!258 = !DILocalVariable(arg: 1, scope: !259, file: !187, line: 250, type: !14)
!259 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h126c7a375ca91f87E", scope: !188, file: !187, line: 250, type: !260, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !253, retainedNodes: !262)
!260 = !DISubroutineType(types: !261)
!261 = !{!47, !14}
!262 = !{!258, !263}
!263 = !DILocalVariable(arg: 2, scope: !259, file: !187, line: 250, type: !7)
!264 = !DILocation(line: 0, scope: !259, inlinedAt: !265)
!265 = distinct !DILocation(line: 250, column: 5, scope: !246)
!266 = !DILocation(line: 250, column: 5, scope: !259, inlinedAt: !265)
!267 = !DILocation(line: 0, scope: !235, inlinedAt: !268)
!268 = distinct !DILocation(line: 250, column: 5, scope: !259, inlinedAt: !265)
!269 = !DILocation(line: 159, column: 18, scope: !235, inlinedAt: !268)
!270 = !{!271}
!271 = distinct !{!271, !272, !"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hea1f261d208f49b6E: %_1"}
!272 = distinct !{!272, !"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hea1f261d208f49b6E"}
!273 = distinct !DISubprogram(name: "call_once<buffer::p384::bench_fill_uninit::{closure_env#0}, (&mut test::bench::Bencher)>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h1226e8e2a2618511E", scope: !188, file: !187, line: 250, type: !274, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !378, retainedNodes: !372)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !326, !330}
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::string::String>", scope: !277, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !278, templateParams: !23, identifier: "469d7b963624788a3d78e642313d7c8f")
!277 = !DINamespace(name: "result", scope: !40)
!278 = !{!279}
!279 = !DICompositeType(tag: DW_TAG_variant_part, scope: !276, file: !2, size: 192, align: 64, elements: !280, templateParams: !23, identifier: "ff1ba5798e24341cf44a7299fb1f9c03", discriminator: !325)
!280 = !{!281, !321}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !279, file: !2, baseType: !282, size: 192, align: 64, extraData: i128 9223372036854775808)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !276, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !283, templateParams: !285, identifier: "c0cb9a2e24f7da53f5237ec7bbb7e240")
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !282, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!285 = !{!183, !286}
!286 = !DITemplateTypeParameter(name: "E", type: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !288, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !289, templateParams: !23, identifier: "a391db5e1533dd9c97778a571c895338")
!288 = !DINamespace(name: "string", scope: !166)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !287, file: !2, baseType: !291, size: 192, align: 64, flags: DIFlagPrivate)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !292, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !293, templateParams: !318, identifier: "5eeffe5c8759a91ecea2395996ca4803")
!292 = !DINamespace(name: "vec", scope: !166)
!293 = !{!294, !320}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !291, file: !2, baseType: !295, size: 128, align: 64, flags: DIFlagPrivate)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !165, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !296, templateParams: !318, identifier: "e3a1c33ec7c5ab794d7cc23cda5d1ffd")
!296 = !{!297, !311, !315}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !295, file: !2, baseType: !298, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !299, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !300, templateParams: !306, identifier: "5576e714cda244bc7fd48da241c2cd71")
!299 = !DINamespace(name: "unique", scope: !97)
!300 = !{!301, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !298, file: !2, baseType: !302, size: 64, align: 64, flags: DIFlagPrivate)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !303, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !304, templateParams: !306, identifier: "a4acf166b74ef43af1db8d6335ca167e")
!303 = !DINamespace(name: "non_null", scope: !97)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !302, file: !2, baseType: !221, size: 64, align: 64, flags: DIFlagPrivate)
!306 = !{!307}
!307 = !DITemplateTypeParameter(name: "T", type: !69)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !298, file: !2, baseType: !309, align: 8, offset: 64, flags: DIFlagPrivate)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !310, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !306, identifier: "1bed48daca504789908cb96b32f89e65")
!310 = !DINamespace(name: "marker", scope: !40)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !295, file: !2, baseType: !312, size: 64, align: 64, flags: DIFlagPrivate)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !165, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !313, templateParams: !23, identifier: "62de598dd28eaf1c7c0f61ca013e23b")
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !312, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !295, file: !2, baseType: !316, align: 8, offset: 128, flags: DIFlagPrivate)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !317, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "14de19725ec4b1fd38fae074afd4da08")
!317 = !DINamespace(name: "alloc", scope: !166)
!318 = !{!307, !319}
!319 = !DITemplateTypeParameter(name: "A", type: !316)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !291, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !279, file: !2, baseType: !322, size: 192, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !276, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !323, templateParams: !285, identifier: "46978f7b0b81304f4fdb3e4d3bb09dab")
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !322, file: !2, baseType: !287, size: 192, align: 64, flags: DIFlagPublic)
!325 = !DIDerivedType(tag: DW_TAG_member, scope: !276, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagArtificial)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !327, file: !2, align: 8, elements: !23, identifier: "37a962499e5bd0bd95bada6599197fad")
!327 = !DINamespace(name: "bench_fill_uninit", scope: !328)
!328 = !DINamespace(name: "p384", scope: !329)
!329 = !DINamespace(name: "buffer", scope: null)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut test::bench::Bencher", baseType: !331, size: 64, align: 64, dwarfAddressSpace: 0)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bencher", scope: !332, file: !2, size: 1088, align: 64, flags: DIFlagPublic, elements: !333, templateParams: !23, identifier: "a822bc9ab46b50c9b755d71a74279080")
!332 = !DINamespace(name: "bench", scope: !68)
!333 = !{!334, !335, !371}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !331, file: !2, baseType: !66, size: 8, align: 8, offset: 1024, flags: DIFlagPrivate)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "summary", scope: !331, file: !2, baseType: !336, size: 960, align: 64, flags: DIFlagPrivate)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<test::stats::Summary>", scope: !337, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !338, templateParams: !23, identifier: "e5ff6f0ba62c227d8ac57dbad097a4c")
!337 = !DINamespace(name: "option", scope: !40)
!338 = !{!339}
!339 = !DICompositeType(tag: DW_TAG_variant_part, scope: !336, file: !2, size: 960, align: 64, elements: !340, templateParams: !23, identifier: "6a626eeefd544ca9e728588e1937fe2b", discriminator: !370)
!340 = !{!341, !366}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !339, file: !2, baseType: !342, size: 960, align: 64, extraData: i128 0)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !336, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !343, identifier: "709ec808d2bc44f72a89af3384b76049")
!343 = !{!344}
!344 = !DITemplateTypeParameter(name: "T", type: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Summary", scope: !346, file: !2, size: 896, align: 64, flags: DIFlagPublic, elements: !347, templateParams: !23, identifier: "a4931c5ff9183f6e565f4d62dd740678")
!346 = !DINamespace(name: "stats", scope: !68)
!347 = !{!348, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !365}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !345, file: !2, baseType: !349, size: 64, align: 64, flags: DIFlagPublic)
!349 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "median", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "std_dev", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "std_dev_pct", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "median_abs_dev", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "median_abs_dev_pct", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "quartiles", scope: !345, file: !2, baseType: !360, size: 192, align: 64, offset: 640, flags: DIFlagPublic)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "(f64, f64, f64)", file: !2, size: 192, align: 64, elements: !361, templateParams: !23, identifier: "2efe05af7275e7a6c57c227a62758eef")
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !360, file: !2, baseType: !349, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !360, file: !2, baseType: !349, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !360, file: !2, baseType: !349, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "iqr", scope: !345, file: !2, baseType: !349, size: 64, align: 64, offset: 832, flags: DIFlagPublic)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !339, file: !2, baseType: !367, size: 960, align: 64, extraData: i128 1)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !336, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !368, templateParams: !343, identifier: "93cf78652a47ba0b3f387f75d7027005")
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !367, file: !2, baseType: !345, size: 896, align: 64, offset: 64, flags: DIFlagPublic)
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagArtificial)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !331, file: !2, baseType: !98, size: 64, align: 64, offset: 960, flags: DIFlagPublic)
!372 = !{!373, !374}
!373 = !DILocalVariable(arg: 1, scope: !273, file: !187, line: 250, type: !326)
!374 = !DILocalVariable(arg: 2, scope: !273, file: !187, line: 250, type: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&mut test::bench::Bencher)", file: !2, size: 64, align: 64, elements: !376, templateParams: !23, identifier: "94dca58bbda53662b7ef8aece1fa17e5")
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !375, file: !2, baseType: !330, size: 64, align: 64)
!378 = !{!379, !380}
!379 = !DITemplateTypeParameter(name: "Self", type: !326)
!380 = !DITemplateTypeParameter(name: "Args", type: !375)
!381 = !{i32 4}
!382 = !DILocation(line: 0, scope: !273)
!383 = !DILocation(line: 250, column: 5, scope: !273)
!384 = !{!385}
!385 = distinct !{!385, !386, !"_ZN6buffer4p38417bench_fill_uninit28_$u7b$$u7b$closure$u7d$$u7d$17h059d8a21847abf81E: %_0"}
!386 = distinct !{!386, !"_ZN6buffer4p38417bench_fill_uninit28_$u7b$$u7b$closure$u7d$$u7d$17h059d8a21847abf81E"}
!387 = !{!388}
!388 = distinct !{!388, !386, !"_ZN6buffer4p38417bench_fill_uninit28_$u7b$$u7b$closure$u7d$$u7d$17h059d8a21847abf81E: %b"}
!389 = !DILocalVariable(arg: 1, scope: !390, file: !391, line: 93, type: !394)
!390 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN6buffer4p38417bench_fill_uninit28_$u7b$$u7b$closure$u7d$$u7d$17h059d8a21847abf81E", scope: !327, file: !391, line: 93, type: !392, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !395)
!391 = !DIFile(filename: "benches/buffer.rs", directory: "/home/arsalan/Documents/Github/unsafe-dyn-rust-expr/lib/finalcrates/Crates-Versions/getrandom-0.3.2", checksumkind: CSK_MD5, checksum: "7c6bde0492614968a91ec04ad541bc13")
!392 = !DISubroutineType(types: !393)
!393 = !{!276, !394, !330}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&buffer::p384::bench_fill_uninit::{closure_env#0}", baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !{!396, !389}
!396 = !DILocalVariable(name: "b", arg: 2, scope: !390, file: !391, line: 93, type: !330)
!397 = !DILocation(line: 0, scope: !390, inlinedAt: !398)
!398 = distinct !DILocation(line: 250, column: 5, scope: !273)
!399 = !{!400}
!400 = distinct !{!400, !401, !"_ZN6buffer4p38417bench_fill_uninit17h5b86ada44a3acc43E: %b"}
!401 = distinct !{!401, !"_ZN6buffer4p38417bench_fill_uninit17h5b86ada44a3acc43E"}
!402 = !DILocation(line: 93, column: 60, scope: !390, inlinedAt: !398)
!403 = !DILocalVariable(name: "b", arg: 1, scope: !404, file: !391, line: 93, type: !330)
!404 = distinct !DISubprogram(name: "bench_fill_uninit", linkageName: "_ZN6buffer4p38417bench_fill_uninit17h5b86ada44a3acc43E", scope: !328, file: !391, line: 93, type: !405, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !407)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !330}
!407 = !{!403}
!408 = !DILocation(line: 0, scope: !404, inlinedAt: !409)
!409 = distinct !DILocation(line: 93, column: 60, scope: !390, inlinedAt: !398)
!410 = !DILocation(line: 99, column: 17, scope: !404, inlinedAt: !409)
!411 = !{!400, !388}
!412 = !{!413}
!413 = distinct !{!413, !414, !"_ZN4test5bench7Bencher4iter17hb8755d972fb4411dE: %self"}
!414 = distinct !{!414, !"_ZN4test5bench7Bencher4iter17hb8755d972fb4411dE"}
!415 = !DILocation(line: 100, column: 17, scope: !404, inlinedAt: !409)
!416 = !DILocalVariable(name: "other", scope: !417, file: !418, line: 4, type: !424, align: 8)
!417 = distinct !DILexicalBlock(scope: !419, file: !418, line: 4, column: 17)
!418 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/test/src/options.rs", directory: "", checksumkind: CSK_MD5, checksum: "bf2cc37980920333490ff9ef0d0fd3a7")
!419 = distinct !DISubprogram(name: "eq", linkageName: "_ZN65_$LT$test..options..BenchMode$u20$as$u20$core..cmp..PartialEq$GT$2eq17h451bd075f0a13002E", scope: !420, file: !418, line: 4, type: !421, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !425)
!420 = !DINamespace(name: "{impl#3}", scope: !67)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !424, !424}
!423 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&test::options::BenchMode", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !{!426, !416, !427, !429}
!426 = !DILocalVariable(name: "self", arg: 1, scope: !417, file: !418, line: 4, type: !424)
!427 = !DILocalVariable(name: "__self_discr", scope: !428, file: !418, line: 4, type: !219, align: 8)
!428 = distinct !DILexicalBlock(scope: !417, file: !418, line: 4, column: 17)
!429 = !DILocalVariable(name: "__arg1_discr", scope: !430, file: !418, line: 4, type: !219, align: 8)
!430 = distinct !DILexicalBlock(scope: !428, file: !418, line: 4, column: 17)
!431 = !DILocation(line: 0, scope: !417, inlinedAt: !432)
!432 = distinct !DILocation(line: 44, column: 12, scope: !433, inlinedAt: !444)
!433 = distinct !DISubprogram(name: "iter<(), fn()>", linkageName: "_ZN4test5bench7Bencher4iter17hb8755d972fb4411dE", scope: !331, file: !434, line: 40, type: !435, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !439, declaration: !438, retainedNodes: !441)
!434 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/test/src/bench.rs", directory: "", checksumkind: CSK_MD5, checksum: "9b38643a7cfe51abaa53a3a8092fecf8")
!435 = !DISubroutineType(types: !436)
!436 = !{null, !330, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, align: 1, dwarfAddressSpace: 0)
!438 = !DISubprogram(name: "iter<(), fn()>", linkageName: "_ZN4test5bench7Bencher4iter17hb8755d972fb4411dE", scope: !331, file: !434, line: 40, type: !435, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !439)
!439 = !{!183, !440}
!440 = !DITemplateTypeParameter(name: "F", type: !437)
!441 = !{!442, !443}
!442 = !DILocalVariable(name: "self", arg: 1, scope: !433, file: !434, line: 40, type: !330)
!443 = !DILocalVariable(name: "inner", arg: 2, scope: !433, file: !434, line: 40, type: !437)
!444 = distinct !DILocation(line: 100, column: 17, scope: !404, inlinedAt: !409)
!445 = !DILocation(line: 0, scope: !433, inlinedAt: !444)
!446 = !DILocation(line: 40, column: 34, scope: !433, inlinedAt: !444)
!447 = !DILocation(line: 4, column: 17, scope: !417, inlinedAt: !432)
!448 = !{i8 0, i8 2}
!449 = !{!413, !400, !388}
!450 = !DILocation(line: 44, column: 12, scope: !433, inlinedAt: !444)
!451 = !DILocalVariable(name: "inner", arg: 1, scope: !452, file: !434, line: 114, type: !455)
!452 = distinct !DISubprogram(name: "ns_iter_inner<(), fn()>", linkageName: "_ZN4test5bench13ns_iter_inner17hc34fdc63a7baf76cE", scope: !332, file: !434, line: 114, type: !453, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !439, retainedNodes: !456)
!453 = !DISubroutineType(types: !454)
!454 = !{!98, !455, !98}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut fn()", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!456 = !{!451, !457, !458, !480}
!457 = !DILocalVariable(name: "k", arg: 2, scope: !452, file: !434, line: 114, type: !98)
!458 = !DILocalVariable(name: "start", scope: !459, file: !434, line: 118, type: !460, align: 8)
!459 = distinct !DILexicalBlock(scope: !452, file: !434, line: 118, column: 5)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "Instant", scope: !461, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !462, templateParams: !23, identifier: "a1af9a6f59182c43b7f40bb485d4895c")
!461 = !DINamespace(name: "time", scope: !17)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !460, file: !2, baseType: !464, size: 128, align: 64, flags: DIFlagPrivate)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Instant", scope: !465, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !469, templateParams: !23, identifier: "6a79d88fe16b06f569b2a1495770bf9c")
!465 = !DINamespace(name: "time", scope: !466)
!466 = !DINamespace(name: "unix", scope: !467)
!467 = !DINamespace(name: "pal", scope: !468)
!468 = !DINamespace(name: "sys", scope: !17)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !464, file: !2, baseType: !471, size: 128, align: 64, flags: DIFlagPrivate)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "Timespec", scope: !465, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !472, templateParams: !23, identifier: "713fd4c4d92360449b629588da718a41")
!472 = !{!473, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !471, file: !2, baseType: !474, size: 64, align: 64, flags: DIFlagPrivate)
!474 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !471, file: !2, baseType: !476, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !465, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !477, templateParams: !23, identifier: "34cd0a5e1340b1d71313099b10c73024")
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !476, file: !2, baseType: !479, size: 32, align: 32, flags: DIFlagPrivate)
!479 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!480 = !DILocalVariable(name: "iter", scope: !481, file: !434, line: 119, type: !482, align: 8)
!481 = distinct !DILexicalBlock(scope: !459, file: !434, line: 119, column: 5)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<u64>", scope: !483, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !484, templateParams: !487, identifier: "d2e5f17ef6ac663932d5c05e5dd12945")
!483 = !DINamespace(name: "range", scope: !190)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !482, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagPublic)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !482, file: !2, baseType: !98, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!487 = !{!488}
!488 = !DITemplateTypeParameter(name: "Idx", type: !98)
!489 = !DILocation(line: 0, scope: !452, inlinedAt: !490)
!490 = distinct !DILocation(line: 45, column: 13, scope: !433, inlinedAt: !444)
!491 = !DILocation(line: 118, column: 9, scope: !459, inlinedAt: !490)
!492 = !DILocalVariable(name: "dummy", arg: 1, scope: !493, file: !434, line: 22, type: !7)
!493 = distinct !DILexicalBlock(scope: !494, file: !434, line: 22, column: 1)
!494 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4test5bench9black_box17hfa14700fd503b36bE", scope: !332, file: !434, line: 22, type: !203, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !206, retainedNodes: !495)
!495 = !{!492}
!496 = !DILocation(line: 22, column: 21, scope: !493, inlinedAt: !497)
!497 = distinct !DILocation(line: 120, column: 9, scope: !481, inlinedAt: !490)
!498 = !DILocalVariable(name: "dummy", arg: 1, scope: !499, file: !200, line: 337, type: !7)
!499 = distinct !DILexicalBlock(scope: !500, file: !200, line: 337, column: 1)
!500 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17hea04605bd231d4fbE", scope: !202, file: !200, line: 337, type: !203, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !206, retainedNodes: !501)
!501 = !{!498}
!502 = !DILocation(line: 337, column: 27, scope: !499, inlinedAt: !503)
!503 = distinct !DILocation(line: 23, column: 5, scope: !493, inlinedAt: !497)
!504 = !DILocation(line: 118, column: 9, scope: !452, inlinedAt: !490)
!505 = !{!413, !400, !385, !388}
!506 = !DILocation(line: 118, column: 17, scope: !452, inlinedAt: !490)
!507 = !DILocation(line: 0, scope: !481, inlinedAt: !490)
!508 = !DILocalVariable(name: "self", arg: 1, scope: !509, file: !510, line: 843, type: !530)
!509 = distinct !DILexicalBlock(scope: !511, file: !510, line: 843, column: 5)
!510 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/iter/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "b8d3f14c43d9898ef8d305366b66f557")
!511 = distinct !DISubprogram(name: "next<u64>", linkageName: "_ZN4core4iter5range101_$LT$impl$u20$core..iter..traits..iterator..Iterator$u20$for$u20$core..ops..range..Range$LT$A$GT$$GT$4next17h31ecad761e2870c9E", scope: !512, file: !510, line: 843, type: !515, scopeLine: 843, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !532, retainedNodes: !531)
!512 = !DINamespace(name: "{impl#6}", scope: !513)
!513 = !DINamespace(name: "range", scope: !514)
!514 = !DINamespace(name: "iter", scope: !40)
!515 = !DISubroutineType(types: !516)
!516 = !{!517, !530}
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u64>", scope: !337, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !518, templateParams: !23, identifier: "f008e7e39594f947bd516bc1a5a3714f")
!518 = !{!519}
!519 = !DICompositeType(tag: DW_TAG_variant_part, scope: !517, file: !2, size: 128, align: 64, elements: !520, templateParams: !23, identifier: "7ed18734c543623adb487ed873aa95ce", discriminator: !529)
!520 = !{!521, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !519, file: !2, baseType: !522, size: 128, align: 64, extraData: i128 0)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !517, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !523, identifier: "d4cdfc833473150abd14e35e973ed163")
!523 = !{!524}
!524 = !DITemplateTypeParameter(name: "T", type: !98)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !519, file: !2, baseType: !526, size: 128, align: 64, extraData: i128 1)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !517, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !527, templateParams: !523, identifier: "9e27587c72544c1c974640bfe8aa5266")
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !526, file: !2, baseType: !98, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!529 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagArtificial)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::ops::range::Range<u64>", baseType: !482, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !{!508}
!532 = !{!533}
!533 = !DITemplateTypeParameter(name: "A", type: !98)
!534 = !DILocation(line: 0, scope: !509, inlinedAt: !535)
!535 = distinct !DILocation(line: 119, column: 14, scope: !481, inlinedAt: !490)
!536 = !DILocalVariable(name: "self", arg: 1, scope: !537, file: !510, line: 752, type: !530)
!537 = distinct !DILexicalBlock(scope: !538, file: !510, line: 752, column: 5)
!538 = distinct !DISubprogram(name: "spec_next<u64>", linkageName: "_ZN89_$LT$core..ops..range..Range$LT$T$GT$$u20$as$u20$core..iter..range..RangeIteratorImpl$GT$9spec_next17hf07b857bad7d164dE", scope: !539, file: !510, line: 752, type: !515, scopeLine: 752, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !523, retainedNodes: !540)
!539 = !DINamespace(name: "{impl#5}", scope: !513)
!540 = !{!536, !541}
!541 = !DILocalVariable(name: "old", scope: !542, file: !510, line: 754, type: !98, align: 8)
!542 = distinct !DILexicalBlock(scope: !537, file: !510, line: 754, column: 13)
!543 = !DILocation(line: 0, scope: !537, inlinedAt: !544)
!544 = distinct !DILocation(line: 844, column: 14, scope: !509, inlinedAt: !535)
!545 = !DILocalVariable(name: "self", arg: 1, scope: !546, file: !547, line: 1565, type: !553)
!546 = distinct !DILexicalBlock(scope: !548, file: !547, line: 1565, column: 17)
!547 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "6414ad0e200e5fa763df38559e5b2a4a")
!548 = distinct !DISubprogram(name: "lt", linkageName: "_ZN4core3cmp5impls55_$LT$impl$u20$core..cmp..PartialOrd$u20$for$u20$u64$GT$2lt17h46e9a1522e201ecbE", scope: !549, file: !547, line: 1565, type: !551, scopeLine: 1565, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !554)
!549 = !DINamespace(name: "{impl#66}", scope: !550)
!550 = !DINamespace(name: "impls", scope: !60)
!551 = !DISubroutineType(types: !552)
!552 = !{!423, !553, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !98, size: 64, align: 64, dwarfAddressSpace: 0)
!554 = !{!545, !555}
!555 = !DILocalVariable(name: "other", arg: 2, scope: !546, file: !547, line: 1565, type: !553)
!556 = !DILocation(line: 0, scope: !546, inlinedAt: !557)
!557 = distinct !DILocation(line: 753, column: 12, scope: !537, inlinedAt: !544)
!558 = !DILocation(line: 0, scope: !542, inlinedAt: !544)
!559 = !DILocalVariable(name: "start", arg: 1, scope: !560, file: !510, line: 206, type: !98)
!560 = distinct !DISubprogram(name: "forward_unchecked", linkageName: "_ZN47_$LT$u64$u20$as$u20$core..iter..range..Step$GT$17forward_unchecked17hc6104ffa03ff43e4E", scope: !561, file: !510, line: 206, type: !562, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !564)
!561 = !DINamespace(name: "{impl#41}", scope: !513)
!562 = !DISubroutineType(types: !563)
!563 = !{!98, !98, !9}
!564 = !{!559, !565}
!565 = !DILocalVariable(name: "n", arg: 2, scope: !560, file: !510, line: 206, type: !9)
!566 = !DILocation(line: 0, scope: !560, inlinedAt: !567)
!567 = distinct !DILocation(line: 756, column: 35, scope: !542, inlinedAt: !544)
!568 = !DILocalVariable(name: "self", arg: 1, scope: !569, file: !570, line: 521, type: !98)
!569 = distinct !DILexicalBlock(scope: !571, file: !570, line: 521, column: 9)
!570 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "e4dc3d289178c3555c7388acbb7ca29b")
!571 = distinct !DISubprogram(name: "unchecked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$13unchecked_add17h145703a6e1effe05E", scope: !572, file: !570, line: 521, type: !573, scopeLine: 521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !575)
!572 = !DINamespace(name: "{impl#9}", scope: !39)
!573 = !DISubroutineType(types: !574)
!574 = !{!98, !98, !98}
!575 = !{!568, !576}
!576 = !DILocalVariable(name: "rhs", arg: 2, scope: !569, file: !570, line: 521, type: !98)
!577 = !DILocation(line: 0, scope: !569, inlinedAt: !578)
!578 = distinct !DILocation(line: 208, column: 28, scope: !560, inlinedAt: !567)
!579 = !DILocalVariable(arg: 1, scope: !580, file: !187, line: 166, type: !455)
!580 = distinct !DISubprogram(name: "call_mut<fn(), ()>", linkageName: "_ZN4core3ops8function5FnMut8call_mut17h8080afb344030aa2E", scope: !581, file: !187, line: 166, type: !582, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !586, retainedNodes: !584)
!581 = !DINamespace(name: "FnMut", scope: !189)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !455}
!584 = !{!579, !585}
!585 = !DILocalVariable(arg: 2, scope: !580, file: !187, line: 166, type: !7)
!586 = !{!587, !196}
!587 = !DITemplateTypeParameter(name: "Self", type: !437)
!588 = !DILocation(line: 0, scope: !580, inlinedAt: !589)
!589 = distinct !DILocation(line: 120, column: 19, scope: !481, inlinedAt: !490)
!590 = !DILocation(line: 166, column: 5, scope: !580, inlinedAt: !589)
!591 = !DILocation(line: 338, column: 5, scope: !499, inlinedAt: !503)
!592 = !DILocation(line: 122, column: 5, scope: !459, inlinedAt: !490)
!593 = !DILocalVariable(name: "self", arg: 1, scope: !594, file: !595, line: 612, type: !608)
!594 = distinct !DILexicalBlock(scope: !596, file: !595, line: 612, column: 5)
!595 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/time.rs", directory: "", checksumkind: CSK_MD5, checksum: "96459d3109f673d420caa52ba4e2aa64")
!596 = distinct !DISubprogram(name: "as_nanos", linkageName: "_ZN4core4time8Duration8as_nanos17he3d7d576c5be3ec9E", scope: !597, file: !595, line: 612, type: !605, scopeLine: 612, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, declaration: !609, retainedNodes: !610)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "Duration", scope: !598, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !599, templateParams: !23, identifier: "e6e9d820da14977b115222421f695430")
!598 = !DINamespace(name: "time", scope: !40)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "secs", scope: !597, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagPrivate)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nanos", scope: !597, file: !2, baseType: !602, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !598, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !603, templateParams: !23, identifier: "18ac0ffc1bb3876b843131ad5ec34da7")
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !602, file: !2, baseType: !479, size: 32, align: 32, flags: DIFlagPrivate)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !608}
!607 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::time::Duration", baseType: !597, size: 64, align: 64, dwarfAddressSpace: 0)
!609 = !DISubprogram(name: "as_nanos", linkageName: "_ZN4core4time8Duration8as_nanos17he3d7d576c5be3ec9E", scope: !597, file: !595, line: 612, type: !605, scopeLine: 612, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !23)
!610 = !{!593}
!611 = !DILocation(line: 0, scope: !594, inlinedAt: !612)
!612 = distinct !DILocation(line: 122, column: 21, scope: !459, inlinedAt: !490)
!613 = !DILocation(line: 123, column: 1, scope: !452, inlinedAt: !490)
!614 = !DILocation(line: 49, column: 24, scope: !433, inlinedAt: !444)
!615 = !DILocation(line: 118, column: 9, scope: !452, inlinedAt: !616)
!616 = distinct !DILocation(line: 130, column: 21, scope: !617, inlinedAt: !673)
!617 = distinct !DISubprogram(name: "iter<(), fn()>", linkageName: "_ZN4test5bench4iter17he61dab9584b3afddE", scope: !332, file: !434, line: 125, type: !618, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !439, retainedNodes: !620)
!618 = !DISubroutineType(types: !619)
!619 = !{!345, !455}
!620 = !{!621, !622, !624, !626, !628, !630, !637, !639, !659, !661, !663, !665, !667, !669, !671}
!621 = !DILocalVariable(name: "inner", arg: 1, scope: !617, file: !434, line: 125, type: !455)
!622 = !DILocalVariable(name: "ns_single", scope: !623, file: !434, line: 130, type: !98, align: 8)
!623 = distinct !DILexicalBlock(scope: !617, file: !434, line: 130, column: 5)
!624 = !DILocalVariable(name: "ns_target_total", scope: !625, file: !434, line: 134, type: !98, align: 8)
!625 = distinct !DILexicalBlock(scope: !623, file: !434, line: 134, column: 5)
!626 = !DILocalVariable(name: "n", scope: !627, file: !434, line: 135, type: !98, align: 8)
!627 = distinct !DILexicalBlock(scope: !625, file: !434, line: 135, column: 5)
!628 = !DILocalVariable(name: "total_run", scope: !629, file: !434, line: 144, type: !597, align: 8)
!629 = distinct !DILexicalBlock(scope: !627, file: !434, line: 144, column: 5)
!630 = !DILocalVariable(name: "samples", scope: !631, file: !434, line: 145, type: !632, align: 8)
!631 = distinct !DILexicalBlock(scope: !629, file: !434, line: 145, column: 5)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [f64]", file: !2, size: 128, align: 64, elements: !633, templateParams: !23, identifier: "20ddfcfce50bf865828153ff1ef46b96")
!633 = !{!634, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !632, file: !2, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !632, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!637 = !DILocalVariable(name: "loop_start", scope: !638, file: !434, line: 147, type: !460, align: 8)
!638 = distinct !DILexicalBlock(scope: !631, file: !434, line: 147, column: 9)
!639 = !DILocalVariable(name: "iter", scope: !640, file: !434, line: 149, type: !641, align: 8)
!640 = distinct !DILexicalBlock(scope: !638, file: !434, line: 149, column: 9)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "IterMut<f64>", scope: !642, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !644, templateParams: !650, identifier: "96398904b7010aa5ef15a9b57a9c44c9")
!642 = !DINamespace(name: "iter", scope: !643)
!643 = !DINamespace(name: "slice", scope: !40)
!644 = !{!645, !652, !654}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !641, file: !2, baseType: !646, size: 64, align: 64, flags: DIFlagPrivate)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<f64>", scope: !303, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !647, templateParams: !650, identifier: "d4549fe6724b82b17a2a3445e6d8daa9")
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !646, file: !2, baseType: !649, size: 64, align: 64, flags: DIFlagPrivate)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const f64", baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!650 = !{!651}
!651 = !DITemplateTypeParameter(name: "T", type: !349)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !641, file: !2, baseType: !653, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut f64", baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !641, file: !2, baseType: !655, align: 8, offset: 128, flags: DIFlagPrivate)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut f64>", scope: !310, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !656, identifier: "8da43b2178bff5a0e63bbc6fd25c929c")
!656 = !{!657}
!657 = !DITemplateTypeParameter(name: "T", type: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut f64", baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!659 = !DILocalVariable(name: "p", scope: !660, file: !434, line: 149, type: !658, align: 8)
!660 = distinct !DILexicalBlock(scope: !640, file: !434, line: 149, column: 32)
!661 = !DILocalVariable(name: "summ", scope: !662, file: !434, line: 154, type: !345, align: 8)
!662 = distinct !DILexicalBlock(scope: !638, file: !434, line: 154, column: 9)
!663 = !DILocalVariable(name: "iter", scope: !664, file: !434, line: 156, type: !641, align: 8)
!664 = distinct !DILexicalBlock(scope: !662, file: !434, line: 156, column: 9)
!665 = !DILocalVariable(name: "p", scope: !666, file: !434, line: 156, type: !658, align: 8)
!666 = distinct !DILexicalBlock(scope: !664, file: !434, line: 156, column: 32)
!667 = !DILocalVariable(name: "ns", scope: !668, file: !434, line: 157, type: !98, align: 8)
!668 = distinct !DILexicalBlock(scope: !666, file: !434, line: 157, column: 13)
!669 = !DILocalVariable(name: "summ5", scope: !670, file: !434, line: 162, type: !345, align: 8)
!670 = distinct !DILexicalBlock(scope: !662, file: !434, line: 162, column: 9)
!671 = !DILocalVariable(name: "loop_run", scope: !672, file: !434, line: 164, type: !597, align: 8)
!672 = distinct !DILexicalBlock(scope: !670, file: !434, line: 164, column: 9)
!673 = distinct !DILocation(line: 49, column: 29, scope: !433, inlinedAt: !444)
!674 = !DILocalVariable(name: "self", arg: 1, scope: !675, file: !676, line: 895, type: !678)
!675 = distinct !DILexicalBlock(scope: !677, file: !676, line: 895, column: 5)
!676 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "1839402b3e3d27abc7bbff44f5b669ff")
!677 = distinct !DISubprogram(name: "expect<core::time::Duration>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h867238edee146d6eE", scope: !678, file: !676, line: 895, type: !691, scopeLine: 895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !684, declaration: !706, retainedNodes: !707)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::time::Duration>", scope: !337, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !679, templateParams: !23, identifier: "2f5efc9b7741e6cc64eddb3c11d26bd0")
!679 = !{!680}
!680 = !DICompositeType(tag: DW_TAG_variant_part, scope: !678, file: !2, size: 128, align: 64, elements: !681, templateParams: !23, identifier: "1751be3d3a3dc2ec1600f0c000c9ba31", discriminator: !690)
!681 = !{!682, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !680, file: !2, baseType: !683, size: 128, align: 64, extraData: i128 1000000000)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !678, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !684, identifier: "130d1c209109b8d59bce9dabfec61711")
!684 = !{!685}
!685 = !DITemplateTypeParameter(name: "T", type: !597)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !680, file: !2, baseType: !687, size: 128, align: 64)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !678, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !688, templateParams: !684, identifier: "d01d1302511e161497995383d38955c3")
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !687, file: !2, baseType: !597, size: 128, align: 64, flags: DIFlagPublic)
!690 = !DIDerivedType(tag: DW_TAG_member, scope: !678, file: !2, baseType: !479, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!691 = !DISubroutineType(types: !692)
!692 = !{!597, !678, !693, !698}
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !694, templateParams: !23, identifier: "9277eecd40495f85161460476aacc992")
!694 = !{!695, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !693, file: !2, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !693, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !699, size: 64, align: 64, dwarfAddressSpace: 0)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !700, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !702, templateParams: !23, identifier: "83f60b789274e9dfe5288fdb9ee764d1")
!700 = !DINamespace(name: "location", scope: !701)
!701 = !DINamespace(name: "panic", scope: !40)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !699, file: !2, baseType: !693, size: 128, align: 64, flags: DIFlagPrivate)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !699, file: !2, baseType: !479, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !699, file: !2, baseType: !479, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!706 = !DISubprogram(name: "expect<core::time::Duration>", linkageName: "_ZN4core6option15Option$LT$T$GT$6expect17h867238edee146d6eE", scope: !678, file: !676, line: 895, type: !691, scopeLine: 895, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !684)
!707 = !{!674, !708, !709}
!708 = !DILocalVariable(name: "msg", scope: !675, file: !676, line: 895, type: !693, align: 8)
!709 = !DILocalVariable(name: "val", scope: !710, file: !676, line: 897, type: !597, align: 8)
!710 = distinct !DILexicalBlock(scope: !675, file: !676, line: 897, column: 13)
!711 = !DILocation(line: 895, column: 25, scope: !675, inlinedAt: !712)
!712 = distinct !DILocation(line: 1132, column: 31, scope: !713, inlinedAt: !721)
!713 = distinct !DILexicalBlock(scope: !714, file: !595, line: 1131, column: 5)
!714 = distinct !DISubprogram(name: "add", linkageName: "_ZN62_$LT$core..time..Duration$u20$as$u20$core..ops..arith..Add$GT$3add17h8ea48ab9dce2d425E", scope: !715, file: !595, line: 1131, type: !716, scopeLine: 1131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !718)
!715 = !DINamespace(name: "{impl#3}", scope: !598)
!716 = !DISubroutineType(types: !717)
!717 = !{!597, !597, !597}
!718 = !{!719, !720}
!719 = !DILocalVariable(name: "self", arg: 1, scope: !713, file: !595, line: 1131, type: !597)
!720 = !DILocalVariable(name: "rhs", arg: 2, scope: !713, file: !595, line: 1131, type: !597)
!721 = distinct !DILocation(line: 1140, column: 17, scope: !722, inlinedAt: !731)
!722 = distinct !DILexicalBlock(scope: !723, file: !595, line: 1139, column: 5)
!723 = distinct !DISubprogram(name: "add_assign", linkageName: "_ZN68_$LT$core..time..Duration$u20$as$u20$core..ops..arith..AddAssign$GT$10add_assign17hf7546271d50acb9aE", scope: !724, file: !595, line: 1139, type: !725, scopeLine: 1139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !728)
!724 = !DINamespace(name: "{impl#4}", scope: !598)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727, !597}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::time::Duration", baseType: !597, size: 64, align: 64, dwarfAddressSpace: 0)
!728 = !{!729, !730}
!729 = !DILocalVariable(name: "self", arg: 1, scope: !722, file: !595, line: 1139, type: !727)
!730 = !DILocalVariable(name: "rhs", arg: 2, scope: !722, file: !595, line: 1139, type: !597)
!731 = distinct !DILocation(line: 175, column: 9, scope: !672, inlinedAt: !673)
!732 = !DILocation(line: 144, column: 9, scope: !629, inlinedAt: !673)
!733 = !DILocation(line: 0, scope: !625, inlinedAt: !673)
!734 = !DILocalVariable(name: "v1", scope: !735, file: !547, line: 1334, type: !98, align: 8)
!735 = distinct !DILexicalBlock(scope: !736, file: !547, line: 1334, column: 1)
!736 = distinct !DISubprogram(name: "max<u64>", linkageName: "_ZN4core3cmp3max17h8112a050d7d520cfE", scope: !60, file: !547, line: 1334, type: !573, scopeLine: 1334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !523, retainedNodes: !737)
!737 = !{!734, !738, !739, !741}
!738 = !DILocalVariable(name: "v2", arg: 2, scope: !735, file: !547, line: 1334, type: !98)
!739 = !DILocalVariable(name: "v1", scope: !740, file: !547, line: 1334, type: !98, align: 8)
!740 = distinct !DILexicalBlock(scope: !736, file: !547, line: 1334, column: 1)
!741 = !DILocalVariable(name: "v2", arg: 2, scope: !740, file: !547, line: 1334, type: !98)
!742 = !DILocation(line: 0, scope: !735, inlinedAt: !743)
!743 = distinct !DILocation(line: 135, column: 35, scope: !625, inlinedAt: !673)
!744 = !DILocalVariable(name: "self", scope: !745, file: !547, line: 856, type: !98, align: 8)
!745 = distinct !DILexicalBlock(scope: !746, file: !547, line: 856, column: 5)
!746 = distinct !DISubprogram(name: "max<u64>", linkageName: "_ZN4core3cmp3Ord3max17h4bbbf06c24464138E", scope: !747, file: !547, line: 856, type: !573, scopeLine: 856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !753, retainedNodes: !748)
!747 = !DINamespace(name: "Ord", scope: !60)
!748 = !{!744, !749, !750, !752}
!749 = !DILocalVariable(name: "other", arg: 2, scope: !745, file: !547, line: 856, type: !98)
!750 = !DILocalVariable(name: "self", scope: !751, file: !547, line: 856, type: !98, align: 8)
!751 = distinct !DILexicalBlock(scope: !746, file: !547, line: 856, column: 5)
!752 = !DILocalVariable(name: "other", arg: 2, scope: !751, file: !547, line: 856, type: !98)
!753 = !{!754}
!754 = !DITemplateTypeParameter(name: "Self", type: !98)
!755 = !DILocation(line: 0, scope: !745, inlinedAt: !756)
!756 = distinct !DILocation(line: 1335, column: 8, scope: !735, inlinedAt: !743)
!757 = !DILocation(line: 0, scope: !740, inlinedAt: !758)
!758 = distinct !DILocation(line: 142, column: 9, scope: !627, inlinedAt: !673)
!759 = !DILocation(line: 0, scope: !751, inlinedAt: !760)
!760 = distinct !DILocation(line: 1335, column: 8, scope: !740, inlinedAt: !758)
!761 = !DILocation(line: 0, scope: !675, inlinedAt: !712)
!762 = !DILocation(line: 0, scope: !617, inlinedAt: !673)
!763 = !DILocation(line: 147, column: 13, scope: !638, inlinedAt: !673)
!764 = !DILocation(line: 154, column: 13, scope: !662, inlinedAt: !673)
!765 = !DILocation(line: 162, column: 13, scope: !670, inlinedAt: !673)
!766 = !DILocation(line: 0, scope: !452, inlinedAt: !616)
!767 = !DILocation(line: 118, column: 9, scope: !459, inlinedAt: !616)
!768 = !DILocation(line: 22, column: 21, scope: !493, inlinedAt: !769)
!769 = distinct !DILocation(line: 120, column: 9, scope: !481, inlinedAt: !616)
!770 = !DILocation(line: 337, column: 27, scope: !499, inlinedAt: !771)
!771 = distinct !DILocation(line: 23, column: 5, scope: !493, inlinedAt: !769)
!772 = !{!773, !413, !400, !385, !388}
!773 = distinct !{!773, !774, !"_ZN4test5bench4iter17he61dab9584b3afddE: %_0"}
!774 = distinct !{!774, !"_ZN4test5bench4iter17he61dab9584b3afddE"}
!775 = !DILocation(line: 118, column: 17, scope: !452, inlinedAt: !616)
!776 = !DILocation(line: 0, scope: !481, inlinedAt: !616)
!777 = !DILocation(line: 0, scope: !509, inlinedAt: !778)
!778 = distinct !DILocation(line: 119, column: 14, scope: !481, inlinedAt: !616)
!779 = !DILocation(line: 0, scope: !537, inlinedAt: !780)
!780 = distinct !DILocation(line: 844, column: 14, scope: !509, inlinedAt: !778)
!781 = !DILocation(line: 0, scope: !546, inlinedAt: !782)
!782 = distinct !DILocation(line: 753, column: 12, scope: !537, inlinedAt: !780)
!783 = !DILocation(line: 0, scope: !542, inlinedAt: !780)
!784 = !DILocation(line: 0, scope: !560, inlinedAt: !785)
!785 = distinct !DILocation(line: 756, column: 35, scope: !542, inlinedAt: !780)
!786 = !DILocation(line: 0, scope: !569, inlinedAt: !787)
!787 = distinct !DILocation(line: 208, column: 28, scope: !560, inlinedAt: !785)
!788 = !DILocation(line: 0, scope: !580, inlinedAt: !789)
!789 = distinct !DILocation(line: 120, column: 19, scope: !481, inlinedAt: !616)
!790 = !DILocation(line: 166, column: 5, scope: !580, inlinedAt: !789)
!791 = !DILocation(line: 338, column: 5, scope: !499, inlinedAt: !771)
!792 = !DILocation(line: 122, column: 5, scope: !459, inlinedAt: !616)
!793 = !DILocation(line: 0, scope: !594, inlinedAt: !794)
!794 = distinct !DILocation(line: 122, column: 21, scope: !459, inlinedAt: !616)
!795 = !DILocation(line: 613, column: 9, scope: !594, inlinedAt: !794)
!796 = !DILocation(line: 613, column: 53, scope: !594, inlinedAt: !794)
!797 = !DILocation(line: 123, column: 1, scope: !452, inlinedAt: !616)
!798 = !DILocation(line: 0, scope: !623, inlinedAt: !673)
!799 = !DILocalVariable(name: "v1", arg: 1, scope: !800, file: !547, line: 1356, type: !98)
!800 = distinct !DISubprogram(name: "max_by<u64, fn(&u64, &u64) -> core::cmp::Ordering>", linkageName: "_ZN4core3cmp6max_by17h08972408f5dedf6cE", scope: !60, file: !547, line: 1356, type: !801, scopeLine: 1356, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !809, retainedNodes: !806)
!801 = !DISubroutineType(types: !802)
!802 = !{!98, !98, !98, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&u64, &u64) -> core::cmp::Ordering", baseType: !804, align: 1, dwarfAddressSpace: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!59, !553, !553}
!806 = !{!799, !807, !808}
!807 = !DILocalVariable(name: "v2", arg: 2, scope: !800, file: !547, line: 1356, type: !98)
!808 = !DILocalVariable(name: "compare", arg: 3, scope: !800, file: !547, line: 1356, type: !803)
!809 = !{!524, !810}
!810 = !DITemplateTypeParameter(name: "F", type: !803)
!811 = !DILocation(line: 0, scope: !800, inlinedAt: !812)
!812 = distinct !DILocation(line: 860, column: 9, scope: !745, inlinedAt: !756)
!813 = !DILocation(line: 1356, column: 63, scope: !800, inlinedAt: !812)
!814 = !DILocation(line: 135, column: 17, scope: !625, inlinedAt: !673)
!815 = !DILocation(line: 0, scope: !627, inlinedAt: !673)
!816 = !DILocation(line: 0, scope: !800, inlinedAt: !817)
!817 = distinct !DILocation(line: 860, column: 9, scope: !751, inlinedAt: !760)
!818 = !DILocation(line: 1356, column: 63, scope: !800, inlinedAt: !817)
!819 = !DILocalVariable(name: "pieces", scope: !820, file: !821, line: 341, type: !953, align: 8)
!820 = distinct !DILexicalBlock(scope: !822, file: !821, line: 341, column: 5)
!821 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "d0edb1b569d2fa74945fd472d62c28dc")
!822 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17hed9b362d7a5a2e7aE", scope: !823, file: !821, line: 341, type: !951, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, declaration: !957, retainedNodes: !958)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !89, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !824, templateParams: !23, identifier: "9e704405b34582ebb3470a1c13bd9db9")
!824 = !{!825, !831, !874}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !823, file: !2, baseType: !826, size: 128, align: 64, flags: DIFlagPrivate)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !827, templateParams: !23, identifier: "4e66b00a376d6af5b8765440fb2839f")
!827 = !{!828, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !826, file: !2, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64, dwarfAddressSpace: 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !826, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !823, file: !2, baseType: !832, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !337, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !833, templateParams: !23, identifier: "acabcc1b7bd4719d706813ad6d80c3d7")
!833 = !{!834}
!834 = !DICompositeType(tag: DW_TAG_variant_part, scope: !832, file: !2, size: 128, align: 64, elements: !835, templateParams: !23, identifier: "dd05c4ee4c2e38c06d561d4e248feb00", discriminator: !873)
!835 = !{!836, !869}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !834, file: !2, baseType: !837, size: 128, align: 64, extraData: i128 0)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !832, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !838, identifier: "c062391546990b9ae716e587a9c44107")
!838 = !{!839}
!839 = !DITemplateTypeParameter(name: "T", type: !840)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !841, templateParams: !23, identifier: "b54822f8ab837696ce5d89e4ff34e4")
!841 = !{!842, !868}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !840, file: !2, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64, align: 64, dwarfAddressSpace: 0)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !88, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !845, templateParams: !23, identifier: "402846c0893391618e34a15e0598c24e")
!845 = !{!846, !847, !849, !850, !851, !867}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !844, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !844, file: !2, baseType: !848, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!848 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !844, file: !2, baseType: !87, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !844, file: !2, baseType: !479, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !844, file: !2, baseType: !852, size: 128, align: 64, flags: DIFlagPublic)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !88, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !853, templateParams: !23, identifier: "96baf840e1f8d764ce54f1c6c9bdf0b")
!853 = !{!854}
!854 = !DICompositeType(tag: DW_TAG_variant_part, scope: !852, file: !2, size: 128, align: 64, elements: !855, templateParams: !23, identifier: "96fecae849037968fdad1729d3166571", discriminator: !866)
!855 = !{!856, !860, !864}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !854, file: !2, baseType: !857, size: 128, align: 64, extraData: i128 0)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !852, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !858, templateParams: !23, identifier: "31b1793b9462fa2a0086bd24e2e7ff3")
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !857, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !854, file: !2, baseType: !861, size: 128, align: 64, extraData: i128 1)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !852, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !862, templateParams: !23, identifier: "eb3fa78e55888cd9ef977a5980f76242")
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !861, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !854, file: !2, baseType: !865, size: 128, align: 64, extraData: i128 2)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !852, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, identifier: "844235131be8a6898de5150ba908049f")
!866 = !DIDerivedType(tag: DW_TAG_member, scope: !852, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagArtificial)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !844, file: !2, baseType: !852, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !840, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !834, file: !2, baseType: !870, size: 128, align: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !832, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !871, templateParams: !838, identifier: "1edec86471cb3ab18fcf6db57290f2c3")
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !870, file: !2, baseType: !840, size: 128, align: 64, flags: DIFlagPublic)
!873 = !DIDerivedType(tag: DW_TAG_member, scope: !832, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagArtificial)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !823, file: !2, baseType: !875, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !876, templateParams: !23, identifier: "baf028fc654408299b6dd770f089fd48")
!876 = !{!877, !950}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !875, file: !2, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64, dwarfAddressSpace: 0)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !88, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !880, templateParams: !23, identifier: "ea30845f9c2e800d490a88a633f9f2e8")
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !879, file: !2, baseType: !882, size: 128, align: 64, flags: DIFlagPrivate)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !88, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !883, templateParams: !23, identifier: "bc8651393a0b5f74d78d4fb85720f77c")
!883 = !{!884}
!884 = !DICompositeType(tag: DW_TAG_variant_part, scope: !882, file: !2, size: 128, align: 64, elements: !885, templateParams: !23, identifier: "f3795d331cb7cad72e67688f1687ff00", discriminator: !949)
!885 = !{!886, !945}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !884, file: !2, baseType: !887, size: 128, align: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !882, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !888, templateParams: !23, identifier: "7c7df21330d573ca4eefe40395fd691")
!888 = !{!889, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !887, file: !2, baseType: !890, size: 64, align: 64, flags: DIFlagPrivate)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !891, size: 64, align: 64, dwarfAddressSpace: 0)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !892, file: !2, align: 8, elements: !23, identifier: "728a64207294457ae982b2390ae8a902")
!892 = !DINamespace(name: "{extern#0}", scope: !88)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !887, file: !2, baseType: !894, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !895, size: 64, align: 64, dwarfAddressSpace: 0)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !890, !913}
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !277, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !898, templateParams: !23, identifier: "d2df09569ea43718984b3f07c77d7786")
!898 = !{!899}
!899 = !DICompositeType(tag: DW_TAG_variant_part, scope: !897, file: !2, size: 8, align: 8, elements: !900, templateParams: !23, identifier: "40958ab10d5ab8e62b4ee93eba9ef45c", discriminator: !912)
!900 = !{!901, !908}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !899, file: !2, baseType: !902, size: 8, align: 8, extraData: i128 0)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !897, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !903, templateParams: !905, identifier: "4e4e31cf1f685b1037dee0567f64f8e3")
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !902, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!905 = !{!183, !906}
!906 = !DITemplateTypeParameter(name: "E", type: !907)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !89, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "d1bcdb152c867d841c7efe41d66d33d4")
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !899, file: !2, baseType: !909, size: 8, align: 8, extraData: i128 1)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !897, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !910, templateParams: !905, identifier: "ce193e126833ab95abfa1a39e1f007d3")
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !909, file: !2, baseType: !907, align: 8, offset: 8, flags: DIFlagPublic)
!912 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !2, baseType: !69, size: 8, align: 8, flags: DIFlagArtificial)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !914, size: 64, align: 64, dwarfAddressSpace: 0)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !89, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !915, templateParams: !23, identifier: "9d9578b0f9368582a2201563ca126cd4")
!915 = !{!916, !917, !918, !919, !933, !934}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !914, file: !2, baseType: !479, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !914, file: !2, baseType: !848, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !914, file: !2, baseType: !87, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !914, file: !2, baseType: !920, size: 128, align: 64, flags: DIFlagPrivate)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !337, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !921, templateParams: !23, identifier: "3850c4a210aea148b16f79ec227c427")
!921 = !{!922}
!922 = !DICompositeType(tag: DW_TAG_variant_part, scope: !920, file: !2, size: 128, align: 64, elements: !923, templateParams: !23, identifier: "6c7b2307de4883471488feb0db3e2a69", discriminator: !932)
!923 = !{!924, !928}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !922, file: !2, baseType: !925, size: 128, align: 64, extraData: i128 0)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !920, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !926, identifier: "10be3845cc366e59d680126f255dea8b")
!926 = !{!927}
!927 = !DITemplateTypeParameter(name: "T", type: !9)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !922, file: !2, baseType: !929, size: 128, align: 64, extraData: i128 1)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !920, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !930, templateParams: !926, identifier: "d166501012b6febc55685f1b3285acb8")
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !929, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!932 = !DIDerivedType(tag: DW_TAG_member, scope: !920, file: !2, baseType: !98, size: 64, align: 64, flags: DIFlagArtificial)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !914, file: !2, baseType: !920, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !914, file: !2, baseType: !935, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !936, templateParams: !23, identifier: "520aa1b9e061cb89ffd1fd9508a7967b")
!936 = !{!937, !940}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !935, file: !2, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64, dwarfAddressSpace: 0)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "50c895c6de0895b9c205e9fbf62784f2")
!940 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !935, file: !2, baseType: !941, size: 64, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !942, size: 64, align: 64, dwarfAddressSpace: 0)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 6, lowerBound: 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !884, file: !2, baseType: !946, size: 128, align: 64, extraData: i128 0)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !882, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !947, templateParams: !23, identifier: "fb37c399e04d1117cfdf49fc8e0ef2cd")
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !946, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!949 = !DIDerivedType(tag: DW_TAG_member, scope: !882, file: !2, baseType: !98, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !875, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!823, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[&str; 1]", baseType: !954, size: 64, align: 64, dwarfAddressSpace: 0)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 128, align: 64, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1, lowerBound: 0)
!957 = !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17hed9b362d7a5a2e7aE", scope: !823, file: !821, line: 341, type: !951, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !23)
!958 = !{!819}
!959 = !DILocation(line: 0, scope: !820, inlinedAt: !960)
!960 = distinct !DILocation(line: 106, column: 38, scope: !961, inlinedAt: !976)
!961 = !DILexicalBlockFile(scope: !963, file: !962, discriminator: 0)
!962 = !DIFile(filename: "/home/arsalan/Documents/Github/unsafe-rust-benchmark/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "6585507958cf42cd7ac7ae9875a25d92")
!963 = distinct !DISubprogram(name: "new", linkageName: "_ZN4core4time8Duration3new17h688ee3ab1176799dE", scope: !597, file: !595, line: 211, type: !964, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, declaration: !966, retainedNodes: !967)
!964 = !DISubroutineType(types: !965)
!965 = !{!597, !98, !479}
!966 = !DISubprogram(name: "new", linkageName: "_ZN4core4time8Duration3new17h688ee3ab1176799dE", scope: !597, file: !595, line: 211, type: !964, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagOptimized, templateParams: !23)
!967 = !{!968, !969, !970, !972, !974}
!968 = !DILocalVariable(name: "secs", arg: 1, scope: !963, file: !595, line: 211, type: !98)
!969 = !DILocalVariable(name: "nanos", arg: 2, scope: !963, file: !595, line: 211, type: !479)
!970 = !DILocalVariable(name: "secs", scope: !971, file: !595, line: 216, type: !98, align: 8)
!971 = distinct !DILexicalBlock(scope: !963, file: !595, line: 216, column: 13)
!972 = !DILocalVariable(name: "secs", scope: !973, file: !595, line: 217, type: !98, align: 8)
!973 = distinct !DILexicalBlock(scope: !963, file: !595, line: 217, column: 17)
!974 = !DILocalVariable(name: "nanos", scope: !975, file: !595, line: 220, type: !479, align: 4)
!975 = distinct !DILexicalBlock(scope: !971, file: !595, line: 220, column: 13)
!976 = distinct !DILocation(line: 144, column: 25, scope: !627, inlinedAt: !673)
!977 = !DILocation(line: 0, scope: !963, inlinedAt: !976)
!978 = !DILocalVariable(name: "self", arg: 1, scope: !979, file: !570, line: 457, type: !98)
!979 = distinct !DILexicalBlock(scope: !980, file: !570, line: 457, column: 9)
!980 = distinct !DISubprogram(name: "checked_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$11checked_add17hbc5292a78269e0d2E", scope: !572, file: !570, line: 457, type: !981, scopeLine: 457, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{!517, !98, !98}
!983 = !{!978, !984, !985, !987}
!984 = !DILocalVariable(name: "rhs", arg: 2, scope: !979, file: !570, line: 457, type: !98)
!985 = !DILocalVariable(name: "a", scope: !986, file: !570, line: 458, type: !98, align: 8)
!986 = distinct !DILexicalBlock(scope: !979, file: !570, line: 458, column: 13)
!987 = !DILocalVariable(name: "b", scope: !986, file: !570, line: 458, type: !423, align: 1)
!988 = !DILocation(line: 0, scope: !979, inlinedAt: !989)
!989 = distinct !DILocation(line: 216, column: 35, scope: !963, inlinedAt: !976)
!990 = !DILocalVariable(name: "self", arg: 1, scope: !991, file: !570, line: 2088, type: !98)
!991 = distinct !DILexicalBlock(scope: !992, file: !570, line: 2088, column: 9)
!992 = distinct !DISubprogram(name: "overflowing_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$15overflowing_add17h5ebe4574b3037fabE", scope: !572, file: !570, line: 2088, type: !993, scopeLine: 2088, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !56, templateParams: !23, retainedNodes: !999)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !98, !98}
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, bool)", file: !2, size: 128, align: 64, elements: !996, templateParams: !23, identifier: "8c592f1437c6c19826dcc8aa180cd4b0")
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !995, file: !2, baseType: !98, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !995, file: !2, baseType: !423, size: 8, align: 8, offset: 64)
!999 = !{!990, !1000, !1001, !1003}
!1000 = !DILocalVariable(name: "rhs", arg: 2, scope: !991, file: !570, line: 2088, type: !98)
!1001 = !DILocalVariable(name: "a", scope: !1002, file: !570, line: 2089, type: !98, align: 8)
!1002 = distinct !DILexicalBlock(scope: !991, file: !570, line: 2089, column: 13)
!1003 = !DILocalVariable(name: "b", scope: !1002, file: !570, line: 2089, type: !423, align: 1)
!1004 = !DILocation(line: 0, scope: !991, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 458, column: 31, scope: !979, inlinedAt: !989)
!1006 = !DILocation(line: 0, scope: !629, inlinedAt: !673)
!1007 = !DILocation(line: 145, column: 36, scope: !629, inlinedAt: !673)
!1008 = !DILocation(line: 149, column: 9, scope: !640, inlinedAt: !673)
!1009 = !DILocation(line: 147, column: 13, scope: !631, inlinedAt: !673)
!1010 = !DILocation(line: 147, column: 26, scope: !631, inlinedAt: !673)
!1011 = !DILocation(line: 0, scope: !640, inlinedAt: !673)
